/* automatically generated by rust-bindgen 0.72.1 */

pub const MAX_AXIS: u32 = 32;
pub const MAX_SPINDLE: u32 = 8;
pub const MAX_CNCPATH: u32 = 10;
pub const MAX_IFSB_LINE: u32 = 3;
pub const MAX_AXISNAME: u32 = 4;
pub const ALL_AXES: i32 = -1;
pub const ALL_SPINDLES: i32 = -1;
pub const MAX_LOCK_PROG: u32 = 12;
pub const EW_PROTOCOL: i32 = -17;
pub const EW_SOCKET: i32 = -16;
pub const EW_NODLL: i32 = -15;
pub const EW_INIERR: i32 = -14;
pub const EW_ITLOW: i32 = -13;
pub const EW_ITHIGHT: i32 = -12;
pub const EW_BUS: i32 = -11;
pub const EW_SYSTEM2: i32 = -10;
pub const EW_HSSB: i32 = -9;
pub const EW_HANDLE: i32 = -8;
pub const EW_VERSION: i32 = -7;
pub const EW_UNEXP: i32 = -6;
pub const EW_SYSTEM: i32 = -5;
pub const EW_PARITY: i32 = -4;
pub const EW_MMCSYS: i32 = -3;
pub const EW_RESET: i32 = -2;
pub const EW_BUSY: i32 = -1;
pub const EW_OK: u32 = 0;
pub const EW_FUNC: u32 = 1;
pub const EW_NOPMC: u32 = 1;
pub const EW_LENGTH: u32 = 2;
pub const EW_NUMBER: u32 = 3;
pub const EW_RANGE: u32 = 3;
pub const EW_ATTRIB: u32 = 4;
pub const EW_TYPE: u32 = 4;
pub const EW_DATA: u32 = 5;
pub const EW_NOOPT: u32 = 6;
pub const EW_PROT: u32 = 7;
pub const EW_OVRFLOW: u32 = 8;
pub const EW_PARAM: u32 = 9;
pub const EW_BUFFER: u32 = 10;
pub const EW_PATH: u32 = 11;
pub const EW_MODE: u32 = 12;
pub const EW_REJECT: u32 = 13;
pub const EW_DTSRVR: u32 = 14;
pub const EW_ALARM: u32 = 15;
pub const EW_STOP: u32 = 16;
pub const EW_PASSWD: u32 = 17;
pub const EW_PMC: u32 = 18;
pub const EW_PMCHANDLE: u32 = 19;
pub const EW_RD_OVWSTP: u32 = 20;
pub const EW_RD_RSTFIN: u32 = 21;
pub const DNC_NORMAL: i32 = -1;
pub const DNC_CANCEL: i32 = -32768;
pub const DNC_OPENERR: i32 = -514;
pub const DNC_NOFILE: i32 = -516;
pub const DNC_READERR: i32 = -517;
pub const LIB_MODE: u32 = 0;
pub const MOVE_RDPRGPTR: u32 = 1;
pub const PRM_ALLPATH: u32 = 2;
pub const UPLOAD_M02M99: u32 = 3;
pub const MSG_NOCTRL: u32 = 4;
pub const DIAM_RAD_SWITCH: u32 = 5;
pub const MSG_CONV: u32 = 6;
pub const ASYNC_READ_PROG3: u32 = 7;
pub const UP_DNLOAD_EDT: u32 = 8;
pub const PROG_WORD_SRCH: u32 = 9;
pub const ONUM_ZERO_SUP: u32 = 10;
pub const LONG_ISE_FIG: u32 = 11;
pub const INT_CHK_UNIT: u32 = 12;
pub const HZR_PRM_WR_SKIP: u32 = 13;
pub const SLVSRAM_ACCESS: u32 = 14;
pub const GET_SMTCP_STAT: u32 = 15;
pub const TLIFE_OPTION: u32 = 16;
pub const SVGD_MATE_PUNCH: u32 = 17;
pub const READ_FLD_ON: u32 = 18;
pub const DELETE_RECURSIVE: u32 = 19;
pub const READ_ORIG_OPT: u32 = 20;
pub const SVGD_MATE_ORIGIN: u32 = 21;
pub const PUN_SFZN_MDP: u32 = 22;
pub const PAXIS_PATH: u32 = 23;
pub const AXDATA_G198: u32 = 24;
pub const BG_EDIT_SIGNAL: u32 = 25;
pub const UPLOAD_BG: u32 = 26;
pub const TDATA_EXTRACT: u32 = 27;
pub const PROG_CHECK_CMNT: u32 = 28;
pub const INITIAL_AX_CONFIG: u32 = 29;
pub const MGI_SPECIFICATION: u32 = 30;
pub const EFFECTIVE_COND: u32 = 31;
pub const LEVEL8_PROTECT: u32 = 32;
pub const ACTPT_M198: u32 = 33;
pub const SYSINFO_AXIS: u32 = 34;
pub const ALARM_INFO_TYPE: u32 = 35;
pub const PROG_LEDT_SPUP: u32 = 36;
pub const OPMSG_STATUS: u32 = 37;
pub const ASYNC_SEARCHWORD: u32 = 38;
pub const MA_OPT: u32 = 39;
pub const ENABLE_FOCAS_DMA: u32 = 40;
pub const DSHOST_RD_SRCH: u32 = 41;
pub const BG_EDIT_CONTINUE: u32 = 42;
pub const BG_EDIT_GRAPH: u32 = 43;
pub const SEARCHWORD_PNTR: u32 = 44;
pub const PROG_UPLD_PROT: u32 = 45;
pub const POLAR_IPL_POS: u32 = 46;
pub const PRG_NO_RD_PROT: u32 = 47;
pub const TOOL_STORAGE: u32 = 48;
pub const PRG_FMT_CK: u32 = 49;
pub const NCPROG_MODE: u32 = 50;
pub const COMMAND_TIMEOUT: u32 = 51;
pub const PGLOCK_TYPE: u32 = 64;
pub const TLIFE_TOOL0: u32 = 128;
pub const OPPROG_DSP: u32 = 256;
pub const OPPROG_MODE: u32 = 512;
pub const PROGRAM_CHECK: u32 = 1024;
pub const CZPP_NEDPP: u32 = 2048;
pub const MULTI_PATH_MIX_AXIS_NAME: u32 = 4096;
pub const WSETER_GRP: u32 = 8;
pub const WSETER_DATA: u32 = 8;
pub const MAX_POS_BUF: u32 = 2;
pub const TLGS_EMP: u32 = 2147483647;
pub const DC_PRM: u32 = 1;
pub const DC_OFS: u32 = 2;
pub const DC_WKZ: u32 = 3;
pub const DC_MAC: u32 = 4;
pub const DC_PCD: u32 = 5;
pub const DC_RTM: u32 = 6;
pub const MAX_PITCH_GROUP: u32 = 8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbact {
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbact"][::std::mem::size_of::<odbact>() - 16usize];
    ["Alignment of odbact"][::std::mem::align_of::<odbact>() - 8usize];
    ["Offset of field: odbact::dummy"][::std::mem::offset_of!(odbact, dummy) - 0usize];
    ["Offset of field: odbact::data"][::std::mem::offset_of!(odbact, data) - 8usize];
};
pub type ODBACT = odbact;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbact2 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbact2"][::std::mem::size_of::<odbact2>() - 72usize];
    ["Alignment of odbact2"][::std::mem::align_of::<odbact2>() - 8usize];
    ["Offset of field: odbact2::datano"][::std::mem::offset_of!(odbact2, datano) - 0usize];
    ["Offset of field: odbact2::type_"][::std::mem::offset_of!(odbact2, type_) - 2usize];
    ["Offset of field: odbact2::data"][::std::mem::offset_of!(odbact2, data) - 8usize];
};
pub type ODBACT2 = odbact2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbaxis {
    pub dummy: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbaxis"][::std::mem::size_of::<odbaxis>() - 264usize];
    ["Alignment of odbaxis"][::std::mem::align_of::<odbaxis>() - 8usize];
    ["Offset of field: odbaxis::dummy"][::std::mem::offset_of!(odbaxis, dummy) - 0usize];
    ["Offset of field: odbaxis::type_"][::std::mem::offset_of!(odbaxis, type_) - 2usize];
    ["Offset of field: odbaxis::data"][::std::mem::offset_of!(odbaxis, data) - 8usize];
};
pub type ODBAXIS = odbaxis;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbaxis_ex {
    pub counter: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbaxis_ex"][::std::mem::size_of::<odbaxis_ex>() - 264usize];
    ["Alignment of odbaxis_ex"][::std::mem::align_of::<odbaxis_ex>() - 8usize];
    ["Offset of field: odbaxis_ex::counter"][::std::mem::offset_of!(odbaxis_ex, counter) - 0usize];
    ["Offset of field: odbaxis_ex::type_"][::std::mem::offset_of!(odbaxis_ex, type_) - 2usize];
    ["Offset of field: odbaxis_ex::data"][::std::mem::offset_of!(odbaxis_ex, data) - 8usize];
};
pub type ODBAXIS_EX = odbaxis_ex;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct realdata {
    pub val: f64,
    pub dec: ::std::os::raw::c_long,
    pub dummy: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of realdata"][::std::mem::size_of::<realdata>() - 24usize];
    ["Alignment of realdata"][::std::mem::align_of::<realdata>() - 8usize];
    ["Offset of field: realdata::val"][::std::mem::offset_of!(realdata, val) - 0usize];
    ["Offset of field: realdata::dec"][::std::mem::offset_of!(realdata, dec) - 8usize];
    ["Offset of field: realdata::dummy"][::std::mem::offset_of!(realdata, dummy) - 16usize];
};
pub type REALDATA = realdata;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbwra64 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: [REALDATA; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbwra64"][::std::mem::size_of::<idbwra64>() - 776usize];
    ["Alignment of idbwra64"][::std::mem::align_of::<idbwra64>() - 8usize];
    ["Offset of field: idbwra64::datano"][::std::mem::offset_of!(idbwra64, datano) - 0usize];
    ["Offset of field: idbwra64::type_"][::std::mem::offset_of!(idbwra64, type_) - 2usize];
    ["Offset of field: idbwra64::dummy"][::std::mem::offset_of!(idbwra64, dummy) - 4usize];
    ["Offset of field: idbwra64::data"][::std::mem::offset_of!(idbwra64, data) - 8usize];
};
pub type IDBWRA64 = idbwra64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbwrr64 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: [REALDATA; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbwrr64"][::std::mem::size_of::<idbwrr64>() - 776usize];
    ["Alignment of idbwrr64"][::std::mem::align_of::<idbwrr64>() - 8usize];
    ["Offset of field: idbwrr64::datano"][::std::mem::offset_of!(idbwrr64, datano) - 0usize];
    ["Offset of field: idbwrr64::type_"][::std::mem::offset_of!(idbwrr64, type_) - 2usize];
    ["Offset of field: idbwrr64::dummy"][::std::mem::offset_of!(idbwrr64, dummy) - 4usize];
    ["Offset of field: idbwrr64::data"][::std::mem::offset_of!(idbwrr64, data) - 8usize];
};
pub type IDBWRR64 = idbwrr64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbcmd64 {
    pub adrs: ::std::os::raw::c_char,
    pub num: ::std::os::raw::c_char,
    pub flag: ::std::os::raw::c_short,
    pub dec_val: ::std::os::raw::c_long,
    pub cmd_val: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbcmd64"][::std::mem::size_of::<odbcmd64>() - 24usize];
    ["Alignment of odbcmd64"][::std::mem::align_of::<odbcmd64>() - 8usize];
    ["Offset of field: odbcmd64::adrs"][::std::mem::offset_of!(odbcmd64, adrs) - 0usize];
    ["Offset of field: odbcmd64::num"][::std::mem::offset_of!(odbcmd64, num) - 1usize];
    ["Offset of field: odbcmd64::flag"][::std::mem::offset_of!(odbcmd64, flag) - 2usize];
    ["Offset of field: odbcmd64::dec_val"][::std::mem::offset_of!(odbcmd64, dec_val) - 8usize];
    ["Offset of field: odbcmd64::cmd_val"][::std::mem::offset_of!(odbcmd64, cmd_val) - 16usize];
};
pub type ODBCMD64 = odbcmd64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdatrng64 {
    pub data_min: f64,
    pub data_max: f64,
    pub dec: ::std::os::raw::c_long,
    pub status: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdatrng64"][::std::mem::size_of::<odbdatrng64>() - 32usize];
    ["Alignment of odbdatrng64"][::std::mem::align_of::<odbdatrng64>() - 8usize];
    ["Offset of field: odbdatrng64::data_min"]
        [::std::mem::offset_of!(odbdatrng64, data_min) - 0usize];
    ["Offset of field: odbdatrng64::data_max"]
        [::std::mem::offset_of!(odbdatrng64, data_max) - 8usize];
    ["Offset of field: odbdatrng64::dec"][::std::mem::offset_of!(odbdatrng64, dec) - 16usize];
    ["Offset of field: odbdatrng64::status"][::std::mem::offset_of!(odbdatrng64, status) - 24usize];
};
pub type ODBDATRNG64 = odbdatrng64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbzor64 {
    pub datano_s: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub data: [REALDATA; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbzor64"][::std::mem::size_of::<iodbzor64>() - 6152usize];
    ["Alignment of iodbzor64"][::std::mem::align_of::<iodbzor64>() - 8usize];
    ["Offset of field: iodbzor64::datano_s"][::std::mem::offset_of!(iodbzor64, datano_s) - 0usize];
    ["Offset of field: iodbzor64::type_"][::std::mem::offset_of!(iodbzor64, type_) - 2usize];
    ["Offset of field: iodbzor64::datano_e"][::std::mem::offset_of!(iodbzor64, datano_e) - 4usize];
    ["Offset of field: iodbzor64::dummy"][::std::mem::offset_of!(iodbzor64, dummy) - 6usize];
    ["Offset of field: iodbzor64::data"][::std::mem::offset_of!(iodbzor64, data) - 8usize];
};
pub type IODBZOR64 = iodbzor64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbpsd64 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub u: iodbpsd64__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbpsd64__bindgen_ty_1 {
    pub cdata: ::std::os::raw::c_char,
    pub idata: ::std::os::raw::c_short,
    pub ldata: ::std::os::raw::c_long,
    pub rdata: REALDATA,
    pub cdatas: [::std::os::raw::c_char; 32usize],
    pub idatas: [::std::os::raw::c_short; 32usize],
    pub ldatas: [::std::os::raw::c_long; 32usize],
    pub rdatas: [REALDATA; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbpsd64__bindgen_ty_1"]
        [::std::mem::size_of::<iodbpsd64__bindgen_ty_1>() - 768usize];
    ["Alignment of iodbpsd64__bindgen_ty_1"]
        [::std::mem::align_of::<iodbpsd64__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbpsd64__bindgen_ty_1::cdata"]
        [::std::mem::offset_of!(iodbpsd64__bindgen_ty_1, cdata) - 0usize];
    ["Offset of field: iodbpsd64__bindgen_ty_1::idata"]
        [::std::mem::offset_of!(iodbpsd64__bindgen_ty_1, idata) - 0usize];
    ["Offset of field: iodbpsd64__bindgen_ty_1::ldata"]
        [::std::mem::offset_of!(iodbpsd64__bindgen_ty_1, ldata) - 0usize];
    ["Offset of field: iodbpsd64__bindgen_ty_1::rdata"]
        [::std::mem::offset_of!(iodbpsd64__bindgen_ty_1, rdata) - 0usize];
    ["Offset of field: iodbpsd64__bindgen_ty_1::cdatas"]
        [::std::mem::offset_of!(iodbpsd64__bindgen_ty_1, cdatas) - 0usize];
    ["Offset of field: iodbpsd64__bindgen_ty_1::idatas"]
        [::std::mem::offset_of!(iodbpsd64__bindgen_ty_1, idatas) - 0usize];
    ["Offset of field: iodbpsd64__bindgen_ty_1::ldatas"]
        [::std::mem::offset_of!(iodbpsd64__bindgen_ty_1, ldatas) - 0usize];
    ["Offset of field: iodbpsd64__bindgen_ty_1::rdatas"]
        [::std::mem::offset_of!(iodbpsd64__bindgen_ty_1, rdatas) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbpsd64"][::std::mem::size_of::<iodbpsd64>() - 776usize];
    ["Alignment of iodbpsd64"][::std::mem::align_of::<iodbpsd64>() - 8usize];
    ["Offset of field: iodbpsd64::datano"][::std::mem::offset_of!(iodbpsd64, datano) - 0usize];
    ["Offset of field: iodbpsd64::type_"][::std::mem::offset_of!(iodbpsd64, type_) - 2usize];
    ["Offset of field: iodbpsd64::axis"][::std::mem::offset_of!(iodbpsd64, axis) - 4usize];
    ["Offset of field: iodbpsd64::dummy"][::std::mem::offset_of!(iodbpsd64, dummy) - 6usize];
    ["Offset of field: iodbpsd64::u"][::std::mem::offset_of!(iodbpsd64, u) - 8usize];
};
pub type IODBPSD64 = iodbpsd64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbwcsf64 {
    pub dummy1: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy2: [::std::os::raw::c_short; 2usize],
    pub data: [REALDATA; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbwcsf64"][::std::mem::size_of::<iodbwcsf64>() - 776usize];
    ["Alignment of iodbwcsf64"][::std::mem::align_of::<iodbwcsf64>() - 8usize];
    ["Offset of field: iodbwcsf64::dummy1"][::std::mem::offset_of!(iodbwcsf64, dummy1) - 0usize];
    ["Offset of field: iodbwcsf64::type_"][::std::mem::offset_of!(iodbwcsf64, type_) - 2usize];
    ["Offset of field: iodbwcsf64::dummy2"][::std::mem::offset_of!(iodbwcsf64, dummy2) - 4usize];
    ["Offset of field: iodbwcsf64::data"][::std::mem::offset_of!(iodbwcsf64, data) - 8usize];
};
pub type IODBWCSF64 = iodbwcsf64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbzofs64 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: [REALDATA; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbzofs64"][::std::mem::size_of::<iodbzofs64>() - 776usize];
    ["Alignment of iodbzofs64"][::std::mem::align_of::<iodbzofs64>() - 8usize];
    ["Offset of field: iodbzofs64::datano"][::std::mem::offset_of!(iodbzofs64, datano) - 0usize];
    ["Offset of field: iodbzofs64::type_"][::std::mem::offset_of!(iodbzofs64, type_) - 2usize];
    ["Offset of field: iodbzofs64::dummy"][::std::mem::offset_of!(iodbzofs64, dummy) - 4usize];
    ["Offset of field: iodbzofs64::data"][::std::mem::offset_of!(iodbzofs64, data) - 8usize];
};
pub type IODBZOFS64 = iodbzofs64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbaxis64 {
    pub dummy1: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy2: [::std::os::raw::c_short; 2usize],
    pub data: [REALDATA; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbaxis64"][::std::mem::size_of::<odbaxis64>() - 776usize];
    ["Alignment of odbaxis64"][::std::mem::align_of::<odbaxis64>() - 8usize];
    ["Offset of field: odbaxis64::dummy1"][::std::mem::offset_of!(odbaxis64, dummy1) - 0usize];
    ["Offset of field: odbaxis64::type_"][::std::mem::offset_of!(odbaxis64, type_) - 2usize];
    ["Offset of field: odbaxis64::dummy2"][::std::mem::offset_of!(odbaxis64, dummy2) - 4usize];
    ["Offset of field: odbaxis64::data"][::std::mem::offset_of!(odbaxis64, data) - 8usize];
};
pub type ODBAXIS64 = odbaxis64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbaxdt64 {
    pub name: [::std::os::raw::c_char; 4usize],
    pub dummy: [::std::os::raw::c_char; 4usize],
    pub data: f64,
    pub dec: ::std::os::raw::c_short,
    pub unit: ::std::os::raw::c_short,
    pub flag: ::std::os::raw::c_short,
    pub reserve: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbaxdt64"][::std::mem::size_of::<odbaxdt64>() - 24usize];
    ["Alignment of odbaxdt64"][::std::mem::align_of::<odbaxdt64>() - 8usize];
    ["Offset of field: odbaxdt64::name"][::std::mem::offset_of!(odbaxdt64, name) - 0usize];
    ["Offset of field: odbaxdt64::dummy"][::std::mem::offset_of!(odbaxdt64, dummy) - 4usize];
    ["Offset of field: odbaxdt64::data"][::std::mem::offset_of!(odbaxdt64, data) - 8usize];
    ["Offset of field: odbaxdt64::dec"][::std::mem::offset_of!(odbaxdt64, dec) - 16usize];
    ["Offset of field: odbaxdt64::unit"][::std::mem::offset_of!(odbaxdt64, unit) - 18usize];
    ["Offset of field: odbaxdt64::flag"][::std::mem::offset_of!(odbaxdt64, flag) - 20usize];
    ["Offset of field: odbaxdt64::reserve"][::std::mem::offset_of!(odbaxdt64, reserve) - 22usize];
};
pub type ODBAXDT64 = odbaxdt64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbdgn64 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub u: odbdgn64__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbdgn64__bindgen_ty_1 {
    pub cdata: ::std::os::raw::c_char,
    pub idata: ::std::os::raw::c_short,
    pub ldata: ::std::os::raw::c_long,
    pub rdata: REALDATA,
    pub cdatas: [::std::os::raw::c_char; 32usize],
    pub idatas: [::std::os::raw::c_short; 32usize],
    pub ldatas: [::std::os::raw::c_long; 32usize],
    pub rdatas: [REALDATA; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdgn64__bindgen_ty_1"][::std::mem::size_of::<odbdgn64__bindgen_ty_1>() - 768usize];
    ["Alignment of odbdgn64__bindgen_ty_1"]
        [::std::mem::align_of::<odbdgn64__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbdgn64__bindgen_ty_1::cdata"]
        [::std::mem::offset_of!(odbdgn64__bindgen_ty_1, cdata) - 0usize];
    ["Offset of field: odbdgn64__bindgen_ty_1::idata"]
        [::std::mem::offset_of!(odbdgn64__bindgen_ty_1, idata) - 0usize];
    ["Offset of field: odbdgn64__bindgen_ty_1::ldata"]
        [::std::mem::offset_of!(odbdgn64__bindgen_ty_1, ldata) - 0usize];
    ["Offset of field: odbdgn64__bindgen_ty_1::rdata"]
        [::std::mem::offset_of!(odbdgn64__bindgen_ty_1, rdata) - 0usize];
    ["Offset of field: odbdgn64__bindgen_ty_1::cdatas"]
        [::std::mem::offset_of!(odbdgn64__bindgen_ty_1, cdatas) - 0usize];
    ["Offset of field: odbdgn64__bindgen_ty_1::idatas"]
        [::std::mem::offset_of!(odbdgn64__bindgen_ty_1, idatas) - 0usize];
    ["Offset of field: odbdgn64__bindgen_ty_1::ldatas"]
        [::std::mem::offset_of!(odbdgn64__bindgen_ty_1, ldatas) - 0usize];
    ["Offset of field: odbdgn64__bindgen_ty_1::rdatas"]
        [::std::mem::offset_of!(odbdgn64__bindgen_ty_1, rdatas) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdgn64"][::std::mem::size_of::<odbdgn64>() - 776usize];
    ["Alignment of odbdgn64"][::std::mem::align_of::<odbdgn64>() - 8usize];
    ["Offset of field: odbdgn64::datano"][::std::mem::offset_of!(odbdgn64, datano) - 0usize];
    ["Offset of field: odbdgn64::type_"][::std::mem::offset_of!(odbdgn64, type_) - 2usize];
    ["Offset of field: odbdgn64::axis"][::std::mem::offset_of!(odbdgn64, axis) - 4usize];
    ["Offset of field: odbdgn64::dummy"][::std::mem::offset_of!(odbdgn64, dummy) - 6usize];
    ["Offset of field: odbdgn64::u"][::std::mem::offset_of!(odbdgn64, u) - 8usize];
};
pub type ODBDGN64 = odbdgn64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct realmes64 {
    pub mes_val: f64,
    pub dec_val: ::std::os::raw::c_long,
    pub dummy: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of realmes64"][::std::mem::size_of::<realmes64>() - 24usize];
    ["Alignment of realmes64"][::std::mem::align_of::<realmes64>() - 8usize];
    ["Offset of field: realmes64::mes_val"][::std::mem::offset_of!(realmes64, mes_val) - 0usize];
    ["Offset of field: realmes64::dec_val"][::std::mem::offset_of!(realmes64, dec_val) - 8usize];
    ["Offset of field: realmes64::dummy"][::std::mem::offset_of!(realmes64, dummy) - 16usize];
};
pub type REALMES64 = realmes64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbdy {
    pub dummy: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub alarm: ::std::os::raw::c_short,
    pub prgnum: ::std::os::raw::c_short,
    pub prgmnum: ::std::os::raw::c_short,
    pub seqnum: ::std::os::raw::c_long,
    pub actf: ::std::os::raw::c_long,
    pub acts: ::std::os::raw::c_long,
    pub pos: odbdy__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbdy__bindgen_ty_1 {
    pub faxis: odbdy__bindgen_ty_1__bindgen_ty_1,
    pub oaxis: odbdy__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy__bindgen_ty_1__bindgen_ty_1 {
    pub absolute: [::std::os::raw::c_long; 32usize],
    pub machine: [::std::os::raw::c_long; 32usize],
    pub relative: [::std::os::raw::c_long; 32usize],
    pub distance: [::std::os::raw::c_long; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<odbdy__bindgen_ty_1__bindgen_ty_1>() - 1024usize];
    ["Alignment of odbdy__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<odbdy__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbdy__bindgen_ty_1__bindgen_ty_1::absolute"]
        [::std::mem::offset_of!(odbdy__bindgen_ty_1__bindgen_ty_1, absolute) - 0usize];
    ["Offset of field: odbdy__bindgen_ty_1__bindgen_ty_1::machine"]
        [::std::mem::offset_of!(odbdy__bindgen_ty_1__bindgen_ty_1, machine) - 256usize];
    ["Offset of field: odbdy__bindgen_ty_1__bindgen_ty_1::relative"]
        [::std::mem::offset_of!(odbdy__bindgen_ty_1__bindgen_ty_1, relative) - 512usize];
    ["Offset of field: odbdy__bindgen_ty_1__bindgen_ty_1::distance"]
        [::std::mem::offset_of!(odbdy__bindgen_ty_1__bindgen_ty_1, distance) - 768usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy__bindgen_ty_1__bindgen_ty_2 {
    pub absolute: ::std::os::raw::c_long,
    pub machine: ::std::os::raw::c_long,
    pub relative: ::std::os::raw::c_long,
    pub distance: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<odbdy__bindgen_ty_1__bindgen_ty_2>() - 32usize];
    ["Alignment of odbdy__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<odbdy__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: odbdy__bindgen_ty_1__bindgen_ty_2::absolute"]
        [::std::mem::offset_of!(odbdy__bindgen_ty_1__bindgen_ty_2, absolute) - 0usize];
    ["Offset of field: odbdy__bindgen_ty_1__bindgen_ty_2::machine"]
        [::std::mem::offset_of!(odbdy__bindgen_ty_1__bindgen_ty_2, machine) - 8usize];
    ["Offset of field: odbdy__bindgen_ty_1__bindgen_ty_2::relative"]
        [::std::mem::offset_of!(odbdy__bindgen_ty_1__bindgen_ty_2, relative) - 16usize];
    ["Offset of field: odbdy__bindgen_ty_1__bindgen_ty_2::distance"]
        [::std::mem::offset_of!(odbdy__bindgen_ty_1__bindgen_ty_2, distance) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy__bindgen_ty_1"][::std::mem::size_of::<odbdy__bindgen_ty_1>() - 1024usize];
    ["Alignment of odbdy__bindgen_ty_1"][::std::mem::align_of::<odbdy__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbdy__bindgen_ty_1::faxis"]
        [::std::mem::offset_of!(odbdy__bindgen_ty_1, faxis) - 0usize];
    ["Offset of field: odbdy__bindgen_ty_1::oaxis"]
        [::std::mem::offset_of!(odbdy__bindgen_ty_1, oaxis) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy"][::std::mem::size_of::<odbdy>() - 1064usize];
    ["Alignment of odbdy"][::std::mem::align_of::<odbdy>() - 8usize];
    ["Offset of field: odbdy::dummy"][::std::mem::offset_of!(odbdy, dummy) - 0usize];
    ["Offset of field: odbdy::axis"][::std::mem::offset_of!(odbdy, axis) - 2usize];
    ["Offset of field: odbdy::alarm"][::std::mem::offset_of!(odbdy, alarm) - 4usize];
    ["Offset of field: odbdy::prgnum"][::std::mem::offset_of!(odbdy, prgnum) - 6usize];
    ["Offset of field: odbdy::prgmnum"][::std::mem::offset_of!(odbdy, prgmnum) - 8usize];
    ["Offset of field: odbdy::seqnum"][::std::mem::offset_of!(odbdy, seqnum) - 16usize];
    ["Offset of field: odbdy::actf"][::std::mem::offset_of!(odbdy, actf) - 24usize];
    ["Offset of field: odbdy::acts"][::std::mem::offset_of!(odbdy, acts) - 32usize];
    ["Offset of field: odbdy::pos"][::std::mem::offset_of!(odbdy, pos) - 40usize];
};
pub type ODBDY = odbdy;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbdy2 {
    pub dummy: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub alarm: ::std::os::raw::c_long,
    pub prgnum: ::std::os::raw::c_long,
    pub prgmnum: ::std::os::raw::c_long,
    pub seqnum: ::std::os::raw::c_long,
    pub actf: ::std::os::raw::c_long,
    pub acts: ::std::os::raw::c_long,
    pub pos: odbdy2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbdy2__bindgen_ty_1 {
    pub faxis: odbdy2__bindgen_ty_1__bindgen_ty_1,
    pub oaxis: odbdy2__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy2__bindgen_ty_1__bindgen_ty_1 {
    pub absolute: [::std::os::raw::c_long; 32usize],
    pub machine: [::std::os::raw::c_long; 32usize],
    pub relative: [::std::os::raw::c_long; 32usize],
    pub distance: [::std::os::raw::c_long; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy2__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<odbdy2__bindgen_ty_1__bindgen_ty_1>() - 1024usize];
    ["Alignment of odbdy2__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<odbdy2__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbdy2__bindgen_ty_1__bindgen_ty_1::absolute"]
        [::std::mem::offset_of!(odbdy2__bindgen_ty_1__bindgen_ty_1, absolute) - 0usize];
    ["Offset of field: odbdy2__bindgen_ty_1__bindgen_ty_1::machine"]
        [::std::mem::offset_of!(odbdy2__bindgen_ty_1__bindgen_ty_1, machine) - 256usize];
    ["Offset of field: odbdy2__bindgen_ty_1__bindgen_ty_1::relative"]
        [::std::mem::offset_of!(odbdy2__bindgen_ty_1__bindgen_ty_1, relative) - 512usize];
    ["Offset of field: odbdy2__bindgen_ty_1__bindgen_ty_1::distance"]
        [::std::mem::offset_of!(odbdy2__bindgen_ty_1__bindgen_ty_1, distance) - 768usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy2__bindgen_ty_1__bindgen_ty_2 {
    pub absolute: ::std::os::raw::c_long,
    pub machine: ::std::os::raw::c_long,
    pub relative: ::std::os::raw::c_long,
    pub distance: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy2__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<odbdy2__bindgen_ty_1__bindgen_ty_2>() - 32usize];
    ["Alignment of odbdy2__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<odbdy2__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: odbdy2__bindgen_ty_1__bindgen_ty_2::absolute"]
        [::std::mem::offset_of!(odbdy2__bindgen_ty_1__bindgen_ty_2, absolute) - 0usize];
    ["Offset of field: odbdy2__bindgen_ty_1__bindgen_ty_2::machine"]
        [::std::mem::offset_of!(odbdy2__bindgen_ty_1__bindgen_ty_2, machine) - 8usize];
    ["Offset of field: odbdy2__bindgen_ty_1__bindgen_ty_2::relative"]
        [::std::mem::offset_of!(odbdy2__bindgen_ty_1__bindgen_ty_2, relative) - 16usize];
    ["Offset of field: odbdy2__bindgen_ty_1__bindgen_ty_2::distance"]
        [::std::mem::offset_of!(odbdy2__bindgen_ty_1__bindgen_ty_2, distance) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy2__bindgen_ty_1"][::std::mem::size_of::<odbdy2__bindgen_ty_1>() - 1024usize];
    ["Alignment of odbdy2__bindgen_ty_1"][::std::mem::align_of::<odbdy2__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbdy2__bindgen_ty_1::faxis"]
        [::std::mem::offset_of!(odbdy2__bindgen_ty_1, faxis) - 0usize];
    ["Offset of field: odbdy2__bindgen_ty_1::oaxis"]
        [::std::mem::offset_of!(odbdy2__bindgen_ty_1, oaxis) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy2"][::std::mem::size_of::<odbdy2>() - 1080usize];
    ["Alignment of odbdy2"][::std::mem::align_of::<odbdy2>() - 8usize];
    ["Offset of field: odbdy2::dummy"][::std::mem::offset_of!(odbdy2, dummy) - 0usize];
    ["Offset of field: odbdy2::axis"][::std::mem::offset_of!(odbdy2, axis) - 2usize];
    ["Offset of field: odbdy2::alarm"][::std::mem::offset_of!(odbdy2, alarm) - 8usize];
    ["Offset of field: odbdy2::prgnum"][::std::mem::offset_of!(odbdy2, prgnum) - 16usize];
    ["Offset of field: odbdy2::prgmnum"][::std::mem::offset_of!(odbdy2, prgmnum) - 24usize];
    ["Offset of field: odbdy2::seqnum"][::std::mem::offset_of!(odbdy2, seqnum) - 32usize];
    ["Offset of field: odbdy2::actf"][::std::mem::offset_of!(odbdy2, actf) - 40usize];
    ["Offset of field: odbdy2::acts"][::std::mem::offset_of!(odbdy2, acts) - 48usize];
    ["Offset of field: odbdy2::pos"][::std::mem::offset_of!(odbdy2, pos) - 56usize];
};
pub type ODBDY2 = odbdy2;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbdy3 {
    pub dummy: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub alarm: ::std::os::raw::c_long,
    pub prgnum: ::std::os::raw::c_long,
    pub prgmnum: ::std::os::raw::c_long,
    pub seqnum: ::std::os::raw::c_long,
    pub actf: ::std::os::raw::c_long,
    pub acts: ::std::os::raw::c_long,
    pub pos: odbdy3__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbdy3__bindgen_ty_1 {
    pub faxis: odbdy3__bindgen_ty_1__bindgen_ty_1,
    pub oaxis: odbdy3__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy3__bindgen_ty_1__bindgen_ty_1 {
    pub absolute: [::std::os::raw::c_long; 32usize],
    pub machine: [::std::os::raw::c_long; 32usize],
    pub relative: [::std::os::raw::c_long; 32usize],
    pub distance: [::std::os::raw::c_long; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy3__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<odbdy3__bindgen_ty_1__bindgen_ty_1>() - 1024usize];
    ["Alignment of odbdy3__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<odbdy3__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbdy3__bindgen_ty_1__bindgen_ty_1::absolute"]
        [::std::mem::offset_of!(odbdy3__bindgen_ty_1__bindgen_ty_1, absolute) - 0usize];
    ["Offset of field: odbdy3__bindgen_ty_1__bindgen_ty_1::machine"]
        [::std::mem::offset_of!(odbdy3__bindgen_ty_1__bindgen_ty_1, machine) - 256usize];
    ["Offset of field: odbdy3__bindgen_ty_1__bindgen_ty_1::relative"]
        [::std::mem::offset_of!(odbdy3__bindgen_ty_1__bindgen_ty_1, relative) - 512usize];
    ["Offset of field: odbdy3__bindgen_ty_1__bindgen_ty_1::distance"]
        [::std::mem::offset_of!(odbdy3__bindgen_ty_1__bindgen_ty_1, distance) - 768usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy3__bindgen_ty_1__bindgen_ty_2 {
    pub absolute: ::std::os::raw::c_long,
    pub machine: ::std::os::raw::c_long,
    pub relative: ::std::os::raw::c_long,
    pub distance: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy3__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<odbdy3__bindgen_ty_1__bindgen_ty_2>() - 32usize];
    ["Alignment of odbdy3__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<odbdy3__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: odbdy3__bindgen_ty_1__bindgen_ty_2::absolute"]
        [::std::mem::offset_of!(odbdy3__bindgen_ty_1__bindgen_ty_2, absolute) - 0usize];
    ["Offset of field: odbdy3__bindgen_ty_1__bindgen_ty_2::machine"]
        [::std::mem::offset_of!(odbdy3__bindgen_ty_1__bindgen_ty_2, machine) - 8usize];
    ["Offset of field: odbdy3__bindgen_ty_1__bindgen_ty_2::relative"]
        [::std::mem::offset_of!(odbdy3__bindgen_ty_1__bindgen_ty_2, relative) - 16usize];
    ["Offset of field: odbdy3__bindgen_ty_1__bindgen_ty_2::distance"]
        [::std::mem::offset_of!(odbdy3__bindgen_ty_1__bindgen_ty_2, distance) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy3__bindgen_ty_1"][::std::mem::size_of::<odbdy3__bindgen_ty_1>() - 1024usize];
    ["Alignment of odbdy3__bindgen_ty_1"][::std::mem::align_of::<odbdy3__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbdy3__bindgen_ty_1::faxis"]
        [::std::mem::offset_of!(odbdy3__bindgen_ty_1, faxis) - 0usize];
    ["Offset of field: odbdy3__bindgen_ty_1::oaxis"]
        [::std::mem::offset_of!(odbdy3__bindgen_ty_1, oaxis) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy3"][::std::mem::size_of::<odbdy3>() - 1080usize];
    ["Alignment of odbdy3"][::std::mem::align_of::<odbdy3>() - 8usize];
    ["Offset of field: odbdy3::dummy"][::std::mem::offset_of!(odbdy3, dummy) - 0usize];
    ["Offset of field: odbdy3::axis"][::std::mem::offset_of!(odbdy3, axis) - 2usize];
    ["Offset of field: odbdy3::alarm"][::std::mem::offset_of!(odbdy3, alarm) - 8usize];
    ["Offset of field: odbdy3::prgnum"][::std::mem::offset_of!(odbdy3, prgnum) - 16usize];
    ["Offset of field: odbdy3::prgmnum"][::std::mem::offset_of!(odbdy3, prgmnum) - 24usize];
    ["Offset of field: odbdy3::seqnum"][::std::mem::offset_of!(odbdy3, seqnum) - 32usize];
    ["Offset of field: odbdy3::actf"][::std::mem::offset_of!(odbdy3, actf) - 40usize];
    ["Offset of field: odbdy3::acts"][::std::mem::offset_of!(odbdy3, acts) - 48usize];
    ["Offset of field: odbdy3::pos"][::std::mem::offset_of!(odbdy3, pos) - 56usize];
};
pub type ODBDY3 = odbdy3;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbdy3m {
    pub dummy: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub alarm: ::std::os::raw::c_long,
    pub prgnum: ::std::os::raw::c_long,
    pub prgmnum: ::std::os::raw::c_long,
    pub seqnum: ::std::os::raw::c_long,
    pub actf: ::std::os::raw::c_long,
    pub acts: ::std::os::raw::c_long,
    pub pos: odbdy3m__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbdy3m__bindgen_ty_1 {
    pub faxis: odbdy3m__bindgen_ty_1__bindgen_ty_1,
    pub oaxis: odbdy3m__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy3m__bindgen_ty_1__bindgen_ty_1 {
    pub absolute: [::std::os::raw::c_long; 32usize],
    pub machine: [::std::os::raw::c_long; 32usize],
    pub relative: [::std::os::raw::c_long; 32usize],
    pub distance: [::std::os::raw::c_long; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy3m__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<odbdy3m__bindgen_ty_1__bindgen_ty_1>() - 1024usize];
    ["Alignment of odbdy3m__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<odbdy3m__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbdy3m__bindgen_ty_1__bindgen_ty_1::absolute"]
        [::std::mem::offset_of!(odbdy3m__bindgen_ty_1__bindgen_ty_1, absolute) - 0usize];
    ["Offset of field: odbdy3m__bindgen_ty_1__bindgen_ty_1::machine"]
        [::std::mem::offset_of!(odbdy3m__bindgen_ty_1__bindgen_ty_1, machine) - 256usize];
    ["Offset of field: odbdy3m__bindgen_ty_1__bindgen_ty_1::relative"]
        [::std::mem::offset_of!(odbdy3m__bindgen_ty_1__bindgen_ty_1, relative) - 512usize];
    ["Offset of field: odbdy3m__bindgen_ty_1__bindgen_ty_1::distance"]
        [::std::mem::offset_of!(odbdy3m__bindgen_ty_1__bindgen_ty_1, distance) - 768usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy3m__bindgen_ty_1__bindgen_ty_2 {
    pub absolute: ::std::os::raw::c_long,
    pub machine: ::std::os::raw::c_long,
    pub relative: ::std::os::raw::c_long,
    pub distance: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy3m__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<odbdy3m__bindgen_ty_1__bindgen_ty_2>() - 32usize];
    ["Alignment of odbdy3m__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<odbdy3m__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: odbdy3m__bindgen_ty_1__bindgen_ty_2::absolute"]
        [::std::mem::offset_of!(odbdy3m__bindgen_ty_1__bindgen_ty_2, absolute) - 0usize];
    ["Offset of field: odbdy3m__bindgen_ty_1__bindgen_ty_2::machine"]
        [::std::mem::offset_of!(odbdy3m__bindgen_ty_1__bindgen_ty_2, machine) - 8usize];
    ["Offset of field: odbdy3m__bindgen_ty_1__bindgen_ty_2::relative"]
        [::std::mem::offset_of!(odbdy3m__bindgen_ty_1__bindgen_ty_2, relative) - 16usize];
    ["Offset of field: odbdy3m__bindgen_ty_1__bindgen_ty_2::distance"]
        [::std::mem::offset_of!(odbdy3m__bindgen_ty_1__bindgen_ty_2, distance) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy3m__bindgen_ty_1"][::std::mem::size_of::<odbdy3m__bindgen_ty_1>() - 1024usize];
    ["Alignment of odbdy3m__bindgen_ty_1"]
        [::std::mem::align_of::<odbdy3m__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbdy3m__bindgen_ty_1::faxis"]
        [::std::mem::offset_of!(odbdy3m__bindgen_ty_1, faxis) - 0usize];
    ["Offset of field: odbdy3m__bindgen_ty_1::oaxis"]
        [::std::mem::offset_of!(odbdy3m__bindgen_ty_1, oaxis) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdy3m"][::std::mem::size_of::<odbdy3m>() - 1080usize];
    ["Alignment of odbdy3m"][::std::mem::align_of::<odbdy3m>() - 8usize];
    ["Offset of field: odbdy3m::dummy"][::std::mem::offset_of!(odbdy3m, dummy) - 0usize];
    ["Offset of field: odbdy3m::axis"][::std::mem::offset_of!(odbdy3m, axis) - 2usize];
    ["Offset of field: odbdy3m::alarm"][::std::mem::offset_of!(odbdy3m, alarm) - 8usize];
    ["Offset of field: odbdy3m::prgnum"][::std::mem::offset_of!(odbdy3m, prgnum) - 16usize];
    ["Offset of field: odbdy3m::prgmnum"][::std::mem::offset_of!(odbdy3m, prgmnum) - 24usize];
    ["Offset of field: odbdy3m::seqnum"][::std::mem::offset_of!(odbdy3m, seqnum) - 32usize];
    ["Offset of field: odbdy3m::actf"][::std::mem::offset_of!(odbdy3m, actf) - 40usize];
    ["Offset of field: odbdy3m::acts"][::std::mem::offset_of!(odbdy3m, acts) - 48usize];
    ["Offset of field: odbdy3m::pos"][::std::mem::offset_of!(odbdy3m, pos) - 56usize];
};
pub type ODBDY3M = odbdy3m;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbwrr {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbwrr"][::std::mem::size_of::<idbwrr>() - 264usize];
    ["Alignment of idbwrr"][::std::mem::align_of::<idbwrr>() - 8usize];
    ["Offset of field: idbwrr::datano"][::std::mem::offset_of!(idbwrr, datano) - 0usize];
    ["Offset of field: idbwrr::type_"][::std::mem::offset_of!(idbwrr, type_) - 2usize];
    ["Offset of field: idbwrr::data"][::std::mem::offset_of!(idbwrr, data) - 8usize];
};
pub type IDBWRR = idbwrr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbwra {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbwra"][::std::mem::size_of::<idbwra>() - 264usize];
    ["Alignment of idbwra"][::std::mem::align_of::<idbwra>() - 8usize];
    ["Offset of field: idbwra::datano"][::std::mem::offset_of!(idbwra, datano) - 0usize];
    ["Offset of field: idbwra::type_"][::std::mem::offset_of!(idbwra, type_) - 2usize];
    ["Offset of field: idbwra::data"][::std::mem::offset_of!(idbwra, data) - 8usize];
};
pub type IDBWRA = idbwra;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbovl {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [[::std::os::raw::c_long; 32usize]; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbovl"][::std::mem::size_of::<iodbovl>() - 520usize];
    ["Alignment of iodbovl"][::std::mem::align_of::<iodbovl>() - 8usize];
    ["Offset of field: iodbovl::datano"][::std::mem::offset_of!(iodbovl, datano) - 0usize];
    ["Offset of field: iodbovl::type_"][::std::mem::offset_of!(iodbovl, type_) - 2usize];
    ["Offset of field: iodbovl::data"][::std::mem::offset_of!(iodbovl, data) - 8usize];
};
pub type IODBOVL = iodbovl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbovlm {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [[::std::os::raw::c_long; 32usize]; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbovlm"][::std::mem::size_of::<iodbovlm>() - 520usize];
    ["Alignment of iodbovlm"][::std::mem::align_of::<iodbovlm>() - 8usize];
    ["Offset of field: iodbovlm::datano"][::std::mem::offset_of!(iodbovlm, datano) - 0usize];
    ["Offset of field: iodbovlm::type_"][::std::mem::offset_of!(iodbovlm, type_) - 2usize];
    ["Offset of field: iodbovlm::data"][::std::mem::offset_of!(iodbovlm, data) - 8usize];
};
pub type IODBOVLM = iodbovlm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbspn {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_short; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbspn"][::std::mem::size_of::<odbspn>() - 20usize];
    ["Alignment of odbspn"][::std::mem::align_of::<odbspn>() - 2usize];
    ["Offset of field: odbspn::datano"][::std::mem::offset_of!(odbspn, datano) - 0usize];
    ["Offset of field: odbspn::type_"][::std::mem::offset_of!(odbspn, type_) - 2usize];
    ["Offset of field: odbspn::data"][::std::mem::offset_of!(odbspn, data) - 4usize];
};
pub type ODBSPN = odbspn;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct poselm {
    pub data: ::std::os::raw::c_long,
    pub dec: ::std::os::raw::c_short,
    pub unit: ::std::os::raw::c_short,
    pub disp: ::std::os::raw::c_short,
    pub name: ::std::os::raw::c_char,
    pub suff: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of poselm"][::std::mem::size_of::<poselm>() - 16usize];
    ["Alignment of poselm"][::std::mem::align_of::<poselm>() - 8usize];
    ["Offset of field: poselm::data"][::std::mem::offset_of!(poselm, data) - 0usize];
    ["Offset of field: poselm::dec"][::std::mem::offset_of!(poselm, dec) - 8usize];
    ["Offset of field: poselm::unit"][::std::mem::offset_of!(poselm, unit) - 10usize];
    ["Offset of field: poselm::disp"][::std::mem::offset_of!(poselm, disp) - 12usize];
    ["Offset of field: poselm::name"][::std::mem::offset_of!(poselm, name) - 14usize];
    ["Offset of field: poselm::suff"][::std::mem::offset_of!(poselm, suff) - 15usize];
};
pub type POSELM = poselm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpos {
    pub abs: POSELM,
    pub mach: POSELM,
    pub rel: POSELM,
    pub dist: POSELM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpos"][::std::mem::size_of::<odbpos>() - 64usize];
    ["Alignment of odbpos"][::std::mem::align_of::<odbpos>() - 8usize];
    ["Offset of field: odbpos::abs"][::std::mem::offset_of!(odbpos, abs) - 0usize];
    ["Offset of field: odbpos::mach"][::std::mem::offset_of!(odbpos, mach) - 16usize];
    ["Offset of field: odbpos::rel"][::std::mem::offset_of!(odbpos, rel) - 32usize];
    ["Offset of field: odbpos::dist"][::std::mem::offset_of!(odbpos, dist) - 48usize];
};
pub type ODBPOS = odbpos;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbhnd {
    pub input: POSELM,
    pub output: POSELM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbhnd"][::std::mem::size_of::<odbhnd>() - 32usize];
    ["Alignment of odbhnd"][::std::mem::align_of::<odbhnd>() - 8usize];
    ["Offset of field: odbhnd::input"][::std::mem::offset_of!(odbhnd, input) - 0usize];
    ["Offset of field: odbhnd::output"][::std::mem::offset_of!(odbhnd, output) - 16usize];
};
pub type ODBHND = odbhnd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct speedelm {
    pub data: ::std::os::raw::c_long,
    pub dec: ::std::os::raw::c_short,
    pub unit: ::std::os::raw::c_short,
    pub disp: ::std::os::raw::c_short,
    pub name: ::std::os::raw::c_char,
    pub suff: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of speedelm"][::std::mem::size_of::<speedelm>() - 16usize];
    ["Alignment of speedelm"][::std::mem::align_of::<speedelm>() - 8usize];
    ["Offset of field: speedelm::data"][::std::mem::offset_of!(speedelm, data) - 0usize];
    ["Offset of field: speedelm::dec"][::std::mem::offset_of!(speedelm, dec) - 8usize];
    ["Offset of field: speedelm::unit"][::std::mem::offset_of!(speedelm, unit) - 10usize];
    ["Offset of field: speedelm::disp"][::std::mem::offset_of!(speedelm, disp) - 12usize];
    ["Offset of field: speedelm::name"][::std::mem::offset_of!(speedelm, name) - 14usize];
    ["Offset of field: speedelm::suff"][::std::mem::offset_of!(speedelm, suff) - 15usize];
};
pub type SPEEDELM = speedelm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbspeed {
    pub actf: SPEEDELM,
    pub acts: SPEEDELM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbspeed"][::std::mem::size_of::<odbspeed>() - 32usize];
    ["Alignment of odbspeed"][::std::mem::align_of::<odbspeed>() - 8usize];
    ["Offset of field: odbspeed::actf"][::std::mem::offset_of!(odbspeed, actf) - 0usize];
    ["Offset of field: odbspeed::acts"][::std::mem::offset_of!(odbspeed, acts) - 16usize];
};
pub type ODBSPEED = odbspeed;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbjogdrun {
    pub jogdrun: SPEEDELM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbjogdrun"][::std::mem::size_of::<odbjogdrun>() - 16usize];
    ["Alignment of odbjogdrun"][::std::mem::align_of::<odbjogdrun>() - 8usize];
    ["Offset of field: odbjogdrun::jogdrun"][::std::mem::offset_of!(odbjogdrun, jogdrun) - 0usize];
};
pub type ODBJOGDRUN = odbjogdrun;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct loadelm {
    pub data: ::std::os::raw::c_long,
    pub dec: ::std::os::raw::c_short,
    pub unit: ::std::os::raw::c_short,
    pub name: ::std::os::raw::c_char,
    pub suff1: ::std::os::raw::c_char,
    pub suff2: ::std::os::raw::c_char,
    pub reserve: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of loadelm"][::std::mem::size_of::<loadelm>() - 16usize];
    ["Alignment of loadelm"][::std::mem::align_of::<loadelm>() - 8usize];
    ["Offset of field: loadelm::data"][::std::mem::offset_of!(loadelm, data) - 0usize];
    ["Offset of field: loadelm::dec"][::std::mem::offset_of!(loadelm, dec) - 8usize];
    ["Offset of field: loadelm::unit"][::std::mem::offset_of!(loadelm, unit) - 10usize];
    ["Offset of field: loadelm::name"][::std::mem::offset_of!(loadelm, name) - 12usize];
    ["Offset of field: loadelm::suff1"][::std::mem::offset_of!(loadelm, suff1) - 13usize];
    ["Offset of field: loadelm::suff2"][::std::mem::offset_of!(loadelm, suff2) - 14usize];
    ["Offset of field: loadelm::reserve"][::std::mem::offset_of!(loadelm, reserve) - 15usize];
};
pub type LOADELM = loadelm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbsvload {
    pub svload: LOADELM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbsvload"][::std::mem::size_of::<odbsvload>() - 16usize];
    ["Alignment of odbsvload"][::std::mem::align_of::<odbsvload>() - 8usize];
    ["Offset of field: odbsvload::svload"][::std::mem::offset_of!(odbsvload, svload) - 0usize];
};
pub type ODBSVLOAD = odbsvload;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbspload {
    pub spload: LOADELM,
    pub spspeed: LOADELM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbspload"][::std::mem::size_of::<odbspload>() - 32usize];
    ["Alignment of odbspload"][::std::mem::align_of::<odbspload>() - 8usize];
    ["Offset of field: odbspload::spload"][::std::mem::offset_of!(odbspload, spload) - 0usize];
    ["Offset of field: odbspload::spspeed"][::std::mem::offset_of!(odbspload, spspeed) - 16usize];
};
pub type ODBSPLOAD = odbspload;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbaxdt {
    pub name: [::std::os::raw::c_char; 4usize],
    pub data: ::std::os::raw::c_long,
    pub dec: ::std::os::raw::c_short,
    pub unit: ::std::os::raw::c_short,
    pub flag: ::std::os::raw::c_short,
    pub reserve: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbaxdt"][::std::mem::size_of::<odbaxdt>() - 24usize];
    ["Alignment of odbaxdt"][::std::mem::align_of::<odbaxdt>() - 8usize];
    ["Offset of field: odbaxdt::name"][::std::mem::offset_of!(odbaxdt, name) - 0usize];
    ["Offset of field: odbaxdt::data"][::std::mem::offset_of!(odbaxdt, data) - 8usize];
    ["Offset of field: odbaxdt::dec"][::std::mem::offset_of!(odbaxdt, dec) - 16usize];
    ["Offset of field: odbaxdt::unit"][::std::mem::offset_of!(odbaxdt, unit) - 18usize];
    ["Offset of field: odbaxdt::flag"][::std::mem::offset_of!(odbaxdt, flag) - 20usize];
    ["Offset of field: odbaxdt::reserve"][::std::mem::offset_of!(odbaxdt, reserve) - 22usize];
};
pub type ODBAXDT = odbaxdt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbcss {
    pub srpm: ::std::os::raw::c_long,
    pub sspm: ::std::os::raw::c_long,
    pub smax: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbcss"][::std::mem::size_of::<odbcss>() - 24usize];
    ["Alignment of odbcss"][::std::mem::align_of::<odbcss>() - 8usize];
    ["Offset of field: odbcss::srpm"][::std::mem::offset_of!(odbcss, srpm) - 0usize];
    ["Offset of field: odbcss::sspm"][::std::mem::offset_of!(odbcss, sspm) - 8usize];
    ["Offset of field: odbcss::smax"][::std::mem::offset_of!(odbcss, smax) - 16usize];
};
pub type ODBCSS = odbcss;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbsiml {
    pub t_code: ::std::os::raw::c_long,
    pub b_code: ::std::os::raw::c_long,
    pub axis_no: ::std::os::raw::c_long,
    pub machine: [::std::os::raw::c_long; 32usize],
    pub dec: [::std::os::raw::c_long; 32usize],
    pub fscsl: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbsiml"][::std::mem::size_of::<odbsiml>() - 544usize];
    ["Alignment of odbsiml"][::std::mem::align_of::<odbsiml>() - 8usize];
    ["Offset of field: odbsiml::t_code"][::std::mem::offset_of!(odbsiml, t_code) - 0usize];
    ["Offset of field: odbsiml::b_code"][::std::mem::offset_of!(odbsiml, b_code) - 8usize];
    ["Offset of field: odbsiml::axis_no"][::std::mem::offset_of!(odbsiml, axis_no) - 16usize];
    ["Offset of field: odbsiml::machine"][::std::mem::offset_of!(odbsiml, machine) - 24usize];
    ["Offset of field: odbsiml::dec"][::std::mem::offset_of!(odbsiml, dec) - 280usize];
    ["Offset of field: odbsiml::fscsl"][::std::mem::offset_of!(odbsiml, fscsl) - 536usize];
};
pub type ODBSIML = odbsiml;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbload {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_short; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbload"][::std::mem::size_of::<odbload>() - 68usize];
    ["Alignment of odbload"][::std::mem::align_of::<odbload>() - 2usize];
    ["Offset of field: odbload::datano"][::std::mem::offset_of!(odbload, datano) - 0usize];
    ["Offset of field: odbload::type_"][::std::mem::offset_of!(odbload, type_) - 2usize];
    ["Offset of field: odbload::data"][::std::mem::offset_of!(odbload, data) - 4usize];
};
pub type ODBLOAD = odbload;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct prgpnt {
    pub prog_no: ::std::os::raw::c_long,
    pub blk_no: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of prgpnt"][::std::mem::size_of::<prgpnt>() - 16usize];
    ["Alignment of prgpnt"][::std::mem::align_of::<prgpnt>() - 8usize];
    ["Offset of field: prgpnt::prog_no"][::std::mem::offset_of!(prgpnt, prog_no) - 0usize];
    ["Offset of field: prgpnt::blk_no"][::std::mem::offset_of!(prgpnt, blk_no) - 8usize];
};
pub type PRGPNT = prgpnt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbactptw {
    pub mprgno: ::std::os::raw::c_long,
    pub mblkno: ::std::os::raw::c_long,
    pub sprgno: ::std::os::raw::c_long,
    pub sblkno: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbactptw"][::std::mem::size_of::<odbactptw>() - 32usize];
    ["Alignment of odbactptw"][::std::mem::align_of::<odbactptw>() - 8usize];
    ["Offset of field: odbactptw::mprgno"][::std::mem::offset_of!(odbactptw, mprgno) - 0usize];
    ["Offset of field: odbactptw::mblkno"][::std::mem::offset_of!(odbactptw, mblkno) - 8usize];
    ["Offset of field: odbactptw::sprgno"][::std::mem::offset_of!(odbactptw, sprgno) - 16usize];
    ["Offset of field: odbactptw::sblkno"][::std::mem::offset_of!(odbactptw, sblkno) - 24usize];
};
pub type ODBACTPTW = odbactptw;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odb5axman {
    pub type1: ::std::os::raw::c_short,
    pub type2: ::std::os::raw::c_short,
    pub type3: ::std::os::raw::c_short,
    pub data1: ::std::os::raw::c_long,
    pub data2: ::std::os::raw::c_long,
    pub data3: ::std::os::raw::c_long,
    pub c1: ::std::os::raw::c_long,
    pub c2: ::std::os::raw::c_long,
    pub dummy: ::std::os::raw::c_long,
    pub td: ::std::os::raw::c_long,
    pub r1: ::std::os::raw::c_long,
    pub r2: ::std::os::raw::c_long,
    pub vr: ::std::os::raw::c_long,
    pub h1: ::std::os::raw::c_long,
    pub h2: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odb5axman"][::std::mem::size_of::<odb5axman>() - 104usize];
    ["Alignment of odb5axman"][::std::mem::align_of::<odb5axman>() - 8usize];
    ["Offset of field: odb5axman::type1"][::std::mem::offset_of!(odb5axman, type1) - 0usize];
    ["Offset of field: odb5axman::type2"][::std::mem::offset_of!(odb5axman, type2) - 2usize];
    ["Offset of field: odb5axman::type3"][::std::mem::offset_of!(odb5axman, type3) - 4usize];
    ["Offset of field: odb5axman::data1"][::std::mem::offset_of!(odb5axman, data1) - 8usize];
    ["Offset of field: odb5axman::data2"][::std::mem::offset_of!(odb5axman, data2) - 16usize];
    ["Offset of field: odb5axman::data3"][::std::mem::offset_of!(odb5axman, data3) - 24usize];
    ["Offset of field: odb5axman::c1"][::std::mem::offset_of!(odb5axman, c1) - 32usize];
    ["Offset of field: odb5axman::c2"][::std::mem::offset_of!(odb5axman, c2) - 40usize];
    ["Offset of field: odb5axman::dummy"][::std::mem::offset_of!(odb5axman, dummy) - 48usize];
    ["Offset of field: odb5axman::td"][::std::mem::offset_of!(odb5axman, td) - 56usize];
    ["Offset of field: odb5axman::r1"][::std::mem::offset_of!(odb5axman, r1) - 64usize];
    ["Offset of field: odb5axman::r2"][::std::mem::offset_of!(odb5axman, r2) - 72usize];
    ["Offset of field: odb5axman::vr"][::std::mem::offset_of!(odb5axman, vr) - 80usize];
    ["Offset of field: odb5axman::h1"][::std::mem::offset_of!(odb5axman, h1) - 88usize];
    ["Offset of field: odb5axman::h2"][::std::mem::offset_of!(odb5axman, h2) - 96usize];
};
pub type ODB5AXMAN = odb5axman;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbposfig {
    pub val: ::std::os::raw::c_long,
    pub dec: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbposfig"][::std::mem::size_of::<odbposfig>() - 16usize];
    ["Alignment of odbposfig"][::std::mem::align_of::<odbposfig>() - 8usize];
    ["Offset of field: odbposfig::val"][::std::mem::offset_of!(odbposfig, val) - 0usize];
    ["Offset of field: odbposfig::dec"][::std::mem::offset_of!(odbposfig, dec) - 8usize];
};
pub type ODBPOSFIG = odbposfig;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdncdgn {
    pub ctrl_word: ::std::os::raw::c_short,
    pub can_word: ::std::os::raw::c_short,
    pub nc_file: [::std::os::raw::c_char; 16usize],
    pub read_ptr: ::std::os::raw::c_ushort,
    pub write_ptr: ::std::os::raw::c_ushort,
    pub empty_cnt: ::std::os::raw::c_ushort,
    pub total_size: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdncdgn"][::std::mem::size_of::<odbdncdgn>() - 40usize];
    ["Alignment of odbdncdgn"][::std::mem::align_of::<odbdncdgn>() - 8usize];
    ["Offset of field: odbdncdgn::ctrl_word"]
        [::std::mem::offset_of!(odbdncdgn, ctrl_word) - 0usize];
    ["Offset of field: odbdncdgn::can_word"][::std::mem::offset_of!(odbdncdgn, can_word) - 2usize];
    ["Offset of field: odbdncdgn::nc_file"][::std::mem::offset_of!(odbdncdgn, nc_file) - 4usize];
    ["Offset of field: odbdncdgn::read_ptr"][::std::mem::offset_of!(odbdncdgn, read_ptr) - 20usize];
    ["Offset of field: odbdncdgn::write_ptr"]
        [::std::mem::offset_of!(odbdncdgn, write_ptr) - 22usize];
    ["Offset of field: odbdncdgn::empty_cnt"]
        [::std::mem::offset_of!(odbdncdgn, empty_cnt) - 24usize];
    ["Offset of field: odbdncdgn::total_size"]
        [::std::mem::offset_of!(odbdncdgn, total_size) - 32usize];
};
pub type ODBDNCDGN = odbdncdgn;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdncdgn2 {
    pub ctrl_word: ::std::os::raw::c_short,
    pub can_word: ::std::os::raw::c_short,
    pub nc_file: [::std::os::raw::c_char; 64usize],
    pub read_ptr: ::std::os::raw::c_ushort,
    pub write_ptr: ::std::os::raw::c_ushort,
    pub empty_cnt: ::std::os::raw::c_ushort,
    pub total_size: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdncdgn2"][::std::mem::size_of::<odbdncdgn2>() - 88usize];
    ["Alignment of odbdncdgn2"][::std::mem::align_of::<odbdncdgn2>() - 8usize];
    ["Offset of field: odbdncdgn2::ctrl_word"]
        [::std::mem::offset_of!(odbdncdgn2, ctrl_word) - 0usize];
    ["Offset of field: odbdncdgn2::can_word"]
        [::std::mem::offset_of!(odbdncdgn2, can_word) - 2usize];
    ["Offset of field: odbdncdgn2::nc_file"][::std::mem::offset_of!(odbdncdgn2, nc_file) - 4usize];
    ["Offset of field: odbdncdgn2::read_ptr"]
        [::std::mem::offset_of!(odbdncdgn2, read_ptr) - 68usize];
    ["Offset of field: odbdncdgn2::write_ptr"]
        [::std::mem::offset_of!(odbdncdgn2, write_ptr) - 70usize];
    ["Offset of field: odbdncdgn2::empty_cnt"]
        [::std::mem::offset_of!(odbdncdgn2, empty_cnt) - 72usize];
    ["Offset of field: odbdncdgn2::total_size"]
        [::std::mem::offset_of!(odbdncdgn2, total_size) - 80usize];
};
pub type ODBDNCDGN2 = odbdncdgn2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbup {
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbup"][::std::mem::size_of::<odbup>() - 260usize];
    ["Alignment of odbup"][::std::mem::align_of::<odbup>() - 2usize];
    ["Offset of field: odbup::dummy"][::std::mem::offset_of!(odbup, dummy) - 0usize];
    ["Offset of field: odbup::data"][::std::mem::offset_of!(odbup, data) - 4usize];
};
pub type ODBUP = odbup;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbbuf {
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbbuf"][::std::mem::size_of::<odbbuf>() - 6usize];
    ["Alignment of odbbuf"][::std::mem::align_of::<odbbuf>() - 2usize];
    ["Offset of field: odbbuf::dummy"][::std::mem::offset_of!(odbbuf, dummy) - 0usize];
    ["Offset of field: odbbuf::data"][::std::mem::offset_of!(odbbuf, data) - 4usize];
};
pub type ODBBUF = odbbuf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbprgname {
    pub name: [[::std::os::raw::c_char; 256usize]; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbprgname"][::std::mem::size_of::<odbprgname>() - 3072usize];
    ["Alignment of odbprgname"][::std::mem::align_of::<odbprgname>() - 1usize];
    ["Offset of field: odbprgname::name"][::std::mem::offset_of!(odbprgname, name) - 0usize];
};
pub type ODBPRGNAME = odbprgname;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct prgdir {
    pub prg_data: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of prgdir"][::std::mem::size_of::<prgdir>() - 256usize];
    ["Alignment of prgdir"][::std::mem::align_of::<prgdir>() - 1usize];
    ["Offset of field: prgdir::prg_data"][::std::mem::offset_of!(prgdir, prg_data) - 0usize];
};
pub type PRGDIR = prgdir;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbnc {
    pub u: odbnc__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbnc__bindgen_ty_1 {
    pub bin: odbnc__bindgen_ty_1__bindgen_ty_1,
    pub asc: [::std::os::raw::c_char; 31usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbnc__bindgen_ty_1__bindgen_ty_1 {
    pub reg_prg: ::std::os::raw::c_short,
    pub unreg_prg: ::std::os::raw::c_short,
    pub used_mem: ::std::os::raw::c_long,
    pub unused_mem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbnc__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<odbnc__bindgen_ty_1__bindgen_ty_1>() - 24usize];
    ["Alignment of odbnc__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<odbnc__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbnc__bindgen_ty_1__bindgen_ty_1::reg_prg"]
        [::std::mem::offset_of!(odbnc__bindgen_ty_1__bindgen_ty_1, reg_prg) - 0usize];
    ["Offset of field: odbnc__bindgen_ty_1__bindgen_ty_1::unreg_prg"]
        [::std::mem::offset_of!(odbnc__bindgen_ty_1__bindgen_ty_1, unreg_prg) - 2usize];
    ["Offset of field: odbnc__bindgen_ty_1__bindgen_ty_1::used_mem"]
        [::std::mem::offset_of!(odbnc__bindgen_ty_1__bindgen_ty_1, used_mem) - 8usize];
    ["Offset of field: odbnc__bindgen_ty_1__bindgen_ty_1::unused_mem"]
        [::std::mem::offset_of!(odbnc__bindgen_ty_1__bindgen_ty_1, unused_mem) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbnc__bindgen_ty_1"][::std::mem::size_of::<odbnc__bindgen_ty_1>() - 32usize];
    ["Alignment of odbnc__bindgen_ty_1"][::std::mem::align_of::<odbnc__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbnc__bindgen_ty_1::bin"]
        [::std::mem::offset_of!(odbnc__bindgen_ty_1, bin) - 0usize];
    ["Offset of field: odbnc__bindgen_ty_1::asc"]
        [::std::mem::offset_of!(odbnc__bindgen_ty_1, asc) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbnc"][::std::mem::size_of::<odbnc>() - 32usize];
    ["Alignment of odbnc"][::std::mem::align_of::<odbnc>() - 8usize];
    ["Offset of field: odbnc::u"][::std::mem::offset_of!(odbnc, u) - 0usize];
};
pub type ODBNC = odbnc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpro {
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: ::std::os::raw::c_short,
    pub mdata: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpro"][::std::mem::size_of::<odbpro>() - 8usize];
    ["Alignment of odbpro"][::std::mem::align_of::<odbpro>() - 2usize];
    ["Offset of field: odbpro::dummy"][::std::mem::offset_of!(odbpro, dummy) - 0usize];
    ["Offset of field: odbpro::data"][::std::mem::offset_of!(odbpro, data) - 4usize];
    ["Offset of field: odbpro::mdata"][::std::mem::offset_of!(odbpro, mdata) - 6usize];
};
pub type ODBPRO = odbpro;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbexeprg {
    pub name: [::std::os::raw::c_char; 36usize],
    pub o_num: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbexeprg"][::std::mem::size_of::<odbexeprg>() - 48usize];
    ["Alignment of odbexeprg"][::std::mem::align_of::<odbexeprg>() - 8usize];
    ["Offset of field: odbexeprg::name"][::std::mem::offset_of!(odbexeprg, name) - 0usize];
    ["Offset of field: odbexeprg::o_num"][::std::mem::offset_of!(odbexeprg, o_num) - 40usize];
};
pub type ODBEXEPRG = odbexeprg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdncprg {
    pub name: [::std::os::raw::c_char; 36usize],
    pub o_num: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdncprg"][::std::mem::size_of::<odbdncprg>() - 48usize];
    ["Alignment of odbdncprg"][::std::mem::align_of::<odbdncprg>() - 8usize];
    ["Offset of field: odbdncprg::name"][::std::mem::offset_of!(odbdncprg, name) - 0usize];
    ["Offset of field: odbdncprg::o_num"][::std::mem::offset_of!(odbdncprg, o_num) - 40usize];
};
pub type ODBDNCPRG = odbdncprg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbseq {
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbseq"][::std::mem::size_of::<odbseq>() - 16usize];
    ["Alignment of odbseq"][::std::mem::align_of::<odbseq>() - 8usize];
    ["Offset of field: odbseq::dummy"][::std::mem::offset_of!(odbseq, dummy) - 0usize];
    ["Offset of field: odbseq::data"][::std::mem::offset_of!(odbseq, data) - 8usize];
};
pub type ODBSEQ = odbseq;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagEXEPRG {
    pub length: ::std::os::raw::c_ushort,
    pub prep_blk: ::std::os::raw::c_short,
    pub act_blk: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_char; 512usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tagEXEPRG"][::std::mem::size_of::<tagEXEPRG>() - 520usize];
    ["Alignment of tagEXEPRG"][::std::mem::align_of::<tagEXEPRG>() - 2usize];
    ["Offset of field: tagEXEPRG::length"][::std::mem::offset_of!(tagEXEPRG, length) - 0usize];
    ["Offset of field: tagEXEPRG::prep_blk"][::std::mem::offset_of!(tagEXEPRG, prep_blk) - 2usize];
    ["Offset of field: tagEXEPRG::act_blk"][::std::mem::offset_of!(tagEXEPRG, act_blk) - 4usize];
    ["Offset of field: tagEXEPRG::dummy"][::std::mem::offset_of!(tagEXEPRG, dummy) - 6usize];
    ["Offset of field: tagEXEPRG::data"][::std::mem::offset_of!(tagEXEPRG, data) - 8usize];
};
pub type EXEPRG = tagEXEPRG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbexeprginfo {
    pub before_buffering: EXEPRG,
    pub after_buffering: EXEPRG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbexeprginfo"][::std::mem::size_of::<odbexeprginfo>() - 1040usize];
    ["Alignment of odbexeprginfo"][::std::mem::align_of::<odbexeprginfo>() - 2usize];
    ["Offset of field: odbexeprginfo::before_buffering"]
        [::std::mem::offset_of!(odbexeprginfo, before_buffering) - 0usize];
    ["Offset of field: odbexeprginfo::after_buffering"]
        [::std::mem::offset_of!(odbexeprginfo, after_buffering) - 520usize];
};
pub type ODBEXEPRGINFO = odbexeprginfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbmdip {
    pub mdiprog: ::std::os::raw::c_short,
    pub mdipntr: ::std::os::raw::c_long,
    pub crntprog: ::std::os::raw::c_short,
    pub crntpntr: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbmdip"][::std::mem::size_of::<odbmdip>() - 32usize];
    ["Alignment of odbmdip"][::std::mem::align_of::<odbmdip>() - 8usize];
    ["Offset of field: odbmdip::mdiprog"][::std::mem::offset_of!(odbmdip, mdiprog) - 0usize];
    ["Offset of field: odbmdip::mdipntr"][::std::mem::offset_of!(odbmdip, mdipntr) - 8usize];
    ["Offset of field: odbmdip::crntprog"][::std::mem::offset_of!(odbmdip, crntprog) - 16usize];
    ["Offset of field: odbmdip::crntpntr"][::std::mem::offset_of!(odbmdip, crntpntr) - 24usize];
};
pub type ODBMDIP = odbmdip;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbnest {
    pub attrib: ::std::os::raw::c_ulong,
    pub comment: [::std::os::raw::c_char; 64usize],
    pub prog_name: [::std::os::raw::c_char; 245usize],
    pub dummy: [::std::os::raw::c_char; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbnest"][::std::mem::size_of::<odbnest>() - 328usize];
    ["Alignment of odbnest"][::std::mem::align_of::<odbnest>() - 8usize];
    ["Offset of field: odbnest::attrib"][::std::mem::offset_of!(odbnest, attrib) - 0usize];
    ["Offset of field: odbnest::comment"][::std::mem::offset_of!(odbnest, comment) - 8usize];
    ["Offset of field: odbnest::prog_name"][::std::mem::offset_of!(odbnest, prog_name) - 72usize];
    ["Offset of field: odbnest::dummy"][::std::mem::offset_of!(odbnest, dummy) - 317usize];
};
pub type ODBNESTPDF = odbnest;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpdfdrv {
    pub max_num: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub drive: [[::std::os::raw::c_char; 12usize]; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpdfdrv"][::std::mem::size_of::<odbpdfdrv>() - 196usize];
    ["Alignment of odbpdfdrv"][::std::mem::align_of::<odbpdfdrv>() - 2usize];
    ["Offset of field: odbpdfdrv::max_num"][::std::mem::offset_of!(odbpdfdrv, max_num) - 0usize];
    ["Offset of field: odbpdfdrv::dummy"][::std::mem::offset_of!(odbpdfdrv, dummy) - 2usize];
    ["Offset of field: odbpdfdrv::drive"][::std::mem::offset_of!(odbpdfdrv, drive) - 4usize];
};
pub type ODBPDFDRV = odbpdfdrv;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpdfinf {
    pub used_page: ::std::os::raw::c_long,
    pub all_page: ::std::os::raw::c_long,
    pub used_dir: ::std::os::raw::c_long,
    pub all_dir: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpdfinf"][::std::mem::size_of::<odbpdfinf>() - 32usize];
    ["Alignment of odbpdfinf"][::std::mem::align_of::<odbpdfinf>() - 8usize];
    ["Offset of field: odbpdfinf::used_page"]
        [::std::mem::offset_of!(odbpdfinf, used_page) - 0usize];
    ["Offset of field: odbpdfinf::all_page"][::std::mem::offset_of!(odbpdfinf, all_page) - 8usize];
    ["Offset of field: odbpdfinf::used_dir"][::std::mem::offset_of!(odbpdfinf, used_dir) - 16usize];
    ["Offset of field: odbpdfinf::all_dir"][::std::mem::offset_of!(odbpdfinf, all_dir) - 24usize];
};
pub type ODBPDFINF = odbpdfinf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbpdfsdir {
    pub path: [::std::os::raw::c_char; 212usize],
    pub req_num: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbpdfsdir"][::std::mem::size_of::<idbpdfsdir>() - 216usize];
    ["Alignment of idbpdfsdir"][::std::mem::align_of::<idbpdfsdir>() - 2usize];
    ["Offset of field: idbpdfsdir::path"][::std::mem::offset_of!(idbpdfsdir, path) - 0usize];
    ["Offset of field: idbpdfsdir::req_num"]
        [::std::mem::offset_of!(idbpdfsdir, req_num) - 212usize];
    ["Offset of field: idbpdfsdir::dummy"][::std::mem::offset_of!(idbpdfsdir, dummy) - 214usize];
};
pub type IDBPDFSDIR = idbpdfsdir;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpdfsdir {
    pub sub_exist: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub d_f: [::std::os::raw::c_char; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpdfsdir"][::std::mem::size_of::<odbpdfsdir>() - 40usize];
    ["Alignment of odbpdfsdir"][::std::mem::align_of::<odbpdfsdir>() - 2usize];
    ["Offset of field: odbpdfsdir::sub_exist"]
        [::std::mem::offset_of!(odbpdfsdir, sub_exist) - 0usize];
    ["Offset of field: odbpdfsdir::dummy"][::std::mem::offset_of!(odbpdfsdir, dummy) - 2usize];
    ["Offset of field: odbpdfsdir::d_f"][::std::mem::offset_of!(odbpdfsdir, d_f) - 4usize];
};
pub type ODBPDFSDIR = odbpdfsdir;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbpdfadir {
    pub path: [::std::os::raw::c_char; 212usize],
    pub req_num: ::std::os::raw::c_short,
    pub size_kind: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbpdfadir"][::std::mem::size_of::<idbpdfadir>() - 220usize];
    ["Alignment of idbpdfadir"][::std::mem::align_of::<idbpdfadir>() - 2usize];
    ["Offset of field: idbpdfadir::path"][::std::mem::offset_of!(idbpdfadir, path) - 0usize];
    ["Offset of field: idbpdfadir::req_num"]
        [::std::mem::offset_of!(idbpdfadir, req_num) - 212usize];
    ["Offset of field: idbpdfadir::size_kind"]
        [::std::mem::offset_of!(idbpdfadir, size_kind) - 214usize];
    ["Offset of field: idbpdfadir::type_"][::std::mem::offset_of!(idbpdfadir, type_) - 216usize];
    ["Offset of field: idbpdfadir::dummy"][::std::mem::offset_of!(idbpdfadir, dummy) - 218usize];
};
pub type IDBPDFADIR = idbpdfadir;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpdfadir {
    pub data_kind: ::std::os::raw::c_short,
    pub year: ::std::os::raw::c_short,
    pub mon: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub min: ::std::os::raw::c_short,
    pub sec: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub dummy2: ::std::os::raw::c_long,
    pub size: ::std::os::raw::c_long,
    pub attr: ::std::os::raw::c_ulong,
    pub d_f: [::std::os::raw::c_char; 36usize],
    pub comment: [::std::os::raw::c_char; 52usize],
    pub o_time: [::std::os::raw::c_char; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpdfadir"][::std::mem::size_of::<odbpdfadir>() - 144usize];
    ["Alignment of odbpdfadir"][::std::mem::align_of::<odbpdfadir>() - 8usize];
    ["Offset of field: odbpdfadir::data_kind"]
        [::std::mem::offset_of!(odbpdfadir, data_kind) - 0usize];
    ["Offset of field: odbpdfadir::year"][::std::mem::offset_of!(odbpdfadir, year) - 2usize];
    ["Offset of field: odbpdfadir::mon"][::std::mem::offset_of!(odbpdfadir, mon) - 4usize];
    ["Offset of field: odbpdfadir::day"][::std::mem::offset_of!(odbpdfadir, day) - 6usize];
    ["Offset of field: odbpdfadir::hour"][::std::mem::offset_of!(odbpdfadir, hour) - 8usize];
    ["Offset of field: odbpdfadir::min"][::std::mem::offset_of!(odbpdfadir, min) - 10usize];
    ["Offset of field: odbpdfadir::sec"][::std::mem::offset_of!(odbpdfadir, sec) - 12usize];
    ["Offset of field: odbpdfadir::dummy"][::std::mem::offset_of!(odbpdfadir, dummy) - 14usize];
    ["Offset of field: odbpdfadir::dummy2"][::std::mem::offset_of!(odbpdfadir, dummy2) - 16usize];
    ["Offset of field: odbpdfadir::size"][::std::mem::offset_of!(odbpdfadir, size) - 24usize];
    ["Offset of field: odbpdfadir::attr"][::std::mem::offset_of!(odbpdfadir, attr) - 32usize];
    ["Offset of field: odbpdfadir::d_f"][::std::mem::offset_of!(odbpdfadir, d_f) - 40usize];
    ["Offset of field: odbpdfadir::comment"][::std::mem::offset_of!(odbpdfadir, comment) - 76usize];
    ["Offset of field: odbpdfadir::o_time"][::std::mem::offset_of!(odbpdfadir, o_time) - 128usize];
};
pub type ODBPDFADIR = odbpdfadir;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbpdfprg {
    pub path: [::std::os::raw::c_char; 244usize],
    pub size_kind: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbpdfprg"][::std::mem::size_of::<idbpdfprg>() - 250usize];
    ["Alignment of idbpdfprg"][::std::mem::align_of::<idbpdfprg>() - 2usize];
    ["Offset of field: idbpdfprg::path"][::std::mem::offset_of!(idbpdfprg, path) - 0usize];
    ["Offset of field: idbpdfprg::size_kind"]
        [::std::mem::offset_of!(idbpdfprg, size_kind) - 244usize];
    ["Offset of field: idbpdfprg::type_"][::std::mem::offset_of!(idbpdfprg, type_) - 246usize];
    ["Offset of field: idbpdfprg::dummy"][::std::mem::offset_of!(idbpdfprg, dummy) - 248usize];
};
pub type IDBPDFPRG = idbpdfprg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpdfprg {
    pub year: ::std::os::raw::c_short,
    pub mon: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub min: ::std::os::raw::c_short,
    pub sec: ::std::os::raw::c_short,
    pub size: ::std::os::raw::c_long,
    pub attr: ::std::os::raw::c_ulong,
    pub comment: [::std::os::raw::c_char; 52usize],
    pub o_time: [::std::os::raw::c_char; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpdfprg"][::std::mem::size_of::<odbpdfprg>() - 96usize];
    ["Alignment of odbpdfprg"][::std::mem::align_of::<odbpdfprg>() - 8usize];
    ["Offset of field: odbpdfprg::year"][::std::mem::offset_of!(odbpdfprg, year) - 0usize];
    ["Offset of field: odbpdfprg::mon"][::std::mem::offset_of!(odbpdfprg, mon) - 2usize];
    ["Offset of field: odbpdfprg::day"][::std::mem::offset_of!(odbpdfprg, day) - 4usize];
    ["Offset of field: odbpdfprg::hour"][::std::mem::offset_of!(odbpdfprg, hour) - 6usize];
    ["Offset of field: odbpdfprg::min"][::std::mem::offset_of!(odbpdfprg, min) - 8usize];
    ["Offset of field: odbpdfprg::sec"][::std::mem::offset_of!(odbpdfprg, sec) - 10usize];
    ["Offset of field: odbpdfprg::size"][::std::mem::offset_of!(odbpdfprg, size) - 16usize];
    ["Offset of field: odbpdfprg::attr"][::std::mem::offset_of!(odbpdfprg, attr) - 24usize];
    ["Offset of field: odbpdfprg::comment"][::std::mem::offset_of!(odbpdfprg, comment) - 32usize];
    ["Offset of field: odbpdfprg::o_time"][::std::mem::offset_of!(odbpdfprg, o_time) - 84usize];
};
pub type ODBPDFPRG = odbpdfprg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbprtct {
    pub disp: ::std::os::raw::c_short,
    pub edit: ::std::os::raw::c_short,
    pub encd: ::std::os::raw::c_short,
    pub lock: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbprtct"][::std::mem::size_of::<odbprtct>() - 8usize];
    ["Alignment of odbprtct"][::std::mem::align_of::<odbprtct>() - 2usize];
    ["Offset of field: odbprtct::disp"][::std::mem::offset_of!(odbprtct, disp) - 0usize];
    ["Offset of field: odbprtct::edit"][::std::mem::offset_of!(odbprtct, edit) - 2usize];
    ["Offset of field: odbprtct::encd"][::std::mem::offset_of!(odbprtct, encd) - 4usize];
    ["Offset of field: odbprtct::lock"][::std::mem::offset_of!(odbprtct, lock) - 6usize];
};
pub type ODBPRTCT = odbprtct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbprtct2 {
    pub disp: ::std::os::raw::c_short,
    pub edit: ::std::os::raw::c_short,
    pub encd: ::std::os::raw::c_short,
    pub lock: ::std::os::raw::c_short,
    pub output: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbprtct2"][::std::mem::size_of::<odbprtct2>() - 12usize];
    ["Alignment of odbprtct2"][::std::mem::align_of::<odbprtct2>() - 2usize];
    ["Offset of field: odbprtct2::disp"][::std::mem::offset_of!(odbprtct2, disp) - 0usize];
    ["Offset of field: odbprtct2::edit"][::std::mem::offset_of!(odbprtct2, edit) - 2usize];
    ["Offset of field: odbprtct2::encd"][::std::mem::offset_of!(odbprtct2, encd) - 4usize];
    ["Offset of field: odbprtct2::lock"][::std::mem::offset_of!(odbprtct2, lock) - 6usize];
    ["Offset of field: odbprtct2::output"][::std::mem::offset_of!(odbprtct2, output) - 8usize];
    ["Offset of field: odbprtct2::dummy"][::std::mem::offset_of!(odbprtct2, dummy) - 10usize];
};
pub type ODBPRTCT2 = odbprtct2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpdfnfil {
    pub dir_num: ::std::os::raw::c_short,
    pub file_num: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpdfnfil"][::std::mem::size_of::<odbpdfnfil>() - 4usize];
    ["Alignment of odbpdfnfil"][::std::mem::align_of::<odbpdfnfil>() - 2usize];
    ["Offset of field: odbpdfnfil::dir_num"][::std::mem::offset_of!(odbpdfnfil, dir_num) - 0usize];
    ["Offset of field: odbpdfnfil::file_num"]
        [::std::mem::offset_of!(odbpdfnfil, file_num) - 2usize];
};
pub type ODBPDFNFIL = odbpdfnfil;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbpdftdir {
    pub slct: ::std::os::raw::c_ulong,
    pub attr: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbpdftdir"][::std::mem::size_of::<idbpdftdir>() - 16usize];
    ["Alignment of idbpdftdir"][::std::mem::align_of::<idbpdftdir>() - 8usize];
    ["Offset of field: idbpdftdir::slct"][::std::mem::offset_of!(idbpdftdir, slct) - 0usize];
    ["Offset of field: idbpdftdir::attr"][::std::mem::offset_of!(idbpdftdir, attr) - 8usize];
};
pub type IDBPDFTDIR = idbpdftdir;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_dsfile {
    pub path: [::std::os::raw::c_char; 256usize],
    pub fnum: ::std::os::raw::c_long,
    pub offset: ::std::os::raw::c_long,
    pub req_num: ::std::os::raw::c_short,
    pub size_type: ::std::os::raw::c_short,
    pub detail: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_dsfile"][::std::mem::size_of::<in_dsfile>() - 280usize];
    ["Alignment of in_dsfile"][::std::mem::align_of::<in_dsfile>() - 8usize];
    ["Offset of field: in_dsfile::path"][::std::mem::offset_of!(in_dsfile, path) - 0usize];
    ["Offset of field: in_dsfile::fnum"][::std::mem::offset_of!(in_dsfile, fnum) - 256usize];
    ["Offset of field: in_dsfile::offset"][::std::mem::offset_of!(in_dsfile, offset) - 264usize];
    ["Offset of field: in_dsfile::req_num"][::std::mem::offset_of!(in_dsfile, req_num) - 272usize];
    ["Offset of field: in_dsfile::size_type"]
        [::std::mem::offset_of!(in_dsfile, size_type) - 274usize];
    ["Offset of field: in_dsfile::detail"][::std::mem::offset_of!(in_dsfile, detail) - 276usize];
    ["Offset of field: in_dsfile::dummy"][::std::mem::offset_of!(in_dsfile, dummy) - 278usize];
};
pub type IN_DSFILE = in_dsfile;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct out_dsinfo {
    pub type_: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub fnum: ::std::os::raw::c_long,
    pub total: ::std::os::raw::c_long,
    pub remain_h: ::std::os::raw::c_ulong,
    pub remain_l: ::std::os::raw::c_ulong,
    pub dir: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of out_dsinfo"][::std::mem::size_of::<out_dsinfo>() - 296usize];
    ["Alignment of out_dsinfo"][::std::mem::align_of::<out_dsinfo>() - 8usize];
    ["Offset of field: out_dsinfo::type_"][::std::mem::offset_of!(out_dsinfo, type_) - 0usize];
    ["Offset of field: out_dsinfo::dummy"][::std::mem::offset_of!(out_dsinfo, dummy) - 2usize];
    ["Offset of field: out_dsinfo::fnum"][::std::mem::offset_of!(out_dsinfo, fnum) - 8usize];
    ["Offset of field: out_dsinfo::total"][::std::mem::offset_of!(out_dsinfo, total) - 16usize];
    ["Offset of field: out_dsinfo::remain_h"]
        [::std::mem::offset_of!(out_dsinfo, remain_h) - 24usize];
    ["Offset of field: out_dsinfo::remain_l"]
        [::std::mem::offset_of!(out_dsinfo, remain_l) - 32usize];
    ["Offset of field: out_dsinfo::dir"][::std::mem::offset_of!(out_dsinfo, dir) - 40usize];
};
pub type OUT_DSINFO = out_dsinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct out_dsfile {
    pub year: ::std::os::raw::c_short,
    pub mon: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub min: ::std::os::raw::c_short,
    pub sec: ::std::os::raw::c_short,
    pub size: ::std::os::raw::c_long,
    pub attr: ::std::os::raw::c_ulong,
    pub file: [::std::os::raw::c_char; 36usize],
    pub info: [::std::os::raw::c_char; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of out_dsfile"][::std::mem::size_of::<out_dsfile>() - 200usize];
    ["Alignment of out_dsfile"][::std::mem::align_of::<out_dsfile>() - 8usize];
    ["Offset of field: out_dsfile::year"][::std::mem::offset_of!(out_dsfile, year) - 0usize];
    ["Offset of field: out_dsfile::mon"][::std::mem::offset_of!(out_dsfile, mon) - 2usize];
    ["Offset of field: out_dsfile::day"][::std::mem::offset_of!(out_dsfile, day) - 4usize];
    ["Offset of field: out_dsfile::hour"][::std::mem::offset_of!(out_dsfile, hour) - 6usize];
    ["Offset of field: out_dsfile::min"][::std::mem::offset_of!(out_dsfile, min) - 8usize];
    ["Offset of field: out_dsfile::sec"][::std::mem::offset_of!(out_dsfile, sec) - 10usize];
    ["Offset of field: out_dsfile::size"][::std::mem::offset_of!(out_dsfile, size) - 16usize];
    ["Offset of field: out_dsfile::attr"][::std::mem::offset_of!(out_dsfile, attr) - 24usize];
    ["Offset of field: out_dsfile::file"][::std::mem::offset_of!(out_dsfile, file) - 32usize];
    ["Offset of field: out_dsfile::info"][::std::mem::offset_of!(out_dsfile, info) - 68usize];
};
pub type OUT_DSFILE = out_dsfile;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_dsfile_req {
    pub file: [::std::os::raw::c_char; 256usize],
    pub fnum: ::std::os::raw::c_long,
    pub offset: ::std::os::raw::c_long,
    pub detail: ::std::os::raw::c_short,
    pub option: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_dsfile_req"][::std::mem::size_of::<in_dsfile_req>() - 280usize];
    ["Alignment of in_dsfile_req"][::std::mem::align_of::<in_dsfile_req>() - 8usize];
    ["Offset of field: in_dsfile_req::file"][::std::mem::offset_of!(in_dsfile_req, file) - 0usize];
    ["Offset of field: in_dsfile_req::fnum"]
        [::std::mem::offset_of!(in_dsfile_req, fnum) - 256usize];
    ["Offset of field: in_dsfile_req::offset"]
        [::std::mem::offset_of!(in_dsfile_req, offset) - 264usize];
    ["Offset of field: in_dsfile_req::detail"]
        [::std::mem::offset_of!(in_dsfile_req, detail) - 272usize];
    ["Offset of field: in_dsfile_req::option"]
        [::std::mem::offset_of!(in_dsfile_req, option) - 274usize];
};
pub type ODB_IN_DSFILE_REQ = in_dsfile_req;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_stat_dsfile {
    pub req_num: ::std::os::raw::c_short,
    pub size_type: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_stat_dsfile"][::std::mem::size_of::<in_stat_dsfile>() - 4usize];
    ["Alignment of in_stat_dsfile"][::std::mem::align_of::<in_stat_dsfile>() - 2usize];
    ["Offset of field: in_stat_dsfile::req_num"]
        [::std::mem::offset_of!(in_stat_dsfile, req_num) - 0usize];
    ["Offset of field: in_stat_dsfile::size_type"]
        [::std::mem::offset_of!(in_stat_dsfile, size_type) - 2usize];
};
pub type ODB_IN_STAT_DSFILE = in_stat_dsfile;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbembedfinf {
    pub used_page: ::std::os::raw::c_long,
    pub all_page: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbembedfinf"][::std::mem::size_of::<odbembedfinf>() - 16usize];
    ["Alignment of odbembedfinf"][::std::mem::align_of::<odbembedfinf>() - 8usize];
    ["Offset of field: odbembedfinf::used_page"]
        [::std::mem::offset_of!(odbembedfinf, used_page) - 0usize];
    ["Offset of field: odbembedfinf::all_page"]
        [::std::mem::offset_of!(odbembedfinf, all_page) - 8usize];
};
pub type ODBEMBEDFINF = odbembedfinf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtofs {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtofs"][::std::mem::size_of::<odbtofs>() - 16usize];
    ["Alignment of odbtofs"][::std::mem::align_of::<odbtofs>() - 8usize];
    ["Offset of field: odbtofs::datano"][::std::mem::offset_of!(odbtofs, datano) - 0usize];
    ["Offset of field: odbtofs::type_"][::std::mem::offset_of!(odbtofs, type_) - 2usize];
    ["Offset of field: odbtofs::data"][::std::mem::offset_of!(odbtofs, data) - 8usize];
};
pub type ODBTOFS = odbtofs;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbto {
    pub datano_s: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub u: iodbto__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbto__bindgen_ty_1 {
    pub m_ofs: [::std::os::raw::c_long; 5usize],
    pub m_ofs_a: [::std::os::raw::c_long; 5usize],
    pub m_ofs_b: [::std::os::raw::c_long; 10usize],
    pub m_ofs_c: [::std::os::raw::c_long; 20usize],
    pub m_ofs_at: [iodbto__bindgen_ty_1__bindgen_ty_1; 5usize],
    pub m_ofs_bt: [iodbto__bindgen_ty_1__bindgen_ty_2; 5usize],
    pub m_ofs_ct: [iodbto__bindgen_ty_1__bindgen_ty_3; 5usize],
    pub t_tip: [::std::os::raw::c_short; 5usize],
    pub t_ofs: [::std::os::raw::c_long; 5usize],
    pub t_ofs_a: [iodbto__bindgen_ty_1__bindgen_ty_4; 5usize],
    pub t_ofs_b: [iodbto__bindgen_ty_1__bindgen_ty_5; 5usize],
    pub t_ofs_2g: [::std::os::raw::c_long; 15usize],
    pub m_ofs_cnr: [::std::os::raw::c_long; 10usize],
    pub t_ofs_ex: [iodbto__bindgen_ty_1__bindgen_ty_6; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbto__bindgen_ty_1__bindgen_ty_1 {
    pub tip: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbto__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<iodbto__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of iodbto__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<iodbto__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbto__bindgen_ty_1__bindgen_ty_1::tip"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1__bindgen_ty_1, tip) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1__bindgen_ty_1::data"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1__bindgen_ty_1, data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbto__bindgen_ty_1__bindgen_ty_2 {
    pub tip: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbto__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<iodbto__bindgen_ty_1__bindgen_ty_2>() - 24usize];
    ["Alignment of iodbto__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<iodbto__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: iodbto__bindgen_ty_1__bindgen_ty_2::tip"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1__bindgen_ty_2, tip) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1__bindgen_ty_2::data"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1__bindgen_ty_2, data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbto__bindgen_ty_1__bindgen_ty_3 {
    pub tip: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbto__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<iodbto__bindgen_ty_1__bindgen_ty_3>() - 40usize];
    ["Alignment of iodbto__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<iodbto__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: iodbto__bindgen_ty_1__bindgen_ty_3::tip"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1__bindgen_ty_3, tip) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1__bindgen_ty_3::data"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1__bindgen_ty_3, data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbto__bindgen_ty_1__bindgen_ty_4 {
    pub tip: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbto__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<iodbto__bindgen_ty_1__bindgen_ty_4>() - 40usize];
    ["Alignment of iodbto__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<iodbto__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: iodbto__bindgen_ty_1__bindgen_ty_4::tip"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1__bindgen_ty_4, tip) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1__bindgen_ty_4::data"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1__bindgen_ty_4, data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbto__bindgen_ty_1__bindgen_ty_5 {
    pub tip: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbto__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<iodbto__bindgen_ty_1__bindgen_ty_5>() - 72usize];
    ["Alignment of iodbto__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<iodbto__bindgen_ty_1__bindgen_ty_5>() - 8usize];
    ["Offset of field: iodbto__bindgen_ty_1__bindgen_ty_5::tip"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1__bindgen_ty_5, tip) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1__bindgen_ty_5::data"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1__bindgen_ty_5, data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbto__bindgen_ty_1__bindgen_ty_6 {
    pub data: [::std::os::raw::c_long; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbto__bindgen_ty_1__bindgen_ty_6"]
        [::std::mem::size_of::<iodbto__bindgen_ty_1__bindgen_ty_6>() - 16usize];
    ["Alignment of iodbto__bindgen_ty_1__bindgen_ty_6"]
        [::std::mem::align_of::<iodbto__bindgen_ty_1__bindgen_ty_6>() - 8usize];
    ["Offset of field: iodbto__bindgen_ty_1__bindgen_ty_6::data"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1__bindgen_ty_6, data) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbto__bindgen_ty_1"][::std::mem::size_of::<iodbto__bindgen_ty_1>() - 360usize];
    ["Alignment of iodbto__bindgen_ty_1"][::std::mem::align_of::<iodbto__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbto__bindgen_ty_1::m_ofs"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, m_ofs) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::m_ofs_a"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, m_ofs_a) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::m_ofs_b"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, m_ofs_b) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::m_ofs_c"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, m_ofs_c) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::m_ofs_at"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, m_ofs_at) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::m_ofs_bt"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, m_ofs_bt) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::m_ofs_ct"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, m_ofs_ct) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::t_tip"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, t_tip) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::t_ofs"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, t_ofs) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::t_ofs_a"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, t_ofs_a) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::t_ofs_b"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, t_ofs_b) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::t_ofs_2g"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, t_ofs_2g) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::m_ofs_cnr"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, m_ofs_cnr) - 0usize];
    ["Offset of field: iodbto__bindgen_ty_1::t_ofs_ex"]
        [::std::mem::offset_of!(iodbto__bindgen_ty_1, t_ofs_ex) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbto"][::std::mem::size_of::<iodbto>() - 368usize];
    ["Alignment of iodbto"][::std::mem::align_of::<iodbto>() - 8usize];
    ["Offset of field: iodbto::datano_s"][::std::mem::offset_of!(iodbto, datano_s) - 0usize];
    ["Offset of field: iodbto::type_"][::std::mem::offset_of!(iodbto, type_) - 2usize];
    ["Offset of field: iodbto::datano_e"][::std::mem::offset_of!(iodbto, datano_e) - 4usize];
    ["Offset of field: iodbto::u"][::std::mem::offset_of!(iodbto, u) - 8usize];
};
pub type IODBTO = iodbto;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbzofs {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbzofs"][::std::mem::size_of::<iodbzofs>() - 264usize];
    ["Alignment of iodbzofs"][::std::mem::align_of::<iodbzofs>() - 8usize];
    ["Offset of field: iodbzofs::datano"][::std::mem::offset_of!(iodbzofs, datano) - 0usize];
    ["Offset of field: iodbzofs::type_"][::std::mem::offset_of!(iodbzofs, type_) - 2usize];
    ["Offset of field: iodbzofs::data"][::std::mem::offset_of!(iodbzofs, data) - 8usize];
};
pub type IODBZOFS = iodbzofs;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbzor {
    pub datano_s: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbzor"][::std::mem::size_of::<iodbzor>() - 2056usize];
    ["Alignment of iodbzor"][::std::mem::align_of::<iodbzor>() - 8usize];
    ["Offset of field: iodbzor::datano_s"][::std::mem::offset_of!(iodbzor, datano_s) - 0usize];
    ["Offset of field: iodbzor::type_"][::std::mem::offset_of!(iodbzor, type_) - 2usize];
    ["Offset of field: iodbzor::datano_e"][::std::mem::offset_of!(iodbzor, datano_e) - 4usize];
    ["Offset of field: iodbzor::data"][::std::mem::offset_of!(iodbzor, data) - 8usize];
};
pub type IODBZOR = iodbzor;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbjogcmdcode {
    pub adrs: ::std::os::raw::c_char,
    pub num: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbjogcmdcode"][::std::mem::size_of::<iodbjogcmdcode>() - 16usize];
    ["Alignment of iodbjogcmdcode"][::std::mem::align_of::<iodbjogcmdcode>() - 8usize];
    ["Offset of field: iodbjogcmdcode::adrs"]
        [::std::mem::offset_of!(iodbjogcmdcode, adrs) - 0usize];
    ["Offset of field: iodbjogcmdcode::num"][::std::mem::offset_of!(iodbjogcmdcode, num) - 8usize];
};
pub type ODBJOGCMDCODE = iodbjogcmdcode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbjogcmdscode {
    pub adrs: [::std::os::raw::c_char; 4usize],
    pub num: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbjogcmdscode"][::std::mem::size_of::<iodbjogcmdscode>() - 16usize];
    ["Alignment of iodbjogcmdscode"][::std::mem::align_of::<iodbjogcmdscode>() - 8usize];
    ["Offset of field: iodbjogcmdscode::adrs"]
        [::std::mem::offset_of!(iodbjogcmdscode, adrs) - 0usize];
    ["Offset of field: iodbjogcmdscode::num"]
        [::std::mem::offset_of!(iodbjogcmdscode, num) - 8usize];
};
pub type ODBJOGCMDSCODE = iodbjogcmdscode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbjogcmdaxis {
    pub name: [::std::os::raw::c_char; 4usize],
    pub data: ::std::os::raw::c_long,
    pub dec: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbjogcmdaxis"][::std::mem::size_of::<iodbjogcmdaxis>() - 24usize];
    ["Alignment of iodbjogcmdaxis"][::std::mem::align_of::<iodbjogcmdaxis>() - 8usize];
    ["Offset of field: iodbjogcmdaxis::name"]
        [::std::mem::offset_of!(iodbjogcmdaxis, name) - 0usize];
    ["Offset of field: iodbjogcmdaxis::data"]
        [::std::mem::offset_of!(iodbjogcmdaxis, data) - 8usize];
    ["Offset of field: iodbjogcmdaxis::dec"][::std::mem::offset_of!(iodbjogcmdaxis, dec) - 16usize];
};
pub type ODBJOGCMDAXIS = iodbjogcmdaxis;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbjogcmd {
    pub gcode: ODBJOGCMDCODE,
    pub mcode: ODBJOGCMDCODE,
    pub scode: ODBJOGCMDCODE,
    pub tcode: ODBJOGCMDCODE,
    pub bcode: ODBJOGCMDCODE,
    pub padr: ODBJOGCMDCODE,
    pub extscode: [ODBJOGCMDSCODE; 4usize],
    pub axis: [ODBJOGCMDAXIS; 32usize],
    pub axis_cnt: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbjogcmd"][::std::mem::size_of::<odbjogcmd>() - 936usize];
    ["Alignment of odbjogcmd"][::std::mem::align_of::<odbjogcmd>() - 8usize];
    ["Offset of field: odbjogcmd::gcode"][::std::mem::offset_of!(odbjogcmd, gcode) - 0usize];
    ["Offset of field: odbjogcmd::mcode"][::std::mem::offset_of!(odbjogcmd, mcode) - 16usize];
    ["Offset of field: odbjogcmd::scode"][::std::mem::offset_of!(odbjogcmd, scode) - 32usize];
    ["Offset of field: odbjogcmd::tcode"][::std::mem::offset_of!(odbjogcmd, tcode) - 48usize];
    ["Offset of field: odbjogcmd::bcode"][::std::mem::offset_of!(odbjogcmd, bcode) - 64usize];
    ["Offset of field: odbjogcmd::padr"][::std::mem::offset_of!(odbjogcmd, padr) - 80usize];
    ["Offset of field: odbjogcmd::extscode"][::std::mem::offset_of!(odbjogcmd, extscode) - 96usize];
    ["Offset of field: odbjogcmd::axis"][::std::mem::offset_of!(odbjogcmd, axis) - 160usize];
    ["Offset of field: odbjogcmd::axis_cnt"]
        [::std::mem::offset_of!(odbjogcmd, axis_cnt) - 928usize];
};
pub type ODBJOGCMD = odbjogcmd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmstp {
    pub datano_s: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_char; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbmstp"][::std::mem::size_of::<iodbmstp>() - 14usize];
    ["Alignment of iodbmstp"][::std::mem::align_of::<iodbmstp>() - 2usize];
    ["Offset of field: iodbmstp::datano_s"][::std::mem::offset_of!(iodbmstp, datano_s) - 0usize];
    ["Offset of field: iodbmstp::dummy"][::std::mem::offset_of!(iodbmstp, dummy) - 2usize];
    ["Offset of field: iodbmstp::datano_e"][::std::mem::offset_of!(iodbmstp, datano_e) - 4usize];
    ["Offset of field: iodbmstp::data"][::std::mem::offset_of!(iodbmstp, data) - 6usize];
};
pub type IODBMSTP = iodbmstp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct realprm {
    pub prm_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of realprm"][::std::mem::size_of::<realprm>() - 16usize];
    ["Alignment of realprm"][::std::mem::align_of::<realprm>() - 8usize];
    ["Offset of field: realprm::prm_val"][::std::mem::offset_of!(realprm, prm_val) - 0usize];
    ["Offset of field: realprm::dec_val"][::std::mem::offset_of!(realprm, dec_val) - 8usize];
};
pub type REALPRM = realprm;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbpsd {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub u: iodbpsd__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbpsd__bindgen_ty_1 {
    pub cdata: ::std::os::raw::c_char,
    pub idata: ::std::os::raw::c_short,
    pub ldata: ::std::os::raw::c_long,
    pub rdata: REALPRM,
    pub cdatas: [::std::os::raw::c_char; 32usize],
    pub idatas: [::std::os::raw::c_short; 32usize],
    pub ldatas: [::std::os::raw::c_long; 32usize],
    pub rdatas: [REALPRM; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbpsd__bindgen_ty_1"][::std::mem::size_of::<iodbpsd__bindgen_ty_1>() - 512usize];
    ["Alignment of iodbpsd__bindgen_ty_1"]
        [::std::mem::align_of::<iodbpsd__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbpsd__bindgen_ty_1::cdata"]
        [::std::mem::offset_of!(iodbpsd__bindgen_ty_1, cdata) - 0usize];
    ["Offset of field: iodbpsd__bindgen_ty_1::idata"]
        [::std::mem::offset_of!(iodbpsd__bindgen_ty_1, idata) - 0usize];
    ["Offset of field: iodbpsd__bindgen_ty_1::ldata"]
        [::std::mem::offset_of!(iodbpsd__bindgen_ty_1, ldata) - 0usize];
    ["Offset of field: iodbpsd__bindgen_ty_1::rdata"]
        [::std::mem::offset_of!(iodbpsd__bindgen_ty_1, rdata) - 0usize];
    ["Offset of field: iodbpsd__bindgen_ty_1::cdatas"]
        [::std::mem::offset_of!(iodbpsd__bindgen_ty_1, cdatas) - 0usize];
    ["Offset of field: iodbpsd__bindgen_ty_1::idatas"]
        [::std::mem::offset_of!(iodbpsd__bindgen_ty_1, idatas) - 0usize];
    ["Offset of field: iodbpsd__bindgen_ty_1::ldatas"]
        [::std::mem::offset_of!(iodbpsd__bindgen_ty_1, ldatas) - 0usize];
    ["Offset of field: iodbpsd__bindgen_ty_1::rdatas"]
        [::std::mem::offset_of!(iodbpsd__bindgen_ty_1, rdatas) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbpsd"][::std::mem::size_of::<iodbpsd>() - 520usize];
    ["Alignment of iodbpsd"][::std::mem::align_of::<iodbpsd>() - 8usize];
    ["Offset of field: iodbpsd::datano"][::std::mem::offset_of!(iodbpsd, datano) - 0usize];
    ["Offset of field: iodbpsd::type_"][::std::mem::offset_of!(iodbpsd, type_) - 2usize];
    ["Offset of field: iodbpsd::u"][::std::mem::offset_of!(iodbpsd, u) - 8usize];
};
pub type IODBPSD = iodbpsd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbprm {
    pub datano: ::std::os::raw::c_long,
    pub type_: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub info: ::std::os::raw::c_short,
    pub unit: ::std::os::raw::c_short,
    pub data: [iodbprm__bindgen_ty_1; 32usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbprm__bindgen_ty_1 {
    pub prm_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbprm__bindgen_ty_1"][::std::mem::size_of::<iodbprm__bindgen_ty_1>() - 16usize];
    ["Alignment of iodbprm__bindgen_ty_1"]
        [::std::mem::align_of::<iodbprm__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbprm__bindgen_ty_1::prm_val"]
        [::std::mem::offset_of!(iodbprm__bindgen_ty_1, prm_val) - 0usize];
    ["Offset of field: iodbprm__bindgen_ty_1::dec_val"]
        [::std::mem::offset_of!(iodbprm__bindgen_ty_1, dec_val) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbprm"][::std::mem::size_of::<iodbprm>() - 528usize];
    ["Alignment of iodbprm"][::std::mem::align_of::<iodbprm>() - 8usize];
    ["Offset of field: iodbprm::datano"][::std::mem::offset_of!(iodbprm, datano) - 0usize];
    ["Offset of field: iodbprm::type_"][::std::mem::offset_of!(iodbprm, type_) - 8usize];
    ["Offset of field: iodbprm::axis"][::std::mem::offset_of!(iodbprm, axis) - 10usize];
    ["Offset of field: iodbprm::info"][::std::mem::offset_of!(iodbprm, info) - 12usize];
    ["Offset of field: iodbprm::unit"][::std::mem::offset_of!(iodbprm, unit) - 14usize];
    ["Offset of field: iodbprm::data"][::std::mem::offset_of!(iodbprm, data) - 16usize];
};
pub type IODBPRM = iodbprm;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbbook {
    pub param_no: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_char,
    pub type_: ::std::os::raw::c_char,
    pub u: iodbbook__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbbook__bindgen_ty_1 {
    pub cdata: ::std::os::raw::c_char,
    pub idata: ::std::os::raw::c_short,
    pub ldata: ::std::os::raw::c_long,
    pub rdata: REALPRM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbbook__bindgen_ty_1"][::std::mem::size_of::<iodbbook__bindgen_ty_1>() - 16usize];
    ["Alignment of iodbbook__bindgen_ty_1"]
        [::std::mem::align_of::<iodbbook__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbbook__bindgen_ty_1::cdata"]
        [::std::mem::offset_of!(iodbbook__bindgen_ty_1, cdata) - 0usize];
    ["Offset of field: iodbbook__bindgen_ty_1::idata"]
        [::std::mem::offset_of!(iodbbook__bindgen_ty_1, idata) - 0usize];
    ["Offset of field: iodbbook__bindgen_ty_1::ldata"]
        [::std::mem::offset_of!(iodbbook__bindgen_ty_1, ldata) - 0usize];
    ["Offset of field: iodbbook__bindgen_ty_1::rdata"]
        [::std::mem::offset_of!(iodbbook__bindgen_ty_1, rdata) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbbook"][::std::mem::size_of::<iodbbook>() - 24usize];
    ["Alignment of iodbbook"][::std::mem::align_of::<iodbbook>() - 8usize];
    ["Offset of field: iodbbook::param_no"][::std::mem::offset_of!(iodbbook, param_no) - 0usize];
    ["Offset of field: iodbbook::axis"][::std::mem::offset_of!(iodbbook, axis) - 2usize];
    ["Offset of field: iodbbook::type_"][::std::mem::offset_of!(iodbbook, type_) - 3usize];
    ["Offset of field: iodbbook::u"][::std::mem::offset_of!(iodbbook, u) - 8usize];
};
pub type IODBBOOK = iodbbook;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbpi {
    pub datano_s: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_char; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbpi"][::std::mem::size_of::<iodbpi>() - 12usize];
    ["Alignment of iodbpi"][::std::mem::align_of::<iodbpi>() - 2usize];
    ["Offset of field: iodbpi::datano_s"][::std::mem::offset_of!(iodbpi, datano_s) - 0usize];
    ["Offset of field: iodbpi::dummy"][::std::mem::offset_of!(iodbpi, dummy) - 2usize];
    ["Offset of field: iodbpi::datano_e"][::std::mem::offset_of!(iodbpi, datano_e) - 4usize];
    ["Offset of field: iodbpi::data"][::std::mem::offset_of!(iodbpi, data) - 6usize];
};
pub type IODBPI = iodbpi;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbovmst {
    pub adrs: ::std::os::raw::c_char,
    pub num: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbovmst"][::std::mem::size_of::<iodbovmst>() - 16usize];
    ["Alignment of iodbovmst"][::std::mem::align_of::<iodbovmst>() - 8usize];
    ["Offset of field: iodbovmst::adrs"][::std::mem::offset_of!(iodbovmst, adrs) - 0usize];
    ["Offset of field: iodbovmst::num"][::std::mem::offset_of!(iodbovmst, num) - 8usize];
};
pub type IODBOVMST = iodbovmst;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbovstr {
    pub mcode: IODBOVMST,
    pub scode: IODBOVMST,
    pub tcode: IODBOVMST,
    pub bcode: IODBOVMST,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbovstr"][::std::mem::size_of::<iodbovstr>() - 64usize];
    ["Alignment of iodbovstr"][::std::mem::align_of::<iodbovstr>() - 8usize];
    ["Offset of field: iodbovstr::mcode"][::std::mem::offset_of!(iodbovstr, mcode) - 0usize];
    ["Offset of field: iodbovstr::scode"][::std::mem::offset_of!(iodbovstr, scode) - 16usize];
    ["Offset of field: iodbovstr::tcode"][::std::mem::offset_of!(iodbovstr, tcode) - 32usize];
    ["Offset of field: iodbovstr::bcode"][::std::mem::offset_of!(iodbovstr, bcode) - 48usize];
};
pub type IODBOVSTR = iodbovstr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagIODBPITCHBLK {
    pub group_num: ::std::os::raw::c_short,
    pub pginf: [tagIODBPITCHBLK__bindgen_ty_1; 8usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagIODBPITCHBLK__bindgen_ty_1 {
    pub s_no: ::std::os::raw::c_long,
    pub e_no: ::std::os::raw::c_long,
    pub attr: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tagIODBPITCHBLK__bindgen_ty_1"]
        [::std::mem::size_of::<tagIODBPITCHBLK__bindgen_ty_1>() - 24usize];
    ["Alignment of tagIODBPITCHBLK__bindgen_ty_1"]
        [::std::mem::align_of::<tagIODBPITCHBLK__bindgen_ty_1>() - 8usize];
    ["Offset of field: tagIODBPITCHBLK__bindgen_ty_1::s_no"]
        [::std::mem::offset_of!(tagIODBPITCHBLK__bindgen_ty_1, s_no) - 0usize];
    ["Offset of field: tagIODBPITCHBLK__bindgen_ty_1::e_no"]
        [::std::mem::offset_of!(tagIODBPITCHBLK__bindgen_ty_1, e_no) - 8usize];
    ["Offset of field: tagIODBPITCHBLK__bindgen_ty_1::attr"]
        [::std::mem::offset_of!(tagIODBPITCHBLK__bindgen_ty_1, attr) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tagIODBPITCHBLK"][::std::mem::size_of::<tagIODBPITCHBLK>() - 200usize];
    ["Alignment of tagIODBPITCHBLK"][::std::mem::align_of::<tagIODBPITCHBLK>() - 8usize];
    ["Offset of field: tagIODBPITCHBLK::group_num"]
        [::std::mem::offset_of!(tagIODBPITCHBLK, group_num) - 0usize];
    ["Offset of field: tagIODBPITCHBLK::pginf"]
        [::std::mem::offset_of!(tagIODBPITCHBLK, pginf) - 8usize];
};
pub type IODBPITCHBLK = tagIODBPITCHBLK;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagODBVOLC {
    pub start_no: ::std::os::raw::c_long,
    pub start_ax: ::std::os::raw::c_long,
    pub end_no: ::std::os::raw::c_long,
    pub end_ax: ::std::os::raw::c_long,
    pub num: ::std::os::raw::c_long,
    pub type_: ::std::os::raw::c_char,
    pub data: [::std::os::raw::c_long; 72usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tagODBVOLC"][::std::mem::size_of::<tagODBVOLC>() - 624usize];
    ["Alignment of tagODBVOLC"][::std::mem::align_of::<tagODBVOLC>() - 8usize];
    ["Offset of field: tagODBVOLC::start_no"]
        [::std::mem::offset_of!(tagODBVOLC, start_no) - 0usize];
    ["Offset of field: tagODBVOLC::start_ax"]
        [::std::mem::offset_of!(tagODBVOLC, start_ax) - 8usize];
    ["Offset of field: tagODBVOLC::end_no"][::std::mem::offset_of!(tagODBVOLC, end_no) - 16usize];
    ["Offset of field: tagODBVOLC::end_ax"][::std::mem::offset_of!(tagODBVOLC, end_ax) - 24usize];
    ["Offset of field: tagODBVOLC::num"][::std::mem::offset_of!(tagODBVOLC, num) - 32usize];
    ["Offset of field: tagODBVOLC::type_"][::std::mem::offset_of!(tagODBVOLC, type_) - 40usize];
    ["Offset of field: tagODBVOLC::data"][::std::mem::offset_of!(tagODBVOLC, data) - 48usize];
};
pub type ODBVOLC = tagODBVOLC;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbrotvolc {
    pub lin: [::std::os::raw::c_long; 3usize],
    pub rot: [::std::os::raw::c_long; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbrotvolc"][::std::mem::size_of::<iodbrotvolc>() - 48usize];
    ["Alignment of iodbrotvolc"][::std::mem::align_of::<iodbrotvolc>() - 8usize];
    ["Offset of field: iodbrotvolc::lin"][::std::mem::offset_of!(iodbrotvolc, lin) - 0usize];
    ["Offset of field: iodbrotvolc::rot"][::std::mem::offset_of!(iodbrotvolc, rot) - 24usize];
};
pub type IODBROTVOLC = iodbrotvolc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagODBVOLCOMP {
    pub comp: [::std::os::raw::c_long; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tagODBVOLCOMP"][::std::mem::size_of::<tagODBVOLCOMP>() - 40usize];
    ["Alignment of tagODBVOLCOMP"][::std::mem::align_of::<tagODBVOLCOMP>() - 8usize];
    ["Offset of field: tagODBVOLCOMP::comp"][::std::mem::offset_of!(tagODBVOLCOMP, comp) - 0usize];
};
pub type ODBVOLCOMP = tagODBVOLCOMP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbm {
    pub datano: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub mcr_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbm"][::std::mem::size_of::<odbm>() - 24usize];
    ["Alignment of odbm"][::std::mem::align_of::<odbm>() - 8usize];
    ["Offset of field: odbm::datano"][::std::mem::offset_of!(odbm, datano) - 0usize];
    ["Offset of field: odbm::dummy"][::std::mem::offset_of!(odbm, dummy) - 2usize];
    ["Offset of field: odbm::mcr_val"][::std::mem::offset_of!(odbm, mcr_val) - 8usize];
    ["Offset of field: odbm::dec_val"][::std::mem::offset_of!(odbm, dec_val) - 16usize];
};
pub type ODBM = odbm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbm3 {
    pub datano: ::std::os::raw::c_long,
    pub mcr_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbm3"][::std::mem::size_of::<odbm3>() - 24usize];
    ["Alignment of odbm3"][::std::mem::align_of::<odbm3>() - 8usize];
    ["Offset of field: odbm3::datano"][::std::mem::offset_of!(odbm3, datano) - 0usize];
    ["Offset of field: odbm3::mcr_val"][::std::mem::offset_of!(odbm3, mcr_val) - 8usize];
    ["Offset of field: odbm3::dec_val"][::std::mem::offset_of!(odbm3, dec_val) - 16usize];
};
pub type ODBM3 = odbm3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmr {
    pub datano_s: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub data: [iodbmr__bindgen_ty_1; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmr__bindgen_ty_1 {
    pub mcr_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbmr__bindgen_ty_1"][::std::mem::size_of::<iodbmr__bindgen_ty_1>() - 16usize];
    ["Alignment of iodbmr__bindgen_ty_1"][::std::mem::align_of::<iodbmr__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbmr__bindgen_ty_1::mcr_val"]
        [::std::mem::offset_of!(iodbmr__bindgen_ty_1, mcr_val) - 0usize];
    ["Offset of field: iodbmr__bindgen_ty_1::dec_val"]
        [::std::mem::offset_of!(iodbmr__bindgen_ty_1, dec_val) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbmr"][::std::mem::size_of::<iodbmr>() - 88usize];
    ["Alignment of iodbmr"][::std::mem::align_of::<iodbmr>() - 8usize];
    ["Offset of field: iodbmr::datano_s"][::std::mem::offset_of!(iodbmr, datano_s) - 0usize];
    ["Offset of field: iodbmr::dummy"][::std::mem::offset_of!(iodbmr, dummy) - 2usize];
    ["Offset of field: iodbmr::datano_e"][::std::mem::offset_of!(iodbmr, datano_e) - 4usize];
    ["Offset of field: iodbmr::data"][::std::mem::offset_of!(iodbmr, data) - 8usize];
};
pub type IODBMR = iodbmr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmnr {
    pub mcr_val: f64,
    pub name: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbmnr"][::std::mem::size_of::<iodbmnr>() - 24usize];
    ["Alignment of iodbmnr"][::std::mem::align_of::<iodbmnr>() - 8usize];
    ["Offset of field: iodbmnr::mcr_val"][::std::mem::offset_of!(iodbmnr, mcr_val) - 0usize];
    ["Offset of field: iodbmnr::name"][::std::mem::offset_of!(iodbmnr, name) - 8usize];
};
pub type IODBMRN = iodbmnr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmnr3 {
    pub mcr_val: f64,
    pub name: [::std::os::raw::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbmnr3"][::std::mem::size_of::<iodbmnr3>() - 40usize];
    ["Alignment of iodbmnr3"][::std::mem::align_of::<iodbmnr3>() - 8usize];
    ["Offset of field: iodbmnr3::mcr_val"][::std::mem::offset_of!(iodbmnr3, mcr_val) - 0usize];
    ["Offset of field: iodbmnr3::name"][::std::mem::offset_of!(iodbmnr3, name) - 8usize];
};
pub type IODBMRN3 = iodbmnr3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmnr4 {
    pub mcr_val: f64,
    pub name: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbmnr4"][::std::mem::size_of::<iodbmnr4>() - 72usize];
    ["Alignment of iodbmnr4"][::std::mem::align_of::<iodbmnr4>() - 8usize];
    ["Offset of field: iodbmnr4::mcr_val"][::std::mem::offset_of!(iodbmnr4, mcr_val) - 0usize];
    ["Offset of field: iodbmnr4::name"][::std::mem::offset_of!(iodbmnr4, name) - 8usize];
};
pub type IODBMRN4 = iodbmnr4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpm {
    pub datano: ::std::os::raw::c_long,
    pub dummy: ::std::os::raw::c_short,
    pub mcr_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpm"][::std::mem::size_of::<odbpm>() - 32usize];
    ["Alignment of odbpm"][::std::mem::align_of::<odbpm>() - 8usize];
    ["Offset of field: odbpm::datano"][::std::mem::offset_of!(odbpm, datano) - 0usize];
    ["Offset of field: odbpm::dummy"][::std::mem::offset_of!(odbpm, dummy) - 8usize];
    ["Offset of field: odbpm::mcr_val"][::std::mem::offset_of!(odbpm, mcr_val) - 16usize];
    ["Offset of field: odbpm::dec_val"][::std::mem::offset_of!(odbpm, dec_val) - 24usize];
};
pub type ODBPM = odbpm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbpr {
    pub datano_s: ::std::os::raw::c_long,
    pub dummy: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_long,
    pub data: [iodbpr__bindgen_ty_1; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbpr__bindgen_ty_1 {
    pub mcr_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbpr__bindgen_ty_1"][::std::mem::size_of::<iodbpr__bindgen_ty_1>() - 16usize];
    ["Alignment of iodbpr__bindgen_ty_1"][::std::mem::align_of::<iodbpr__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbpr__bindgen_ty_1::mcr_val"]
        [::std::mem::offset_of!(iodbpr__bindgen_ty_1, mcr_val) - 0usize];
    ["Offset of field: iodbpr__bindgen_ty_1::dec_val"]
        [::std::mem::offset_of!(iodbpr__bindgen_ty_1, dec_val) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbpr"][::std::mem::size_of::<iodbpr>() - 104usize];
    ["Alignment of iodbpr"][::std::mem::align_of::<iodbpr>() - 8usize];
    ["Offset of field: iodbpr::datano_s"][::std::mem::offset_of!(iodbpr, datano_s) - 0usize];
    ["Offset of field: iodbpr::dummy"][::std::mem::offset_of!(iodbpr, dummy) - 8usize];
    ["Offset of field: iodbpr::datano_e"][::std::mem::offset_of!(iodbpr, datano_e) - 16usize];
    ["Offset of field: iodbpr::data"][::std::mem::offset_of!(iodbpr, data) - 24usize];
};
pub type IODBPR = iodbpr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtlinf {
    pub ofs_type: ::std::os::raw::c_short,
    pub use_no: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtlinf"][::std::mem::size_of::<odbtlinf>() - 4usize];
    ["Alignment of odbtlinf"][::std::mem::align_of::<odbtlinf>() - 2usize];
    ["Offset of field: odbtlinf::ofs_type"][::std::mem::offset_of!(odbtlinf, ofs_type) - 0usize];
    ["Offset of field: odbtlinf::use_no"][::std::mem::offset_of!(odbtlinf, use_no) - 2usize];
};
pub type ODBTLINF = odbtlinf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtlinf2 {
    pub ofs_type: ::std::os::raw::c_short,
    pub use_no: ::std::os::raw::c_short,
    pub ofs_enable: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtlinf2"][::std::mem::size_of::<odbtlinf2>() - 6usize];
    ["Alignment of odbtlinf2"][::std::mem::align_of::<odbtlinf2>() - 2usize];
    ["Offset of field: odbtlinf2::ofs_type"][::std::mem::offset_of!(odbtlinf2, ofs_type) - 0usize];
    ["Offset of field: odbtlinf2::use_no"][::std::mem::offset_of!(odbtlinf2, use_no) - 2usize];
    ["Offset of field: odbtlinf2::ofs_enable"]
        [::std::mem::offset_of!(odbtlinf2, ofs_enable) - 4usize];
};
pub type ODBTLINF2 = odbtlinf2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbmvinf {
    pub use_no1: ::std::os::raw::c_short,
    pub use_no2: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbmvinf"][::std::mem::size_of::<odbmvinf>() - 4usize];
    ["Alignment of odbmvinf"][::std::mem::align_of::<odbmvinf>() - 2usize];
    ["Offset of field: odbmvinf::use_no1"][::std::mem::offset_of!(odbmvinf, use_no1) - 0usize];
    ["Offset of field: odbmvinf::use_no2"][::std::mem::offset_of!(odbmvinf, use_no2) - 2usize];
};
pub type ODBMVINF = odbmvinf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpminf {
    pub use_no1: ::std::os::raw::c_short,
    pub use_no2: ::std::os::raw::c_short,
    pub v2_type: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpminf"][::std::mem::size_of::<odbpminf>() - 6usize];
    ["Alignment of odbpminf"][::std::mem::align_of::<odbpminf>() - 2usize];
    ["Offset of field: odbpminf::use_no1"][::std::mem::offset_of!(odbpminf, use_no1) - 0usize];
    ["Offset of field: odbpminf::use_no2"][::std::mem::offset_of!(odbpminf, use_no2) - 2usize];
    ["Offset of field: odbpminf::v2_type"][::std::mem::offset_of!(odbpminf, v2_type) - 4usize];
};
pub type ODBPMINF = odbpminf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpminf2 {
    pub use_no1: ::std::os::raw::c_long,
    pub use_no2: ::std::os::raw::c_long,
    pub use_no20: ::std::os::raw::c_long,
    pub v1_type: ::std::os::raw::c_short,
    pub v2_type: ::std::os::raw::c_short,
    pub v20_type: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpminf2"][::std::mem::size_of::<odbpminf2>() - 32usize];
    ["Alignment of odbpminf2"][::std::mem::align_of::<odbpminf2>() - 8usize];
    ["Offset of field: odbpminf2::use_no1"][::std::mem::offset_of!(odbpminf2, use_no1) - 0usize];
    ["Offset of field: odbpminf2::use_no2"][::std::mem::offset_of!(odbpminf2, use_no2) - 8usize];
    ["Offset of field: odbpminf2::use_no20"][::std::mem::offset_of!(odbpminf2, use_no20) - 16usize];
    ["Offset of field: odbpminf2::v1_type"][::std::mem::offset_of!(odbpminf2, v1_type) - 24usize];
    ["Offset of field: odbpminf2::v2_type"][::std::mem::offset_of!(odbpminf2, v2_type) - 26usize];
    ["Offset of field: odbpminf2::v20_type"][::std::mem::offset_of!(odbpminf2, v20_type) - 28usize];
};
pub type ODBPMINF2 = odbpminf2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpminf3 {
    pub use_no1: ::std::os::raw::c_short,
    pub use_no2: ::std::os::raw::c_ulong,
    pub v1_type: ::std::os::raw::c_short,
    pub v2_type: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpminf3"][::std::mem::size_of::<odbpminf3>() - 24usize];
    ["Alignment of odbpminf3"][::std::mem::align_of::<odbpminf3>() - 8usize];
    ["Offset of field: odbpminf3::use_no1"][::std::mem::offset_of!(odbpminf3, use_no1) - 0usize];
    ["Offset of field: odbpminf3::use_no2"][::std::mem::offset_of!(odbpminf3, use_no2) - 8usize];
    ["Offset of field: odbpminf3::v1_type"][::std::mem::offset_of!(odbpminf3, v1_type) - 16usize];
    ["Offset of field: odbpminf3::v2_type"][::std::mem::offset_of!(odbpminf3, v2_type) - 18usize];
};
pub type ODBPMINF3 = odbpminf3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpmvalflg {
    pub exe_type: ::std::os::raw::c_short,
    pub aux_type: ::std::os::raw::c_short,
    pub tlk_type: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbpmvalflg"][::std::mem::size_of::<odbpmvalflg>() - 6usize];
    ["Alignment of odbpmvalflg"][::std::mem::align_of::<odbpmvalflg>() - 2usize];
    ["Offset of field: odbpmvalflg::exe_type"]
        [::std::mem::offset_of!(odbpmvalflg, exe_type) - 0usize];
    ["Offset of field: odbpmvalflg::aux_type"]
        [::std::mem::offset_of!(odbpmvalflg, aux_type) - 2usize];
    ["Offset of field: odbpmvalflg::tlk_type"]
        [::std::mem::offset_of!(odbpmvalflg, tlk_type) - 4usize];
};
pub type ODBPMVALFLG = odbpmvalflg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdatrng {
    pub data_min: ::std::os::raw::c_long,
    pub data_max: ::std::os::raw::c_long,
    pub status: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbdatrng"][::std::mem::size_of::<odbdatrng>() - 24usize];
    ["Alignment of odbdatrng"][::std::mem::align_of::<odbdatrng>() - 8usize];
    ["Offset of field: odbdatrng::data_min"][::std::mem::offset_of!(odbdatrng, data_min) - 0usize];
    ["Offset of field: odbdatrng::data_max"][::std::mem::offset_of!(odbdatrng, data_max) - 8usize];
    ["Offset of field: odbdatrng::status"][::std::mem::offset_of!(odbdatrng, status) - 16usize];
};
pub type ODBDATRNG = odbdatrng;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ODBHOLDATA {
    pub mes_axis: [::std::os::raw::c_char; 2usize],
    pub mes_parl: [::std::os::raw::c_char; 2usize],
    pub mes_val1: [::std::os::raw::c_long; 2usize],
    pub mes_dp1: [::std::os::raw::c_long; 2usize],
    pub mes_val2: [::std::os::raw::c_long; 2usize],
    pub mes_dp2: [::std::os::raw::c_long; 2usize],
    pub mes_val3: [::std::os::raw::c_long; 2usize],
    pub mes_dp3: [::std::os::raw::c_long; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ODBHOLDATA"][::std::mem::size_of::<ODBHOLDATA>() - 104usize];
    ["Alignment of ODBHOLDATA"][::std::mem::align_of::<ODBHOLDATA>() - 8usize];
    ["Offset of field: ODBHOLDATA::mes_axis"]
        [::std::mem::offset_of!(ODBHOLDATA, mes_axis) - 0usize];
    ["Offset of field: ODBHOLDATA::mes_parl"]
        [::std::mem::offset_of!(ODBHOLDATA, mes_parl) - 2usize];
    ["Offset of field: ODBHOLDATA::mes_val1"]
        [::std::mem::offset_of!(ODBHOLDATA, mes_val1) - 8usize];
    ["Offset of field: ODBHOLDATA::mes_dp1"][::std::mem::offset_of!(ODBHOLDATA, mes_dp1) - 24usize];
    ["Offset of field: ODBHOLDATA::mes_val2"]
        [::std::mem::offset_of!(ODBHOLDATA, mes_val2) - 40usize];
    ["Offset of field: ODBHOLDATA::mes_dp2"][::std::mem::offset_of!(ODBHOLDATA, mes_dp2) - 56usize];
    ["Offset of field: ODBHOLDATA::mes_val3"]
        [::std::mem::offset_of!(ODBHOLDATA, mes_val3) - 72usize];
    ["Offset of field: ODBHOLDATA::mes_dp3"][::std::mem::offset_of!(ODBHOLDATA, mes_dp3) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hol64 {
    pub mes_val1: [f64; 2usize],
    pub mes_dp1: [::std::os::raw::c_long; 2usize],
    pub mes_val2: [f64; 2usize],
    pub mes_dp2: [::std::os::raw::c_long; 2usize],
    pub mes_val3: [f64; 2usize],
    pub mes_dp3: [::std::os::raw::c_long; 2usize],
    pub mes_axis: [::std::os::raw::c_char; 2usize],
    pub mes_parl: [::std::os::raw::c_char; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hol64"][::std::mem::size_of::<hol64>() - 104usize];
    ["Alignment of hol64"][::std::mem::align_of::<hol64>() - 8usize];
    ["Offset of field: hol64::mes_val1"][::std::mem::offset_of!(hol64, mes_val1) - 0usize];
    ["Offset of field: hol64::mes_dp1"][::std::mem::offset_of!(hol64, mes_dp1) - 16usize];
    ["Offset of field: hol64::mes_val2"][::std::mem::offset_of!(hol64, mes_val2) - 32usize];
    ["Offset of field: hol64::mes_dp2"][::std::mem::offset_of!(hol64, mes_dp2) - 48usize];
    ["Offset of field: hol64::mes_val3"][::std::mem::offset_of!(hol64, mes_val3) - 64usize];
    ["Offset of field: hol64::mes_dp3"][::std::mem::offset_of!(hol64, mes_dp3) - 80usize];
    ["Offset of field: hol64::mes_axis"][::std::mem::offset_of!(hol64, mes_axis) - 96usize];
    ["Offset of field: hol64::mes_parl"][::std::mem::offset_of!(hol64, mes_parl) - 98usize];
};
pub type ODBHOLDATA64 = hol64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tlmsinf {
    pub t: ::std::os::raw::c_long,
    pub m: ::std::os::raw::c_long,
    pub hm: ::std::os::raw::c_long,
    pub hm_dp: ::std::os::raw::c_long,
    pub tlofs_no: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tlmsinf"][::std::mem::size_of::<tlmsinf>() - 40usize];
    ["Alignment of tlmsinf"][::std::mem::align_of::<tlmsinf>() - 8usize];
    ["Offset of field: tlmsinf::t"][::std::mem::offset_of!(tlmsinf, t) - 0usize];
    ["Offset of field: tlmsinf::m"][::std::mem::offset_of!(tlmsinf, m) - 8usize];
    ["Offset of field: tlmsinf::hm"][::std::mem::offset_of!(tlmsinf, hm) - 16usize];
    ["Offset of field: tlmsinf::hm_dp"][::std::mem::offset_of!(tlmsinf, hm_dp) - 24usize];
    ["Offset of field: tlmsinf::tlofs_no"][::std::mem::offset_of!(tlmsinf, tlofs_no) - 32usize];
};
pub type ODBTLMSINF = tlmsinf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tldata {
    pub tl: ::std::os::raw::c_long,
    pub tl_dp: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tldata"][::std::mem::size_of::<tldata>() - 16usize];
    ["Alignment of tldata"][::std::mem::align_of::<tldata>() - 8usize];
    ["Offset of field: tldata::tl"][::std::mem::offset_of!(tldata, tl) - 0usize];
    ["Offset of field: tldata::tl_dp"][::std::mem::offset_of!(tldata, tl_dp) - 8usize];
};
pub type ODBTLDATA = tldata;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hspinfo {
    pub prminfo: [[::std::os::raw::c_char; 16usize]; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hspinfo"][::std::mem::size_of::<hspinfo>() - 128usize];
    ["Alignment of hspinfo"][::std::mem::align_of::<hspinfo>() - 1usize];
    ["Offset of field: hspinfo::prminfo"][::std::mem::offset_of!(hspinfo, prminfo) - 0usize];
};
pub type HSPINFO = hspinfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub union hspdata {
    pub cdata: [::std::os::raw::c_char; 32usize],
    pub idata: [::std::os::raw::c_short; 32usize],
    pub ldata: [::std::os::raw::c_long; 32usize],
    pub rdata: [REALPRM; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hspdata"][::std::mem::size_of::<hspdata>() - 512usize];
    ["Alignment of hspdata"][::std::mem::align_of::<hspdata>() - 8usize];
    ["Offset of field: hspdata::cdata"][::std::mem::offset_of!(hspdata, cdata) - 0usize];
    ["Offset of field: hspdata::idata"][::std::mem::offset_of!(hspdata, idata) - 0usize];
    ["Offset of field: hspdata::ldata"][::std::mem::offset_of!(hspdata, ldata) - 0usize];
    ["Offset of field: hspdata::rdata"][::std::mem::offset_of!(hspdata, rdata) - 0usize];
};
pub type HSPDATA = hspdata;
#[repr(C)]
#[derive(Copy, Clone)]
pub union hspdatam {
    pub cdata: [::std::os::raw::c_char; 32usize],
    pub idata: [::std::os::raw::c_short; 32usize],
    pub ldata: [::std::os::raw::c_long; 32usize],
    pub rdata: [REALPRM; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hspdatam"][::std::mem::size_of::<hspdatam>() - 512usize];
    ["Alignment of hspdatam"][::std::mem::align_of::<hspdatam>() - 8usize];
    ["Offset of field: hspdatam::cdata"][::std::mem::offset_of!(hspdatam, cdata) - 0usize];
    ["Offset of field: hspdatam::idata"][::std::mem::offset_of!(hspdatam, idata) - 0usize];
    ["Offset of field: hspdatam::ldata"][::std::mem::offset_of!(hspdatam, ldata) - 0usize];
    ["Offset of field: hspdatam::rdata"][::std::mem::offset_of!(hspdatam, rdata) - 0usize];
};
pub type HSPDATAM = hspdatam;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbfofs {
    pub mcrval: ::std::os::raw::c_long,
    pub decval: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbfofs"][::std::mem::size_of::<odbfofs>() - 16usize];
    ["Alignment of odbfofs"][::std::mem::align_of::<odbfofs>() - 8usize];
    ["Offset of field: odbfofs::mcrval"][::std::mem::offset_of!(odbfofs, mcrval) - 0usize];
    ["Offset of field: odbfofs::decval"][::std::mem::offset_of!(odbfofs, decval) - 8usize];
};
pub type ODBFOFS = odbfofs;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbctpr {
    pub data: iodbctpr__bindgen_ty_1,
    pub prm: [iodbctpr__bindgen_ty_2; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbctpr__bindgen_ty_1 {
    pub acc_bipl: [::std::os::raw::c_long; 32usize],
    pub acc_chg_time: ::std::os::raw::c_long,
    pub jerk_acc_diff: [::std::os::raw::c_long; 32usize],
    pub jerk_acc_diff_lin: [::std::os::raw::c_long; 32usize],
    pub jerk_acc_ratio: ::std::os::raw::c_char,
    pub max_acc: [::std::os::raw::c_long; 32usize],
    pub t_con_aipl: [::std::os::raw::c_short; 32usize],
    pub corner_feed_diff: [::std::os::raw::c_long; 32usize],
    pub max_cut_fdrate: [::std::os::raw::c_long; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbctpr__bindgen_ty_1"][::std::mem::size_of::<iodbctpr__bindgen_ty_1>() - 1616usize];
    ["Alignment of iodbctpr__bindgen_ty_1"]
        [::std::mem::align_of::<iodbctpr__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbctpr__bindgen_ty_1::acc_bipl"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_1, acc_bipl) - 0usize];
    ["Offset of field: iodbctpr__bindgen_ty_1::acc_chg_time"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_1, acc_chg_time) - 256usize];
    ["Offset of field: iodbctpr__bindgen_ty_1::jerk_acc_diff"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_1, jerk_acc_diff) - 264usize];
    ["Offset of field: iodbctpr__bindgen_ty_1::jerk_acc_diff_lin"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_1, jerk_acc_diff_lin) - 520usize];
    ["Offset of field: iodbctpr__bindgen_ty_1::jerk_acc_ratio"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_1, jerk_acc_ratio) - 776usize];
    ["Offset of field: iodbctpr__bindgen_ty_1::max_acc"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_1, max_acc) - 784usize];
    ["Offset of field: iodbctpr__bindgen_ty_1::t_con_aipl"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_1, t_con_aipl) - 1040usize];
    ["Offset of field: iodbctpr__bindgen_ty_1::corner_feed_diff"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_1, corner_feed_diff) - 1104usize];
    ["Offset of field: iodbctpr__bindgen_ty_1::max_cut_fdrate"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_1, max_cut_fdrate) - 1360usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbctpr__bindgen_ty_2 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub u: iodbctpr__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbctpr__bindgen_ty_2__bindgen_ty_1 {
    pub cdata: ::std::os::raw::c_char,
    pub idata: ::std::os::raw::c_short,
    pub ldata: ::std::os::raw::c_long,
    pub cdatas: [::std::os::raw::c_char; 32usize],
    pub idatas: [::std::os::raw::c_short; 32usize],
    pub ldatas: [::std::os::raw::c_long; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbctpr__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<iodbctpr__bindgen_ty_2__bindgen_ty_1>() - 256usize];
    ["Alignment of iodbctpr__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::align_of::<iodbctpr__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbctpr__bindgen_ty_2__bindgen_ty_1::cdata"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_2__bindgen_ty_1, cdata) - 0usize];
    ["Offset of field: iodbctpr__bindgen_ty_2__bindgen_ty_1::idata"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_2__bindgen_ty_1, idata) - 0usize];
    ["Offset of field: iodbctpr__bindgen_ty_2__bindgen_ty_1::ldata"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_2__bindgen_ty_1, ldata) - 0usize];
    ["Offset of field: iodbctpr__bindgen_ty_2__bindgen_ty_1::cdatas"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_2__bindgen_ty_1, cdatas) - 0usize];
    ["Offset of field: iodbctpr__bindgen_ty_2__bindgen_ty_1::idatas"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_2__bindgen_ty_1, idatas) - 0usize];
    ["Offset of field: iodbctpr__bindgen_ty_2__bindgen_ty_1::ldatas"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_2__bindgen_ty_1, ldatas) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbctpr__bindgen_ty_2"][::std::mem::size_of::<iodbctpr__bindgen_ty_2>() - 264usize];
    ["Alignment of iodbctpr__bindgen_ty_2"]
        [::std::mem::align_of::<iodbctpr__bindgen_ty_2>() - 8usize];
    ["Offset of field: iodbctpr__bindgen_ty_2::datano"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_2, datano) - 0usize];
    ["Offset of field: iodbctpr__bindgen_ty_2::type_"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_2, type_) - 2usize];
    ["Offset of field: iodbctpr__bindgen_ty_2::u"]
        [::std::mem::offset_of!(iodbctpr__bindgen_ty_2, u) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbctpr"][::std::mem::size_of::<iodbctpr>() - 2144usize];
    ["Alignment of iodbctpr"][::std::mem::align_of::<iodbctpr>() - 8usize];
    ["Offset of field: iodbctpr::data"][::std::mem::offset_of!(iodbctpr, data) - 0usize];
    ["Offset of field: iodbctpr::prm"][::std::mem::offset_of!(iodbctpr, prm) - 1616usize];
};
pub type IODBCTPR = iodbctpr;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbctprm {
    pub data: iodbctprm__bindgen_ty_1,
    pub prm: [iodbctprm__bindgen_ty_2; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbctprm__bindgen_ty_1 {
    pub data_160: iodbctprm__bindgen_ty_1__bindgen_ty_1,
    pub data_30i: iodbctprm__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbctprm__bindgen_ty_1__bindgen_ty_1 {
    pub acc_bipl: [::std::os::raw::c_long; 8usize],
    pub acc_chg_time: ::std::os::raw::c_long,
    pub jerk_acc_diff: [::std::os::raw::c_long; 8usize],
    pub jerk_acc_diff_lin: [::std::os::raw::c_long; 8usize],
    pub jerk_acc_ratio: ::std::os::raw::c_char,
    pub max_acc: [::std::os::raw::c_long; 8usize],
    pub t_con_aipl: [::std::os::raw::c_short; 8usize],
    pub corner_feed_diff: [::std::os::raw::c_long; 8usize],
    pub max_cut_fdrate: [::std::os::raw::c_long; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbctprm__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<iodbctprm__bindgen_ty_1__bindgen_ty_1>() - 416usize];
    ["Alignment of iodbctprm__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<iodbctprm__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_1::acc_bipl"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_1, acc_bipl) - 0usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_1::acc_chg_time"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_1, acc_chg_time) - 64usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_1::jerk_acc_diff"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_1, jerk_acc_diff) - 72usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_1::jerk_acc_diff_lin"][::std::mem::offset_of!(
        iodbctprm__bindgen_ty_1__bindgen_ty_1,
        jerk_acc_diff_lin
    ) - 136usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_1::jerk_acc_ratio"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_1, jerk_acc_ratio) - 200usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_1::max_acc"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_1, max_acc) - 208usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_1::t_con_aipl"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_1, t_con_aipl) - 272usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_1::corner_feed_diff"][::std::mem::offset_of!(
        iodbctprm__bindgen_ty_1__bindgen_ty_1,
        corner_feed_diff
    ) - 288usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_1::max_cut_fdrate"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_1, max_cut_fdrate) - 352usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbctprm__bindgen_ty_1__bindgen_ty_2 {
    pub acc_bipl: [REALPRM; 32usize],
    pub acc_chg_time: REALPRM,
    pub jerk_acc_diff: [REALPRM; 32usize],
    pub jerk_acc_diff_lin: [REALPRM; 32usize],
    pub jerk_acc_ratio: ::std::os::raw::c_char,
    pub max_acc: [REALPRM; 32usize],
    pub t_con_aipl: [::std::os::raw::c_short; 32usize],
    pub corner_feed_diff: [REALPRM; 32usize],
    pub max_cut_fdrate: [REALPRM; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbctprm__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<iodbctprm__bindgen_ty_1__bindgen_ty_2>() - 3160usize];
    ["Alignment of iodbctprm__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<iodbctprm__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_2::acc_bipl"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_2, acc_bipl) - 0usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_2::acc_chg_time"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_2, acc_chg_time) - 512usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_2::jerk_acc_diff"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_2, jerk_acc_diff) - 528usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_2::jerk_acc_diff_lin"][::std::mem::offset_of!(
        iodbctprm__bindgen_ty_1__bindgen_ty_2,
        jerk_acc_diff_lin
    ) - 1040usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_2::jerk_acc_ratio"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_2, jerk_acc_ratio) - 1552usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_2::max_acc"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_2, max_acc) - 1560usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_2::t_con_aipl"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_2, t_con_aipl) - 2072usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_2::corner_feed_diff"][::std::mem::offset_of!(
        iodbctprm__bindgen_ty_1__bindgen_ty_2,
        corner_feed_diff
    ) - 2136usize];
    ["Offset of field: iodbctprm__bindgen_ty_1__bindgen_ty_2::max_cut_fdrate"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1__bindgen_ty_2, max_cut_fdrate) - 2648usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbctprm__bindgen_ty_1"]
        [::std::mem::size_of::<iodbctprm__bindgen_ty_1>() - 3160usize];
    ["Alignment of iodbctprm__bindgen_ty_1"]
        [::std::mem::align_of::<iodbctprm__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbctprm__bindgen_ty_1::data_160"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1, data_160) - 0usize];
    ["Offset of field: iodbctprm__bindgen_ty_1::data_30i"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_1, data_30i) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbctprm__bindgen_ty_2 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub u: iodbctprm__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbctprm__bindgen_ty_2__bindgen_ty_1 {
    pub cdata: ::std::os::raw::c_char,
    pub idata: ::std::os::raw::c_short,
    pub ldata: ::std::os::raw::c_long,
    pub rdata: REALPRM,
    pub cdatas: [::std::os::raw::c_char; 32usize],
    pub idatas: [::std::os::raw::c_short; 32usize],
    pub ldatas: [::std::os::raw::c_long; 32usize],
    pub rdatas: [REALPRM; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbctprm__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<iodbctprm__bindgen_ty_2__bindgen_ty_1>() - 512usize];
    ["Alignment of iodbctprm__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::align_of::<iodbctprm__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbctprm__bindgen_ty_2__bindgen_ty_1::cdata"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_2__bindgen_ty_1, cdata) - 0usize];
    ["Offset of field: iodbctprm__bindgen_ty_2__bindgen_ty_1::idata"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_2__bindgen_ty_1, idata) - 0usize];
    ["Offset of field: iodbctprm__bindgen_ty_2__bindgen_ty_1::ldata"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_2__bindgen_ty_1, ldata) - 0usize];
    ["Offset of field: iodbctprm__bindgen_ty_2__bindgen_ty_1::rdata"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_2__bindgen_ty_1, rdata) - 0usize];
    ["Offset of field: iodbctprm__bindgen_ty_2__bindgen_ty_1::cdatas"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_2__bindgen_ty_1, cdatas) - 0usize];
    ["Offset of field: iodbctprm__bindgen_ty_2__bindgen_ty_1::idatas"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_2__bindgen_ty_1, idatas) - 0usize];
    ["Offset of field: iodbctprm__bindgen_ty_2__bindgen_ty_1::ldatas"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_2__bindgen_ty_1, ldatas) - 0usize];
    ["Offset of field: iodbctprm__bindgen_ty_2__bindgen_ty_1::rdatas"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_2__bindgen_ty_1, rdatas) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbctprm__bindgen_ty_2"]
        [::std::mem::size_of::<iodbctprm__bindgen_ty_2>() - 520usize];
    ["Alignment of iodbctprm__bindgen_ty_2"]
        [::std::mem::align_of::<iodbctprm__bindgen_ty_2>() - 8usize];
    ["Offset of field: iodbctprm__bindgen_ty_2::datano"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_2, datano) - 0usize];
    ["Offset of field: iodbctprm__bindgen_ty_2::type_"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_2, type_) - 2usize];
    ["Offset of field: iodbctprm__bindgen_ty_2::u"]
        [::std::mem::offset_of!(iodbctprm__bindgen_ty_2, u) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbctprm"][::std::mem::size_of::<iodbctprm>() - 4200usize];
    ["Alignment of iodbctprm"][::std::mem::align_of::<iodbctprm>() - 8usize];
    ["Offset of field: iodbctprm::data"][::std::mem::offset_of!(iodbctprm, data) - 0usize];
    ["Offset of field: iodbctprm::prm"][::std::mem::offset_of!(iodbctprm, prm) - 3160usize];
};
pub type IODBCTPRM = iodbctprm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IODBTLGS {
    pub data1: ::std::os::raw::c_long,
    pub data2: ::std::os::raw::c_long,
    pub tooltype: ::std::os::raw::c_char,
    pub install: ::std::os::raw::c_char,
    pub toolname: [::std::os::raw::c_char; 9usize],
    pub dummy: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IODBTLGS"][::std::mem::size_of::<IODBTLGS>() - 32usize];
    ["Alignment of IODBTLGS"][::std::mem::align_of::<IODBTLGS>() - 8usize];
    ["Offset of field: IODBTLGS::data1"][::std::mem::offset_of!(IODBTLGS, data1) - 0usize];
    ["Offset of field: IODBTLGS::data2"][::std::mem::offset_of!(IODBTLGS, data2) - 8usize];
    ["Offset of field: IODBTLGS::tooltype"][::std::mem::offset_of!(IODBTLGS, tooltype) - 16usize];
    ["Offset of field: IODBTLGS::install"][::std::mem::offset_of!(IODBTLGS, install) - 17usize];
    ["Offset of field: IODBTLGS::toolname"][::std::mem::offset_of!(IODBTLGS, toolname) - 18usize];
    ["Offset of field: IODBTLGS::dummy"][::std::mem::offset_of!(IODBTLGS, dummy) - 27usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlgsext {
    pub data1: ::std::os::raw::c_long,
    pub data2: ::std::os::raw::c_long,
    pub data3: ::std::os::raw::c_long,
    pub data4: ::std::os::raw::c_long,
    pub tooltype: ::std::os::raw::c_char,
    pub install: ::std::os::raw::c_char,
    pub holder: ::std::os::raw::c_char,
    pub toolname: [::std::os::raw::c_char; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlgsext"][::std::mem::size_of::<iodbtlgsext>() - 48usize];
    ["Alignment of iodbtlgsext"][::std::mem::align_of::<iodbtlgsext>() - 8usize];
    ["Offset of field: iodbtlgsext::data1"][::std::mem::offset_of!(iodbtlgsext, data1) - 0usize];
    ["Offset of field: iodbtlgsext::data2"][::std::mem::offset_of!(iodbtlgsext, data2) - 8usize];
    ["Offset of field: iodbtlgsext::data3"][::std::mem::offset_of!(iodbtlgsext, data3) - 16usize];
    ["Offset of field: iodbtlgsext::data4"][::std::mem::offset_of!(iodbtlgsext, data4) - 24usize];
    ["Offset of field: iodbtlgsext::tooltype"]
        [::std::mem::offset_of!(iodbtlgsext, tooltype) - 32usize];
    ["Offset of field: iodbtlgsext::install"]
        [::std::mem::offset_of!(iodbtlgsext, install) - 33usize];
    ["Offset of field: iodbtlgsext::holder"][::std::mem::offset_of!(iodbtlgsext, holder) - 34usize];
    ["Offset of field: iodbtlgsext::toolname"]
        [::std::mem::offset_of!(iodbtlgsext, toolname) - 35usize];
};
pub type IODBTLGSEXT = iodbtlgsext;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlgsext2 {
    pub data1: ::std::os::raw::c_long,
    pub data2: ::std::os::raw::c_long,
    pub data3: ::std::os::raw::c_long,
    pub data4: ::std::os::raw::c_long,
    pub data5: ::std::os::raw::c_long,
    pub data6: ::std::os::raw::c_long,
    pub data7: ::std::os::raw::c_long,
    pub data8: ::std::os::raw::c_long,
    pub data9: ::std::os::raw::c_long,
    pub data10: ::std::os::raw::c_long,
    pub tooltype: ::std::os::raw::c_char,
    pub install: ::std::os::raw::c_char,
    pub holder: ::std::os::raw::c_char,
    pub toolname: [::std::os::raw::c_char; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlgsext2"][::std::mem::size_of::<iodbtlgsext2>() - 96usize];
    ["Alignment of iodbtlgsext2"][::std::mem::align_of::<iodbtlgsext2>() - 8usize];
    ["Offset of field: iodbtlgsext2::data1"][::std::mem::offset_of!(iodbtlgsext2, data1) - 0usize];
    ["Offset of field: iodbtlgsext2::data2"][::std::mem::offset_of!(iodbtlgsext2, data2) - 8usize];
    ["Offset of field: iodbtlgsext2::data3"][::std::mem::offset_of!(iodbtlgsext2, data3) - 16usize];
    ["Offset of field: iodbtlgsext2::data4"][::std::mem::offset_of!(iodbtlgsext2, data4) - 24usize];
    ["Offset of field: iodbtlgsext2::data5"][::std::mem::offset_of!(iodbtlgsext2, data5) - 32usize];
    ["Offset of field: iodbtlgsext2::data6"][::std::mem::offset_of!(iodbtlgsext2, data6) - 40usize];
    ["Offset of field: iodbtlgsext2::data7"][::std::mem::offset_of!(iodbtlgsext2, data7) - 48usize];
    ["Offset of field: iodbtlgsext2::data8"][::std::mem::offset_of!(iodbtlgsext2, data8) - 56usize];
    ["Offset of field: iodbtlgsext2::data9"][::std::mem::offset_of!(iodbtlgsext2, data9) - 64usize];
    ["Offset of field: iodbtlgsext2::data10"]
        [::std::mem::offset_of!(iodbtlgsext2, data10) - 72usize];
    ["Offset of field: iodbtlgsext2::tooltype"]
        [::std::mem::offset_of!(iodbtlgsext2, tooltype) - 80usize];
    ["Offset of field: iodbtlgsext2::install"]
        [::std::mem::offset_of!(iodbtlgsext2, install) - 81usize];
    ["Offset of field: iodbtlgsext2::holder"]
        [::std::mem::offset_of!(iodbtlgsext2, holder) - 82usize];
    ["Offset of field: iodbtlgsext2::toolname"]
        [::std::mem::offset_of!(iodbtlgsext2, toolname) - 83usize];
};
pub type IODBTLGSEXT2 = iodbtlgsext2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtlife1 {
    pub dummy: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtlife1"][::std::mem::size_of::<odbtlife1>() - 16usize];
    ["Alignment of odbtlife1"][::std::mem::align_of::<odbtlife1>() - 8usize];
    ["Offset of field: odbtlife1::dummy"][::std::mem::offset_of!(odbtlife1, dummy) - 0usize];
    ["Offset of field: odbtlife1::type_"][::std::mem::offset_of!(odbtlife1, type_) - 2usize];
    ["Offset of field: odbtlife1::data"][::std::mem::offset_of!(odbtlife1, data) - 8usize];
};
pub type ODBTLIFE1 = odbtlife1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtlife2 {
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtlife2"][::std::mem::size_of::<odbtlife2>() - 16usize];
    ["Alignment of odbtlife2"][::std::mem::align_of::<odbtlife2>() - 8usize];
    ["Offset of field: odbtlife2::dummy"][::std::mem::offset_of!(odbtlife2, dummy) - 0usize];
    ["Offset of field: odbtlife2::data"][::std::mem::offset_of!(odbtlife2, data) - 8usize];
};
pub type ODBTLIFE2 = odbtlife2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtlife3 {
    pub datano: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub data: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtlife3"][::std::mem::size_of::<odbtlife3>() - 16usize];
    ["Alignment of odbtlife3"][::std::mem::align_of::<odbtlife3>() - 8usize];
    ["Offset of field: odbtlife3::datano"][::std::mem::offset_of!(odbtlife3, datano) - 0usize];
    ["Offset of field: odbtlife3::dummy"][::std::mem::offset_of!(odbtlife3, dummy) - 2usize];
    ["Offset of field: odbtlife3::data"][::std::mem::offset_of!(odbtlife3, data) - 8usize];
};
pub type ODBTLIFE3 = odbtlife3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtlife4 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtlife4"][::std::mem::size_of::<odbtlife4>() - 16usize];
    ["Alignment of odbtlife4"][::std::mem::align_of::<odbtlife4>() - 8usize];
    ["Offset of field: odbtlife4::datano"][::std::mem::offset_of!(odbtlife4, datano) - 0usize];
    ["Offset of field: odbtlife4::type_"][::std::mem::offset_of!(odbtlife4, type_) - 2usize];
    ["Offset of field: odbtlife4::data"][::std::mem::offset_of!(odbtlife4, data) - 8usize];
};
pub type ODBTLIFE4 = odbtlife4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtlife5 {
    pub dummy: ::std::os::raw::c_long,
    pub type_: ::std::os::raw::c_long,
    pub data: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtlife5"][::std::mem::size_of::<odbtlife5>() - 24usize];
    ["Alignment of odbtlife5"][::std::mem::align_of::<odbtlife5>() - 8usize];
    ["Offset of field: odbtlife5::dummy"][::std::mem::offset_of!(odbtlife5, dummy) - 0usize];
    ["Offset of field: odbtlife5::type_"][::std::mem::offset_of!(odbtlife5, type_) - 8usize];
    ["Offset of field: odbtlife5::data"][::std::mem::offset_of!(odbtlife5, data) - 16usize];
};
pub type ODBTLIFE5 = odbtlife5;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtr {
    pub datano_s: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub data: [iodbtr__bindgen_ty_1; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtr__bindgen_ty_1 {
    pub ntool: ::std::os::raw::c_long,
    pub life: ::std::os::raw::c_long,
    pub count: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtr__bindgen_ty_1"][::std::mem::size_of::<iodbtr__bindgen_ty_1>() - 24usize];
    ["Alignment of iodbtr__bindgen_ty_1"][::std::mem::align_of::<iodbtr__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbtr__bindgen_ty_1::ntool"]
        [::std::mem::offset_of!(iodbtr__bindgen_ty_1, ntool) - 0usize];
    ["Offset of field: iodbtr__bindgen_ty_1::life"]
        [::std::mem::offset_of!(iodbtr__bindgen_ty_1, life) - 8usize];
    ["Offset of field: iodbtr__bindgen_ty_1::count"]
        [::std::mem::offset_of!(iodbtr__bindgen_ty_1, count) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtr"][::std::mem::size_of::<iodbtr>() - 128usize];
    ["Alignment of iodbtr"][::std::mem::align_of::<iodbtr>() - 8usize];
    ["Offset of field: iodbtr::datano_s"][::std::mem::offset_of!(iodbtr, datano_s) - 0usize];
    ["Offset of field: iodbtr::dummy"][::std::mem::offset_of!(iodbtr, dummy) - 2usize];
    ["Offset of field: iodbtr::datano_e"][::std::mem::offset_of!(iodbtr, datano_e) - 4usize];
    ["Offset of field: iodbtr::data"][::std::mem::offset_of!(iodbtr, data) - 8usize];
};
pub type IODBTR = iodbtr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtg {
    pub grp_num: ::std::os::raw::c_short,
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub ntool: ::std::os::raw::c_long,
    pub life: ::std::os::raw::c_long,
    pub count: ::std::os::raw::c_long,
    pub data: [odbtg__bindgen_ty_1; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtg__bindgen_ty_1 {
    pub tuse_num: ::std::os::raw::c_long,
    pub tool_num: ::std::os::raw::c_long,
    pub length_num: ::std::os::raw::c_long,
    pub radius_num: ::std::os::raw::c_long,
    pub tinfo: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtg__bindgen_ty_1"][::std::mem::size_of::<odbtg__bindgen_ty_1>() - 40usize];
    ["Alignment of odbtg__bindgen_ty_1"][::std::mem::align_of::<odbtg__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbtg__bindgen_ty_1::tuse_num"]
        [::std::mem::offset_of!(odbtg__bindgen_ty_1, tuse_num) - 0usize];
    ["Offset of field: odbtg__bindgen_ty_1::tool_num"]
        [::std::mem::offset_of!(odbtg__bindgen_ty_1, tool_num) - 8usize];
    ["Offset of field: odbtg__bindgen_ty_1::length_num"]
        [::std::mem::offset_of!(odbtg__bindgen_ty_1, length_num) - 16usize];
    ["Offset of field: odbtg__bindgen_ty_1::radius_num"]
        [::std::mem::offset_of!(odbtg__bindgen_ty_1, radius_num) - 24usize];
    ["Offset of field: odbtg__bindgen_ty_1::tinfo"]
        [::std::mem::offset_of!(odbtg__bindgen_ty_1, tinfo) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtg"][::std::mem::size_of::<odbtg>() - 232usize];
    ["Alignment of odbtg"][::std::mem::align_of::<odbtg>() - 8usize];
    ["Offset of field: odbtg::grp_num"][::std::mem::offset_of!(odbtg, grp_num) - 0usize];
    ["Offset of field: odbtg::dummy"][::std::mem::offset_of!(odbtg, dummy) - 2usize];
    ["Offset of field: odbtg::ntool"][::std::mem::offset_of!(odbtg, ntool) - 8usize];
    ["Offset of field: odbtg::life"][::std::mem::offset_of!(odbtg, life) - 16usize];
    ["Offset of field: odbtg::count"][::std::mem::offset_of!(odbtg, count) - 24usize];
    ["Offset of field: odbtg::data"][::std::mem::offset_of!(odbtg, data) - 32usize];
};
pub type ODBTG = odbtg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbwrc {
    pub datano_s: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub data: [idbwrc__bindgen_ty_1; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbwrc__bindgen_ty_1 {
    pub dummy: [::std::os::raw::c_long; 2usize],
    pub count: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbwrc__bindgen_ty_1"][::std::mem::size_of::<idbwrc__bindgen_ty_1>() - 24usize];
    ["Alignment of idbwrc__bindgen_ty_1"][::std::mem::align_of::<idbwrc__bindgen_ty_1>() - 8usize];
    ["Offset of field: idbwrc__bindgen_ty_1::dummy"]
        [::std::mem::offset_of!(idbwrc__bindgen_ty_1, dummy) - 0usize];
    ["Offset of field: idbwrc__bindgen_ty_1::count"]
        [::std::mem::offset_of!(idbwrc__bindgen_ty_1, count) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbwrc"][::std::mem::size_of::<idbwrc>() - 128usize];
    ["Alignment of idbwrc"][::std::mem::align_of::<idbwrc>() - 8usize];
    ["Offset of field: idbwrc::datano_s"][::std::mem::offset_of!(idbwrc, datano_s) - 0usize];
    ["Offset of field: idbwrc::dummy"][::std::mem::offset_of!(idbwrc, dummy) - 2usize];
    ["Offset of field: idbwrc::datano_e"][::std::mem::offset_of!(idbwrc, datano_e) - 4usize];
    ["Offset of field: idbwrc::data"][::std::mem::offset_of!(idbwrc, data) - 8usize];
};
pub type IDBWRC = idbwrc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbusegr {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub next: ::std::os::raw::c_long,
    pub use_: ::std::os::raw::c_long,
    pub slct: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbusegr"][::std::mem::size_of::<odbusegr>() - 32usize];
    ["Alignment of odbusegr"][::std::mem::align_of::<odbusegr>() - 8usize];
    ["Offset of field: odbusegr::datano"][::std::mem::offset_of!(odbusegr, datano) - 0usize];
    ["Offset of field: odbusegr::type_"][::std::mem::offset_of!(odbusegr, type_) - 2usize];
    ["Offset of field: odbusegr::next"][::std::mem::offset_of!(odbusegr, next) - 8usize];
    ["Offset of field: odbusegr::use_"][::std::mem::offset_of!(odbusegr, use_) - 16usize];
    ["Offset of field: odbusegr::slct"][::std::mem::offset_of!(odbusegr, slct) - 24usize];
};
pub type ODBUSEGR = odbusegr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odblfno {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odblfno"][::std::mem::size_of::<odblfno>() - 6usize];
    ["Alignment of odblfno"][::std::mem::align_of::<odblfno>() - 2usize];
    ["Offset of field: odblfno::datano"][::std::mem::offset_of!(odblfno, datano) - 0usize];
    ["Offset of field: odblfno::type_"][::std::mem::offset_of!(odblfno, type_) - 2usize];
    ["Offset of field: odblfno::data"][::std::mem::offset_of!(odblfno, data) - 4usize];
};
pub type ODBLFNO = odblfno;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtluse {
    pub s_grp: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub e_grp: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtluse"][::std::mem::size_of::<odbtluse>() - 48usize];
    ["Alignment of odbtluse"][::std::mem::align_of::<odbtluse>() - 8usize];
    ["Offset of field: odbtluse::s_grp"][::std::mem::offset_of!(odbtluse, s_grp) - 0usize];
    ["Offset of field: odbtluse::dummy"][::std::mem::offset_of!(odbtluse, dummy) - 2usize];
    ["Offset of field: odbtluse::e_grp"][::std::mem::offset_of!(odbtluse, e_grp) - 4usize];
    ["Offset of field: odbtluse::data"][::std::mem::offset_of!(odbtluse, data) - 8usize];
};
pub type ODBTLUSE = odbtluse;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtd {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub tool_num: ::std::os::raw::c_long,
    pub h_code: ::std::os::raw::c_long,
    pub d_code: ::std::os::raw::c_long,
    pub tool_inf: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtd"][::std::mem::size_of::<iodbtd>() - 40usize];
    ["Alignment of iodbtd"][::std::mem::align_of::<iodbtd>() - 8usize];
    ["Offset of field: iodbtd::datano"][::std::mem::offset_of!(iodbtd, datano) - 0usize];
    ["Offset of field: iodbtd::type_"][::std::mem::offset_of!(iodbtd, type_) - 2usize];
    ["Offset of field: iodbtd::tool_num"][::std::mem::offset_of!(iodbtd, tool_num) - 8usize];
    ["Offset of field: iodbtd::h_code"][::std::mem::offset_of!(iodbtd, h_code) - 16usize];
    ["Offset of field: iodbtd::d_code"][::std::mem::offset_of!(iodbtd, d_code) - 24usize];
    ["Offset of field: iodbtd::tool_inf"][::std::mem::offset_of!(iodbtd, tool_inf) - 32usize];
};
pub type IODBTD = iodbtd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtd2 {
    pub datano: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_long,
    pub tool_num: ::std::os::raw::c_long,
    pub h_code: ::std::os::raw::c_long,
    pub d_code: ::std::os::raw::c_long,
    pub tool_inf: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtd2"][::std::mem::size_of::<iodbtd2>() - 48usize];
    ["Alignment of iodbtd2"][::std::mem::align_of::<iodbtd2>() - 8usize];
    ["Offset of field: iodbtd2::datano"][::std::mem::offset_of!(iodbtd2, datano) - 0usize];
    ["Offset of field: iodbtd2::dummy"][::std::mem::offset_of!(iodbtd2, dummy) - 2usize];
    ["Offset of field: iodbtd2::type_"][::std::mem::offset_of!(iodbtd2, type_) - 8usize];
    ["Offset of field: iodbtd2::tool_num"][::std::mem::offset_of!(iodbtd2, tool_num) - 16usize];
    ["Offset of field: iodbtd2::h_code"][::std::mem::offset_of!(iodbtd2, h_code) - 24usize];
    ["Offset of field: iodbtd2::d_code"][::std::mem::offset_of!(iodbtd2, d_code) - 32usize];
    ["Offset of field: iodbtd2::tool_inf"][::std::mem::offset_of!(iodbtd2, tool_inf) - 40usize];
};
pub type IODBTD2 = iodbtd2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtgi {
    pub s_grp: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub e_grp: ::std::os::raw::c_short,
    pub data: [iodbtgi__bindgen_ty_1; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtgi__bindgen_ty_1 {
    pub n_tool: ::std::os::raw::c_long,
    pub count_value: ::std::os::raw::c_long,
    pub counter: ::std::os::raw::c_long,
    pub count_type: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtgi__bindgen_ty_1"][::std::mem::size_of::<iodbtgi__bindgen_ty_1>() - 32usize];
    ["Alignment of iodbtgi__bindgen_ty_1"]
        [::std::mem::align_of::<iodbtgi__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbtgi__bindgen_ty_1::n_tool"]
        [::std::mem::offset_of!(iodbtgi__bindgen_ty_1, n_tool) - 0usize];
    ["Offset of field: iodbtgi__bindgen_ty_1::count_value"]
        [::std::mem::offset_of!(iodbtgi__bindgen_ty_1, count_value) - 8usize];
    ["Offset of field: iodbtgi__bindgen_ty_1::counter"]
        [::std::mem::offset_of!(iodbtgi__bindgen_ty_1, counter) - 16usize];
    ["Offset of field: iodbtgi__bindgen_ty_1::count_type"]
        [::std::mem::offset_of!(iodbtgi__bindgen_ty_1, count_type) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtgi"][::std::mem::size_of::<iodbtgi>() - 168usize];
    ["Alignment of iodbtgi"][::std::mem::align_of::<iodbtgi>() - 8usize];
    ["Offset of field: iodbtgi::s_grp"][::std::mem::offset_of!(iodbtgi, s_grp) - 0usize];
    ["Offset of field: iodbtgi::dummy"][::std::mem::offset_of!(iodbtgi, dummy) - 2usize];
    ["Offset of field: iodbtgi::e_grp"][::std::mem::offset_of!(iodbtgi, e_grp) - 4usize];
    ["Offset of field: iodbtgi::data"][::std::mem::offset_of!(iodbtgi, data) - 8usize];
};
pub type IODBTGI = iodbtgi;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtgi2 {
    pub s_grp: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub e_grp: ::std::os::raw::c_short,
    pub opt_grpno: [::std::os::raw::c_long; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtgi2"][::std::mem::size_of::<iodbtgi2>() - 48usize];
    ["Alignment of iodbtgi2"][::std::mem::align_of::<iodbtgi2>() - 8usize];
    ["Offset of field: iodbtgi2::s_grp"][::std::mem::offset_of!(iodbtgi2, s_grp) - 0usize];
    ["Offset of field: iodbtgi2::dummy"][::std::mem::offset_of!(iodbtgi2, dummy) - 2usize];
    ["Offset of field: iodbtgi2::e_grp"][::std::mem::offset_of!(iodbtgi2, e_grp) - 4usize];
    ["Offset of field: iodbtgi2::opt_grpno"][::std::mem::offset_of!(iodbtgi2, opt_grpno) - 8usize];
};
pub type IODBTGI2 = iodbtgi2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtgi3 {
    pub s_grp: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub e_grp: ::std::os::raw::c_short,
    pub life_rest: [::std::os::raw::c_long; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtgi3"][::std::mem::size_of::<iodbtgi3>() - 48usize];
    ["Alignment of iodbtgi3"][::std::mem::align_of::<iodbtgi3>() - 8usize];
    ["Offset of field: iodbtgi3::s_grp"][::std::mem::offset_of!(iodbtgi3, s_grp) - 0usize];
    ["Offset of field: iodbtgi3::dummy"][::std::mem::offset_of!(iodbtgi3, dummy) - 2usize];
    ["Offset of field: iodbtgi3::e_grp"][::std::mem::offset_of!(iodbtgi3, e_grp) - 4usize];
    ["Offset of field: iodbtgi3::life_rest"][::std::mem::offset_of!(iodbtgi3, life_rest) - 8usize];
};
pub type IODBTGI3 = iodbtgi3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtgi4 {
    pub grp_no: ::std::os::raw::c_short,
    pub n_tool: ::std::os::raw::c_long,
    pub count_value: ::std::os::raw::c_long,
    pub counter: ::std::os::raw::c_long,
    pub count_type: ::std::os::raw::c_long,
    pub opt_grpno: ::std::os::raw::c_long,
    pub life_rest: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtgi4"][::std::mem::size_of::<iodbtgi4>() - 56usize];
    ["Alignment of iodbtgi4"][::std::mem::align_of::<iodbtgi4>() - 8usize];
    ["Offset of field: iodbtgi4::grp_no"][::std::mem::offset_of!(iodbtgi4, grp_no) - 0usize];
    ["Offset of field: iodbtgi4::n_tool"][::std::mem::offset_of!(iodbtgi4, n_tool) - 8usize];
    ["Offset of field: iodbtgi4::count_value"]
        [::std::mem::offset_of!(iodbtgi4, count_value) - 16usize];
    ["Offset of field: iodbtgi4::counter"][::std::mem::offset_of!(iodbtgi4, counter) - 24usize];
    ["Offset of field: iodbtgi4::count_type"]
        [::std::mem::offset_of!(iodbtgi4, count_type) - 32usize];
    ["Offset of field: iodbtgi4::opt_grpno"][::std::mem::offset_of!(iodbtgi4, opt_grpno) - 40usize];
    ["Offset of field: iodbtgi4::life_rest"][::std::mem::offset_of!(iodbtgi4, life_rest) - 48usize];
};
pub type IODBTGI4 = iodbtgi4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbitd {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbitd"][::std::mem::size_of::<idbitd>() - 16usize];
    ["Alignment of idbitd"][::std::mem::align_of::<idbitd>() - 8usize];
    ["Offset of field: idbitd::datano"][::std::mem::offset_of!(idbitd, datano) - 0usize];
    ["Offset of field: idbitd::type_"][::std::mem::offset_of!(idbitd, type_) - 2usize];
    ["Offset of field: idbitd::data"][::std::mem::offset_of!(idbitd, data) - 8usize];
};
pub type IDBITD = idbitd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbitd2 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_long,
    pub data: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbitd2"][::std::mem::size_of::<idbitd2>() - 24usize];
    ["Alignment of idbitd2"][::std::mem::align_of::<idbitd2>() - 8usize];
    ["Offset of field: idbitd2::datano"][::std::mem::offset_of!(idbitd2, datano) - 0usize];
    ["Offset of field: idbitd2::type_"][::std::mem::offset_of!(idbitd2, type_) - 8usize];
    ["Offset of field: idbitd2::data"][::std::mem::offset_of!(idbitd2, data) - 16usize];
};
pub type IDBITD2 = idbitd2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtlinfo {
    pub max_group: ::std::os::raw::c_long,
    pub max_tool: ::std::os::raw::c_long,
    pub max_minute: ::std::os::raw::c_long,
    pub max_cycle: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtlinfo"][::std::mem::size_of::<odbtlinfo>() - 32usize];
    ["Alignment of odbtlinfo"][::std::mem::align_of::<odbtlinfo>() - 8usize];
    ["Offset of field: odbtlinfo::max_group"]
        [::std::mem::offset_of!(odbtlinfo, max_group) - 0usize];
    ["Offset of field: odbtlinfo::max_tool"][::std::mem::offset_of!(odbtlinfo, max_tool) - 8usize];
    ["Offset of field: odbtlinfo::max_minute"]
        [::std::mem::offset_of!(odbtlinfo, max_minute) - 16usize];
    ["Offset of field: odbtlinfo::max_cycle"]
        [::std::mem::offset_of!(odbtlinfo, max_cycle) - 24usize];
};
pub type ODBTLINFO = odbtlinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbusegrp {
    pub next: ::std::os::raw::c_long,
    pub use_: ::std::os::raw::c_long,
    pub slct: ::std::os::raw::c_long,
    pub opt_next: ::std::os::raw::c_long,
    pub opt_use: ::std::os::raw::c_long,
    pub opt_slct: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbusegrp"][::std::mem::size_of::<odbusegrp>() - 48usize];
    ["Alignment of odbusegrp"][::std::mem::align_of::<odbusegrp>() - 8usize];
    ["Offset of field: odbusegrp::next"][::std::mem::offset_of!(odbusegrp, next) - 0usize];
    ["Offset of field: odbusegrp::use_"][::std::mem::offset_of!(odbusegrp, use_) - 8usize];
    ["Offset of field: odbusegrp::slct"][::std::mem::offset_of!(odbusegrp, slct) - 16usize];
    ["Offset of field: odbusegrp::opt_next"][::std::mem::offset_of!(odbusegrp, opt_next) - 24usize];
    ["Offset of field: odbusegrp::opt_use"][::std::mem::offset_of!(odbusegrp, opt_use) - 32usize];
    ["Offset of field: odbusegrp::opt_slct"][::std::mem::offset_of!(odbusegrp, opt_slct) - 40usize];
};
pub type ODBUSEGRP = odbusegrp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlgrp {
    pub ntool: ::std::os::raw::c_long,
    pub nfree: ::std::os::raw::c_long,
    pub life: ::std::os::raw::c_long,
    pub count: ::std::os::raw::c_long,
    pub use_tool: ::std::os::raw::c_long,
    pub opt_grpno: ::std::os::raw::c_long,
    pub life_rest: ::std::os::raw::c_long,
    pub rest_sig: ::std::os::raw::c_short,
    pub count_type: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlgrp"][::std::mem::size_of::<iodbtlgrp>() - 64usize];
    ["Alignment of iodbtlgrp"][::std::mem::align_of::<iodbtlgrp>() - 8usize];
    ["Offset of field: iodbtlgrp::ntool"][::std::mem::offset_of!(iodbtlgrp, ntool) - 0usize];
    ["Offset of field: iodbtlgrp::nfree"][::std::mem::offset_of!(iodbtlgrp, nfree) - 8usize];
    ["Offset of field: iodbtlgrp::life"][::std::mem::offset_of!(iodbtlgrp, life) - 16usize];
    ["Offset of field: iodbtlgrp::count"][::std::mem::offset_of!(iodbtlgrp, count) - 24usize];
    ["Offset of field: iodbtlgrp::use_tool"][::std::mem::offset_of!(iodbtlgrp, use_tool) - 32usize];
    ["Offset of field: iodbtlgrp::opt_grpno"]
        [::std::mem::offset_of!(iodbtlgrp, opt_grpno) - 40usize];
    ["Offset of field: iodbtlgrp::life_rest"]
        [::std::mem::offset_of!(iodbtlgrp, life_rest) - 48usize];
    ["Offset of field: iodbtlgrp::rest_sig"][::std::mem::offset_of!(iodbtlgrp, rest_sig) - 56usize];
    ["Offset of field: iodbtlgrp::count_type"]
        [::std::mem::offset_of!(iodbtlgrp, count_type) - 58usize];
};
pub type IODBTLGRP = iodbtlgrp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtltool {
    pub tool_num: ::std::os::raw::c_long,
    pub h_code: ::std::os::raw::c_long,
    pub d_code: ::std::os::raw::c_long,
    pub tool_inf: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtltool"][::std::mem::size_of::<iodbtltool>() - 32usize];
    ["Alignment of iodbtltool"][::std::mem::align_of::<iodbtltool>() - 8usize];
    ["Offset of field: iodbtltool::tool_num"]
        [::std::mem::offset_of!(iodbtltool, tool_num) - 0usize];
    ["Offset of field: iodbtltool::h_code"][::std::mem::offset_of!(iodbtltool, h_code) - 8usize];
    ["Offset of field: iodbtltool::d_code"][::std::mem::offset_of!(iodbtltool, d_code) - 16usize];
    ["Offset of field: iodbtltool::tool_inf"]
        [::std::mem::offset_of!(iodbtltool, tool_inf) - 24usize];
};
pub type IODBTLTOOL = iodbtltool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct exgrp {
    pub grp_no: ::std::os::raw::c_long,
    pub opt_grpno: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of exgrp"][::std::mem::size_of::<exgrp>() - 16usize];
    ["Alignment of exgrp"][::std::mem::align_of::<exgrp>() - 8usize];
    ["Offset of field: exgrp::grp_no"][::std::mem::offset_of!(exgrp, grp_no) - 0usize];
    ["Offset of field: exgrp::opt_grpno"][::std::mem::offset_of!(exgrp, opt_grpno) - 8usize];
};
pub type ODBEXGP = exgrp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlmng {
    pub T_code: ::std::os::raw::c_long,
    pub life_count: ::std::os::raw::c_long,
    pub max_life: ::std::os::raw::c_long,
    pub rest_life: ::std::os::raw::c_long,
    pub life_stat: ::std::os::raw::c_uchar,
    pub cust_bits: ::std::os::raw::c_uchar,
    pub tool_info: ::std::os::raw::c_ushort,
    pub H_code: ::std::os::raw::c_short,
    pub D_code: ::std::os::raw::c_short,
    pub spindle_speed: ::std::os::raw::c_long,
    pub feedrate: ::std::os::raw::c_long,
    pub magazine: ::std::os::raw::c_short,
    pub pot: ::std::os::raw::c_short,
    pub G_code: ::std::os::raw::c_short,
    pub W_code: ::std::os::raw::c_short,
    pub gno: ::std::os::raw::c_short,
    pub grp: ::std::os::raw::c_short,
    pub edge: ::std::os::raw::c_short,
    pub org_magazine: ::std::os::raw::c_short,
    pub org_pot: ::std::os::raw::c_short,
    pub edge_num: ::std::os::raw::c_uchar,
    pub reserve_c: ::std::os::raw::c_char,
    pub reserved: [::std::os::raw::c_long; 2usize],
    pub custom1: ::std::os::raw::c_long,
    pub custom2: ::std::os::raw::c_long,
    pub custom3: ::std::os::raw::c_long,
    pub custom4: ::std::os::raw::c_long,
    pub custom5: ::std::os::raw::c_long,
    pub custom6: ::std::os::raw::c_long,
    pub custom7: ::std::os::raw::c_long,
    pub custom8: ::std::os::raw::c_long,
    pub custom9: ::std::os::raw::c_long,
    pub custom10: ::std::os::raw::c_long,
    pub custom11: ::std::os::raw::c_long,
    pub custom12: ::std::os::raw::c_long,
    pub custom13: ::std::os::raw::c_long,
    pub custom14: ::std::os::raw::c_long,
    pub custom15: ::std::os::raw::c_long,
    pub custom16: ::std::os::raw::c_long,
    pub custom17: ::std::os::raw::c_long,
    pub custom18: ::std::os::raw::c_long,
    pub custom19: ::std::os::raw::c_long,
    pub custom20: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlmng"][::std::mem::size_of::<iodbtlmng>() - 256usize];
    ["Alignment of iodbtlmng"][::std::mem::align_of::<iodbtlmng>() - 8usize];
    ["Offset of field: iodbtlmng::T_code"][::std::mem::offset_of!(iodbtlmng, T_code) - 0usize];
    ["Offset of field: iodbtlmng::life_count"]
        [::std::mem::offset_of!(iodbtlmng, life_count) - 8usize];
    ["Offset of field: iodbtlmng::max_life"][::std::mem::offset_of!(iodbtlmng, max_life) - 16usize];
    ["Offset of field: iodbtlmng::rest_life"]
        [::std::mem::offset_of!(iodbtlmng, rest_life) - 24usize];
    ["Offset of field: iodbtlmng::life_stat"]
        [::std::mem::offset_of!(iodbtlmng, life_stat) - 32usize];
    ["Offset of field: iodbtlmng::cust_bits"]
        [::std::mem::offset_of!(iodbtlmng, cust_bits) - 33usize];
    ["Offset of field: iodbtlmng::tool_info"]
        [::std::mem::offset_of!(iodbtlmng, tool_info) - 34usize];
    ["Offset of field: iodbtlmng::H_code"][::std::mem::offset_of!(iodbtlmng, H_code) - 36usize];
    ["Offset of field: iodbtlmng::D_code"][::std::mem::offset_of!(iodbtlmng, D_code) - 38usize];
    ["Offset of field: iodbtlmng::spindle_speed"]
        [::std::mem::offset_of!(iodbtlmng, spindle_speed) - 40usize];
    ["Offset of field: iodbtlmng::feedrate"][::std::mem::offset_of!(iodbtlmng, feedrate) - 48usize];
    ["Offset of field: iodbtlmng::magazine"][::std::mem::offset_of!(iodbtlmng, magazine) - 56usize];
    ["Offset of field: iodbtlmng::pot"][::std::mem::offset_of!(iodbtlmng, pot) - 58usize];
    ["Offset of field: iodbtlmng::G_code"][::std::mem::offset_of!(iodbtlmng, G_code) - 60usize];
    ["Offset of field: iodbtlmng::W_code"][::std::mem::offset_of!(iodbtlmng, W_code) - 62usize];
    ["Offset of field: iodbtlmng::gno"][::std::mem::offset_of!(iodbtlmng, gno) - 64usize];
    ["Offset of field: iodbtlmng::grp"][::std::mem::offset_of!(iodbtlmng, grp) - 66usize];
    ["Offset of field: iodbtlmng::edge"][::std::mem::offset_of!(iodbtlmng, edge) - 68usize];
    ["Offset of field: iodbtlmng::org_magazine"]
        [::std::mem::offset_of!(iodbtlmng, org_magazine) - 70usize];
    ["Offset of field: iodbtlmng::org_pot"][::std::mem::offset_of!(iodbtlmng, org_pot) - 72usize];
    ["Offset of field: iodbtlmng::edge_num"][::std::mem::offset_of!(iodbtlmng, edge_num) - 74usize];
    ["Offset of field: iodbtlmng::reserve_c"]
        [::std::mem::offset_of!(iodbtlmng, reserve_c) - 75usize];
    ["Offset of field: iodbtlmng::reserved"][::std::mem::offset_of!(iodbtlmng, reserved) - 80usize];
    ["Offset of field: iodbtlmng::custom1"][::std::mem::offset_of!(iodbtlmng, custom1) - 96usize];
    ["Offset of field: iodbtlmng::custom2"][::std::mem::offset_of!(iodbtlmng, custom2) - 104usize];
    ["Offset of field: iodbtlmng::custom3"][::std::mem::offset_of!(iodbtlmng, custom3) - 112usize];
    ["Offset of field: iodbtlmng::custom4"][::std::mem::offset_of!(iodbtlmng, custom4) - 120usize];
    ["Offset of field: iodbtlmng::custom5"][::std::mem::offset_of!(iodbtlmng, custom5) - 128usize];
    ["Offset of field: iodbtlmng::custom6"][::std::mem::offset_of!(iodbtlmng, custom6) - 136usize];
    ["Offset of field: iodbtlmng::custom7"][::std::mem::offset_of!(iodbtlmng, custom7) - 144usize];
    ["Offset of field: iodbtlmng::custom8"][::std::mem::offset_of!(iodbtlmng, custom8) - 152usize];
    ["Offset of field: iodbtlmng::custom9"][::std::mem::offset_of!(iodbtlmng, custom9) - 160usize];
    ["Offset of field: iodbtlmng::custom10"]
        [::std::mem::offset_of!(iodbtlmng, custom10) - 168usize];
    ["Offset of field: iodbtlmng::custom11"]
        [::std::mem::offset_of!(iodbtlmng, custom11) - 176usize];
    ["Offset of field: iodbtlmng::custom12"]
        [::std::mem::offset_of!(iodbtlmng, custom12) - 184usize];
    ["Offset of field: iodbtlmng::custom13"]
        [::std::mem::offset_of!(iodbtlmng, custom13) - 192usize];
    ["Offset of field: iodbtlmng::custom14"]
        [::std::mem::offset_of!(iodbtlmng, custom14) - 200usize];
    ["Offset of field: iodbtlmng::custom15"]
        [::std::mem::offset_of!(iodbtlmng, custom15) - 208usize];
    ["Offset of field: iodbtlmng::custom16"]
        [::std::mem::offset_of!(iodbtlmng, custom16) - 216usize];
    ["Offset of field: iodbtlmng::custom17"]
        [::std::mem::offset_of!(iodbtlmng, custom17) - 224usize];
    ["Offset of field: iodbtlmng::custom18"]
        [::std::mem::offset_of!(iodbtlmng, custom18) - 232usize];
    ["Offset of field: iodbtlmng::custom19"]
        [::std::mem::offset_of!(iodbtlmng, custom19) - 240usize];
    ["Offset of field: iodbtlmng::custom20"]
        [::std::mem::offset_of!(iodbtlmng, custom20) - 248usize];
};
pub type IODBTLMNG = iodbtlmng;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlmng_f2 {
    pub T_code: ::std::os::raw::c_long,
    pub life_count: ::std::os::raw::c_long,
    pub max_life: ::std::os::raw::c_long,
    pub rest_life: ::std::os::raw::c_long,
    pub life_stat: ::std::os::raw::c_uchar,
    pub cust_bits: ::std::os::raw::c_uchar,
    pub tool_info: ::std::os::raw::c_ushort,
    pub H_code: ::std::os::raw::c_short,
    pub D_code: ::std::os::raw::c_short,
    pub spindle_speed: ::std::os::raw::c_long,
    pub feedrate: ::std::os::raw::c_long,
    pub magazine: ::std::os::raw::c_short,
    pub pot: ::std::os::raw::c_short,
    pub G_code: ::std::os::raw::c_short,
    pub W_code: ::std::os::raw::c_short,
    pub gno: ::std::os::raw::c_short,
    pub grp: ::std::os::raw::c_short,
    pub edge: ::std::os::raw::c_short,
    pub org_magazine: ::std::os::raw::c_short,
    pub org_pot: ::std::os::raw::c_short,
    pub edge_num: ::std::os::raw::c_uchar,
    pub reserve_c: ::std::os::raw::c_char,
    pub reserved: [::std::os::raw::c_long; 2usize],
    pub custom1: ::std::os::raw::c_long,
    pub custom2: ::std::os::raw::c_long,
    pub custom3: ::std::os::raw::c_long,
    pub custom4: ::std::os::raw::c_long,
    pub custom5: ::std::os::raw::c_long,
    pub custom6: ::std::os::raw::c_long,
    pub custom7: ::std::os::raw::c_long,
    pub custom8: ::std::os::raw::c_long,
    pub custom9: ::std::os::raw::c_long,
    pub custom10: ::std::os::raw::c_long,
    pub custom11: ::std::os::raw::c_long,
    pub custom12: ::std::os::raw::c_long,
    pub custom13: ::std::os::raw::c_long,
    pub custom14: ::std::os::raw::c_long,
    pub custom15: ::std::os::raw::c_long,
    pub custom16: ::std::os::raw::c_long,
    pub custom17: ::std::os::raw::c_long,
    pub custom18: ::std::os::raw::c_long,
    pub custom19: ::std::os::raw::c_long,
    pub custom20: ::std::os::raw::c_long,
    pub custom21: ::std::os::raw::c_long,
    pub custom22: ::std::os::raw::c_long,
    pub custom23: ::std::os::raw::c_long,
    pub custom24: ::std::os::raw::c_long,
    pub custom25: ::std::os::raw::c_long,
    pub custom26: ::std::os::raw::c_long,
    pub custom27: ::std::os::raw::c_long,
    pub custom28: ::std::os::raw::c_long,
    pub custom29: ::std::os::raw::c_long,
    pub custom30: ::std::os::raw::c_long,
    pub custom31: ::std::os::raw::c_long,
    pub custom32: ::std::os::raw::c_long,
    pub custom33: ::std::os::raw::c_long,
    pub custom34: ::std::os::raw::c_long,
    pub custom35: ::std::os::raw::c_long,
    pub custom36: ::std::os::raw::c_long,
    pub custom37: ::std::os::raw::c_long,
    pub custom38: ::std::os::raw::c_long,
    pub custom39: ::std::os::raw::c_long,
    pub custom40: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlmng_f2"][::std::mem::size_of::<iodbtlmng_f2>() - 416usize];
    ["Alignment of iodbtlmng_f2"][::std::mem::align_of::<iodbtlmng_f2>() - 8usize];
    ["Offset of field: iodbtlmng_f2::T_code"]
        [::std::mem::offset_of!(iodbtlmng_f2, T_code) - 0usize];
    ["Offset of field: iodbtlmng_f2::life_count"]
        [::std::mem::offset_of!(iodbtlmng_f2, life_count) - 8usize];
    ["Offset of field: iodbtlmng_f2::max_life"]
        [::std::mem::offset_of!(iodbtlmng_f2, max_life) - 16usize];
    ["Offset of field: iodbtlmng_f2::rest_life"]
        [::std::mem::offset_of!(iodbtlmng_f2, rest_life) - 24usize];
    ["Offset of field: iodbtlmng_f2::life_stat"]
        [::std::mem::offset_of!(iodbtlmng_f2, life_stat) - 32usize];
    ["Offset of field: iodbtlmng_f2::cust_bits"]
        [::std::mem::offset_of!(iodbtlmng_f2, cust_bits) - 33usize];
    ["Offset of field: iodbtlmng_f2::tool_info"]
        [::std::mem::offset_of!(iodbtlmng_f2, tool_info) - 34usize];
    ["Offset of field: iodbtlmng_f2::H_code"]
        [::std::mem::offset_of!(iodbtlmng_f2, H_code) - 36usize];
    ["Offset of field: iodbtlmng_f2::D_code"]
        [::std::mem::offset_of!(iodbtlmng_f2, D_code) - 38usize];
    ["Offset of field: iodbtlmng_f2::spindle_speed"]
        [::std::mem::offset_of!(iodbtlmng_f2, spindle_speed) - 40usize];
    ["Offset of field: iodbtlmng_f2::feedrate"]
        [::std::mem::offset_of!(iodbtlmng_f2, feedrate) - 48usize];
    ["Offset of field: iodbtlmng_f2::magazine"]
        [::std::mem::offset_of!(iodbtlmng_f2, magazine) - 56usize];
    ["Offset of field: iodbtlmng_f2::pot"][::std::mem::offset_of!(iodbtlmng_f2, pot) - 58usize];
    ["Offset of field: iodbtlmng_f2::G_code"]
        [::std::mem::offset_of!(iodbtlmng_f2, G_code) - 60usize];
    ["Offset of field: iodbtlmng_f2::W_code"]
        [::std::mem::offset_of!(iodbtlmng_f2, W_code) - 62usize];
    ["Offset of field: iodbtlmng_f2::gno"][::std::mem::offset_of!(iodbtlmng_f2, gno) - 64usize];
    ["Offset of field: iodbtlmng_f2::grp"][::std::mem::offset_of!(iodbtlmng_f2, grp) - 66usize];
    ["Offset of field: iodbtlmng_f2::edge"][::std::mem::offset_of!(iodbtlmng_f2, edge) - 68usize];
    ["Offset of field: iodbtlmng_f2::org_magazine"]
        [::std::mem::offset_of!(iodbtlmng_f2, org_magazine) - 70usize];
    ["Offset of field: iodbtlmng_f2::org_pot"]
        [::std::mem::offset_of!(iodbtlmng_f2, org_pot) - 72usize];
    ["Offset of field: iodbtlmng_f2::edge_num"]
        [::std::mem::offset_of!(iodbtlmng_f2, edge_num) - 74usize];
    ["Offset of field: iodbtlmng_f2::reserve_c"]
        [::std::mem::offset_of!(iodbtlmng_f2, reserve_c) - 75usize];
    ["Offset of field: iodbtlmng_f2::reserved"]
        [::std::mem::offset_of!(iodbtlmng_f2, reserved) - 80usize];
    ["Offset of field: iodbtlmng_f2::custom1"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom1) - 96usize];
    ["Offset of field: iodbtlmng_f2::custom2"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom2) - 104usize];
    ["Offset of field: iodbtlmng_f2::custom3"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom3) - 112usize];
    ["Offset of field: iodbtlmng_f2::custom4"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom4) - 120usize];
    ["Offset of field: iodbtlmng_f2::custom5"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom5) - 128usize];
    ["Offset of field: iodbtlmng_f2::custom6"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom6) - 136usize];
    ["Offset of field: iodbtlmng_f2::custom7"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom7) - 144usize];
    ["Offset of field: iodbtlmng_f2::custom8"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom8) - 152usize];
    ["Offset of field: iodbtlmng_f2::custom9"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom9) - 160usize];
    ["Offset of field: iodbtlmng_f2::custom10"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom10) - 168usize];
    ["Offset of field: iodbtlmng_f2::custom11"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom11) - 176usize];
    ["Offset of field: iodbtlmng_f2::custom12"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom12) - 184usize];
    ["Offset of field: iodbtlmng_f2::custom13"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom13) - 192usize];
    ["Offset of field: iodbtlmng_f2::custom14"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom14) - 200usize];
    ["Offset of field: iodbtlmng_f2::custom15"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom15) - 208usize];
    ["Offset of field: iodbtlmng_f2::custom16"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom16) - 216usize];
    ["Offset of field: iodbtlmng_f2::custom17"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom17) - 224usize];
    ["Offset of field: iodbtlmng_f2::custom18"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom18) - 232usize];
    ["Offset of field: iodbtlmng_f2::custom19"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom19) - 240usize];
    ["Offset of field: iodbtlmng_f2::custom20"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom20) - 248usize];
    ["Offset of field: iodbtlmng_f2::custom21"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom21) - 256usize];
    ["Offset of field: iodbtlmng_f2::custom22"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom22) - 264usize];
    ["Offset of field: iodbtlmng_f2::custom23"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom23) - 272usize];
    ["Offset of field: iodbtlmng_f2::custom24"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom24) - 280usize];
    ["Offset of field: iodbtlmng_f2::custom25"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom25) - 288usize];
    ["Offset of field: iodbtlmng_f2::custom26"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom26) - 296usize];
    ["Offset of field: iodbtlmng_f2::custom27"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom27) - 304usize];
    ["Offset of field: iodbtlmng_f2::custom28"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom28) - 312usize];
    ["Offset of field: iodbtlmng_f2::custom29"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom29) - 320usize];
    ["Offset of field: iodbtlmng_f2::custom30"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom30) - 328usize];
    ["Offset of field: iodbtlmng_f2::custom31"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom31) - 336usize];
    ["Offset of field: iodbtlmng_f2::custom32"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom32) - 344usize];
    ["Offset of field: iodbtlmng_f2::custom33"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom33) - 352usize];
    ["Offset of field: iodbtlmng_f2::custom34"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom34) - 360usize];
    ["Offset of field: iodbtlmng_f2::custom35"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom35) - 368usize];
    ["Offset of field: iodbtlmng_f2::custom36"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom36) - 376usize];
    ["Offset of field: iodbtlmng_f2::custom37"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom37) - 384usize];
    ["Offset of field: iodbtlmng_f2::custom38"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom38) - 392usize];
    ["Offset of field: iodbtlmng_f2::custom39"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom39) - 400usize];
    ["Offset of field: iodbtlmng_f2::custom40"]
        [::std::mem::offset_of!(iodbtlmng_f2, custom40) - 408usize];
};
pub type IODBTLMNG_F2 = iodbtlmng_f2;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct idbtlm {
    pub data_id: ::std::os::raw::c_short,
    pub item: idbtlm__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union idbtlm__bindgen_ty_1 {
    pub data1: ::std::os::raw::c_uchar,
    pub data2: ::std::os::raw::c_short,
    pub data4: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbtlm__bindgen_ty_1"][::std::mem::size_of::<idbtlm__bindgen_ty_1>() - 8usize];
    ["Alignment of idbtlm__bindgen_ty_1"][::std::mem::align_of::<idbtlm__bindgen_ty_1>() - 8usize];
    ["Offset of field: idbtlm__bindgen_ty_1::data1"]
        [::std::mem::offset_of!(idbtlm__bindgen_ty_1, data1) - 0usize];
    ["Offset of field: idbtlm__bindgen_ty_1::data2"]
        [::std::mem::offset_of!(idbtlm__bindgen_ty_1, data2) - 0usize];
    ["Offset of field: idbtlm__bindgen_ty_1::data4"]
        [::std::mem::offset_of!(idbtlm__bindgen_ty_1, data4) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbtlm"][::std::mem::size_of::<idbtlm>() - 16usize];
    ["Alignment of idbtlm"][::std::mem::align_of::<idbtlm>() - 8usize];
    ["Offset of field: idbtlm::data_id"][::std::mem::offset_of!(idbtlm, data_id) - 0usize];
    ["Offset of field: idbtlm::item"][::std::mem::offset_of!(idbtlm, item) - 8usize];
};
pub type IDBTLM = idbtlm;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbtlm2 {
    pub number: ::std::os::raw::c_short,
    pub reserve: ::std::os::raw::c_short,
    pub item: iodbtlm2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbtlm2__bindgen_ty_1 {
    pub data1: ::std::os::raw::c_uchar,
    pub data2: ::std::os::raw::c_short,
    pub data4: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlm2__bindgen_ty_1"][::std::mem::size_of::<iodbtlm2__bindgen_ty_1>() - 8usize];
    ["Alignment of iodbtlm2__bindgen_ty_1"]
        [::std::mem::align_of::<iodbtlm2__bindgen_ty_1>() - 8usize];
    ["Offset of field: iodbtlm2__bindgen_ty_1::data1"]
        [::std::mem::offset_of!(iodbtlm2__bindgen_ty_1, data1) - 0usize];
    ["Offset of field: iodbtlm2__bindgen_ty_1::data2"]
        [::std::mem::offset_of!(iodbtlm2__bindgen_ty_1, data2) - 0usize];
    ["Offset of field: iodbtlm2__bindgen_ty_1::data4"]
        [::std::mem::offset_of!(iodbtlm2__bindgen_ty_1, data4) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlm2"][::std::mem::size_of::<iodbtlm2>() - 16usize];
    ["Alignment of iodbtlm2"][::std::mem::align_of::<iodbtlm2>() - 8usize];
    ["Offset of field: iodbtlm2::number"][::std::mem::offset_of!(iodbtlm2, number) - 0usize];
    ["Offset of field: iodbtlm2::reserve"][::std::mem::offset_of!(iodbtlm2, reserve) - 2usize];
    ["Offset of field: iodbtlm2::item"][::std::mem::offset_of!(iodbtlm2, item) - 8usize];
};
pub type IODBTLM2 = iodbtlm2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlmag {
    pub magazine: ::std::os::raw::c_short,
    pub pot: ::std::os::raw::c_short,
    pub tool_index: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlmag"][::std::mem::size_of::<iodbtlmag>() - 6usize];
    ["Alignment of iodbtlmag"][::std::mem::align_of::<iodbtlmag>() - 2usize];
    ["Offset of field: iodbtlmag::magazine"][::std::mem::offset_of!(iodbtlmag, magazine) - 0usize];
    ["Offset of field: iodbtlmag::pot"][::std::mem::offset_of!(iodbtlmag, pot) - 2usize];
    ["Offset of field: iodbtlmag::tool_index"]
        [::std::mem::offset_of!(iodbtlmag, tool_index) - 4usize];
};
pub type IODBTLMAG = iodbtlmag;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlmag2 {
    pub magazine: ::std::os::raw::c_short,
    pub pot: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlmag2"][::std::mem::size_of::<iodbtlmag2>() - 4usize];
    ["Alignment of iodbtlmag2"][::std::mem::align_of::<iodbtlmag2>() - 2usize];
    ["Offset of field: iodbtlmag2::magazine"]
        [::std::mem::offset_of!(iodbtlmag2, magazine) - 0usize];
    ["Offset of field: iodbtlmag2::pot"][::std::mem::offset_of!(iodbtlmag2, pot) - 2usize];
};
pub type IODBTLMAG2 = iodbtlmag2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlname {
    pub sp_name: iodbtlname__bindgen_ty_1,
    pub wt_name: iodbtlname__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlname__bindgen_ty_1 {
    pub sp_pos1: [::std::os::raw::c_char; 5usize],
    pub sp_pos2: [::std::os::raw::c_char; 5usize],
    pub sp_pos3: [::std::os::raw::c_char; 5usize],
    pub sp_pos4: [::std::os::raw::c_char; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlname__bindgen_ty_1"]
        [::std::mem::size_of::<iodbtlname__bindgen_ty_1>() - 20usize];
    ["Alignment of iodbtlname__bindgen_ty_1"]
        [::std::mem::align_of::<iodbtlname__bindgen_ty_1>() - 1usize];
    ["Offset of field: iodbtlname__bindgen_ty_1::sp_pos1"]
        [::std::mem::offset_of!(iodbtlname__bindgen_ty_1, sp_pos1) - 0usize];
    ["Offset of field: iodbtlname__bindgen_ty_1::sp_pos2"]
        [::std::mem::offset_of!(iodbtlname__bindgen_ty_1, sp_pos2) - 5usize];
    ["Offset of field: iodbtlname__bindgen_ty_1::sp_pos3"]
        [::std::mem::offset_of!(iodbtlname__bindgen_ty_1, sp_pos3) - 10usize];
    ["Offset of field: iodbtlname__bindgen_ty_1::sp_pos4"]
        [::std::mem::offset_of!(iodbtlname__bindgen_ty_1, sp_pos4) - 15usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlname__bindgen_ty_2 {
    pub wt_pos1: [::std::os::raw::c_char; 5usize],
    pub wt_pos2: [::std::os::raw::c_char; 5usize],
    pub wt_pos3: [::std::os::raw::c_char; 5usize],
    pub wt_pos4: [::std::os::raw::c_char; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlname__bindgen_ty_2"]
        [::std::mem::size_of::<iodbtlname__bindgen_ty_2>() - 20usize];
    ["Alignment of iodbtlname__bindgen_ty_2"]
        [::std::mem::align_of::<iodbtlname__bindgen_ty_2>() - 1usize];
    ["Offset of field: iodbtlname__bindgen_ty_2::wt_pos1"]
        [::std::mem::offset_of!(iodbtlname__bindgen_ty_2, wt_pos1) - 0usize];
    ["Offset of field: iodbtlname__bindgen_ty_2::wt_pos2"]
        [::std::mem::offset_of!(iodbtlname__bindgen_ty_2, wt_pos2) - 5usize];
    ["Offset of field: iodbtlname__bindgen_ty_2::wt_pos3"]
        [::std::mem::offset_of!(iodbtlname__bindgen_ty_2, wt_pos3) - 10usize];
    ["Offset of field: iodbtlname__bindgen_ty_2::wt_pos4"]
        [::std::mem::offset_of!(iodbtlname__bindgen_ty_2, wt_pos4) - 15usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlname"][::std::mem::size_of::<iodbtlname>() - 40usize];
    ["Alignment of iodbtlname"][::std::mem::align_of::<iodbtlname>() - 1usize];
    ["Offset of field: iodbtlname::sp_name"][::std::mem::offset_of!(iodbtlname, sp_name) - 0usize];
    ["Offset of field: iodbtlname::wt_name"][::std::mem::offset_of!(iodbtlname, wt_name) - 20usize];
};
pub type IODBTLSPWTNAME = iodbtlname;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tlmngtlgeom {
    pub l_pot_num: ::std::os::raw::c_uchar,
    pub r_pot_num: ::std::os::raw::c_uchar,
    pub u_pot_num: ::std::os::raw::c_uchar,
    pub d_pot_num: ::std::os::raw::c_uchar,
    pub tl_geom_num: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tlmngtlgeom"][::std::mem::size_of::<tlmngtlgeom>() - 5usize];
    ["Alignment of tlmngtlgeom"][::std::mem::align_of::<tlmngtlgeom>() - 1usize];
    ["Offset of field: tlmngtlgeom::l_pot_num"]
        [::std::mem::offset_of!(tlmngtlgeom, l_pot_num) - 0usize];
    ["Offset of field: tlmngtlgeom::r_pot_num"]
        [::std::mem::offset_of!(tlmngtlgeom, r_pot_num) - 1usize];
    ["Offset of field: tlmngtlgeom::u_pot_num"]
        [::std::mem::offset_of!(tlmngtlgeom, u_pot_num) - 2usize];
    ["Offset of field: tlmngtlgeom::d_pot_num"]
        [::std::mem::offset_of!(tlmngtlgeom, d_pot_num) - 3usize];
    ["Offset of field: tlmngtlgeom::tl_geom_num"]
        [::std::mem::offset_of!(tlmngtlgeom, tl_geom_num) - 4usize];
};
pub type IODBTLGEOM = tlmngtlgeom;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlintf {
    pub inf_tool: [::std::os::raw::c_short; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlintf"][::std::mem::size_of::<iodbtlintf>() - 4usize];
    ["Alignment of iodbtlintf"][::std::mem::align_of::<iodbtlintf>() - 2usize];
    ["Offset of field: iodbtlintf::inf_tool"]
        [::std::mem::offset_of!(iodbtlintf, inf_tool) - 0usize];
};
pub type IODBTLINTF = iodbtlintf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtllf {
    pub T_code_sum: ::std::os::raw::c_long,
    pub life_count_sum: ::std::os::raw::c_long,
    pub rem_life_sum: ::std::os::raw::c_long,
    pub max_life_sum: ::std::os::raw::c_long,
    pub notice_life_sum: ::std::os::raw::c_long,
    pub tools_sum: ::std::os::raw::c_short,
    pub notice_stat_sum: ::std::os::raw::c_char,
    pub count_type_sum: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtllf"][::std::mem::size_of::<iodbtllf>() - 48usize];
    ["Alignment of iodbtllf"][::std::mem::align_of::<iodbtllf>() - 8usize];
    ["Offset of field: iodbtllf::T_code_sum"]
        [::std::mem::offset_of!(iodbtllf, T_code_sum) - 0usize];
    ["Offset of field: iodbtllf::life_count_sum"]
        [::std::mem::offset_of!(iodbtllf, life_count_sum) - 8usize];
    ["Offset of field: iodbtllf::rem_life_sum"]
        [::std::mem::offset_of!(iodbtllf, rem_life_sum) - 16usize];
    ["Offset of field: iodbtllf::max_life_sum"]
        [::std::mem::offset_of!(iodbtllf, max_life_sum) - 24usize];
    ["Offset of field: iodbtllf::notice_life_sum"]
        [::std::mem::offset_of!(iodbtllf, notice_life_sum) - 32usize];
    ["Offset of field: iodbtllf::tools_sum"][::std::mem::offset_of!(iodbtllf, tools_sum) - 40usize];
    ["Offset of field: iodbtllf::notice_stat_sum"]
        [::std::mem::offset_of!(iodbtllf, notice_stat_sum) - 42usize];
    ["Offset of field: iodbtllf::count_type_sum"]
        [::std::mem::offset_of!(iodbtllf, count_type_sum) - 43usize];
};
pub type IODBTLLF = iodbtllf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtl_retype {
    pub type_: ::std::os::raw::c_uchar,
    pub data_type: ::std::os::raw::c_uchar,
    pub renew: ::std::os::raw::c_char,
    pub reserve: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtl_retype"][::std::mem::size_of::<iodbtl_retype>() - 4usize];
    ["Alignment of iodbtl_retype"][::std::mem::align_of::<iodbtl_retype>() - 1usize];
    ["Offset of field: iodbtl_retype::type_"]
        [::std::mem::offset_of!(iodbtl_retype, type_) - 0usize];
    ["Offset of field: iodbtl_retype::data_type"]
        [::std::mem::offset_of!(iodbtl_retype, data_type) - 1usize];
    ["Offset of field: iodbtl_retype::renew"]
        [::std::mem::offset_of!(iodbtl_retype, renew) - 2usize];
    ["Offset of field: iodbtl_retype::reserve"]
        [::std::mem::offset_of!(iodbtl_retype, reserve) - 3usize];
};
pub type IODBTL_RDTYPE = iodbtl_retype;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtllfd {
    pub order: ::std::os::raw::c_short,
    pub tool_num: ::std::os::raw::c_short,
    pub life_count: ::std::os::raw::c_long,
    pub rem_life: ::std::os::raw::c_long,
    pub max_life: ::std::os::raw::c_long,
    pub notice_life: ::std::os::raw::c_long,
    pub life_stat: ::std::os::raw::c_char,
    pub count_type: ::std::os::raw::c_char,
    pub reserve: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtllfd"][::std::mem::size_of::<iodbtllfd>() - 48usize];
    ["Alignment of iodbtllfd"][::std::mem::align_of::<iodbtllfd>() - 8usize];
    ["Offset of field: iodbtllfd::order"][::std::mem::offset_of!(iodbtllfd, order) - 0usize];
    ["Offset of field: iodbtllfd::tool_num"][::std::mem::offset_of!(iodbtllfd, tool_num) - 2usize];
    ["Offset of field: iodbtllfd::life_count"]
        [::std::mem::offset_of!(iodbtllfd, life_count) - 8usize];
    ["Offset of field: iodbtllfd::rem_life"][::std::mem::offset_of!(iodbtllfd, rem_life) - 16usize];
    ["Offset of field: iodbtllfd::max_life"][::std::mem::offset_of!(iodbtllfd, max_life) - 24usize];
    ["Offset of field: iodbtllfd::notice_life"]
        [::std::mem::offset_of!(iodbtllfd, notice_life) - 32usize];
    ["Offset of field: iodbtllfd::life_stat"]
        [::std::mem::offset_of!(iodbtllfd, life_stat) - 40usize];
    ["Offset of field: iodbtllfd::count_type"]
        [::std::mem::offset_of!(iodbtllfd, count_type) - 41usize];
    ["Offset of field: iodbtllfd::reserve"][::std::mem::offset_of!(iodbtllfd, reserve) - 42usize];
};
pub type IODBTLLFD = iodbtllfd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlmgr_check {
    pub T_code: ::std::os::raw::c_long,
    pub tool_num: ::std::os::raw::c_short,
    pub reserve: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlmgr_check"][::std::mem::size_of::<iodbtlmgr_check>() - 16usize];
    ["Alignment of iodbtlmgr_check"][::std::mem::align_of::<iodbtlmgr_check>() - 8usize];
    ["Offset of field: iodbtlmgr_check::T_code"]
        [::std::mem::offset_of!(iodbtlmgr_check, T_code) - 0usize];
    ["Offset of field: iodbtlmgr_check::tool_num"]
        [::std::mem::offset_of!(iodbtlmgr_check, tool_num) - 8usize];
    ["Offset of field: iodbtlmgr_check::reserve"]
        [::std::mem::offset_of!(iodbtlmgr_check, reserve) - 10usize];
};
pub type IODBTLMGR_CHECK = iodbtlmgr_check;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtool_date {
    pub year: ::std::os::raw::c_short,
    pub mon: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub min: ::std::os::raw::c_short,
    pub sec: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtool_date"][::std::mem::size_of::<iodbtool_date>() - 12usize];
    ["Alignment of iodbtool_date"][::std::mem::align_of::<iodbtool_date>() - 2usize];
    ["Offset of field: iodbtool_date::year"][::std::mem::offset_of!(iodbtool_date, year) - 0usize];
    ["Offset of field: iodbtool_date::mon"][::std::mem::offset_of!(iodbtool_date, mon) - 2usize];
    ["Offset of field: iodbtool_date::day"][::std::mem::offset_of!(iodbtool_date, day) - 4usize];
    ["Offset of field: iodbtool_date::hour"][::std::mem::offset_of!(iodbtool_date, hour) - 6usize];
    ["Offset of field: iodbtool_date::min"][::std::mem::offset_of!(iodbtool_date, min) - 8usize];
    ["Offset of field: iodbtool_date::sec"][::std::mem::offset_of!(iodbtool_date, sec) - 10usize];
};
pub type IODBTOOL_DATE = iodbtool_date;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtool_inhis {
    pub tool_no: ::std::os::raw::c_short,
    pub reserve: ::std::os::raw::c_short,
    pub date: IODBTOOL_DATE,
    pub tool_f2: IODBTLMNG_F2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtool_inhis"][::std::mem::size_of::<iodbtool_inhis>() - 432usize];
    ["Alignment of iodbtool_inhis"][::std::mem::align_of::<iodbtool_inhis>() - 8usize];
    ["Offset of field: iodbtool_inhis::tool_no"]
        [::std::mem::offset_of!(iodbtool_inhis, tool_no) - 0usize];
    ["Offset of field: iodbtool_inhis::reserve"]
        [::std::mem::offset_of!(iodbtool_inhis, reserve) - 2usize];
    ["Offset of field: iodbtool_inhis::date"]
        [::std::mem::offset_of!(iodbtool_inhis, date) - 4usize];
    ["Offset of field: iodbtool_inhis::tool_f2"]
        [::std::mem::offset_of!(iodbtool_inhis, tool_f2) - 16usize];
};
pub type IODBTOOL_INHIS = iodbtool_inhis;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtool_outhis {
    pub tool_no: ::std::os::raw::c_short,
    pub cause: ::std::os::raw::c_short,
    pub date: IODBTOOL_DATE,
    pub tool_f2: IODBTLMNG_F2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtool_outhis"][::std::mem::size_of::<iodbtool_outhis>() - 432usize];
    ["Alignment of iodbtool_outhis"][::std::mem::align_of::<iodbtool_outhis>() - 8usize];
    ["Offset of field: iodbtool_outhis::tool_no"]
        [::std::mem::offset_of!(iodbtool_outhis, tool_no) - 0usize];
    ["Offset of field: iodbtool_outhis::cause"]
        [::std::mem::offset_of!(iodbtool_outhis, cause) - 2usize];
    ["Offset of field: iodbtool_outhis::date"]
        [::std::mem::offset_of!(iodbtool_outhis, date) - 4usize];
    ["Offset of field: iodbtool_outhis::tool_f2"]
        [::std::mem::offset_of!(iodbtool_outhis, tool_f2) - 16usize];
};
pub type IODBTOOL_OUTHIS = iodbtool_outhis;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtool_causenme {
    pub cause1: [::std::os::raw::c_char; 8usize],
    pub cause2: [::std::os::raw::c_char; 8usize],
    pub cause3: [::std::os::raw::c_char; 8usize],
    pub cause4: [::std::os::raw::c_char; 8usize],
    pub cause5: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtool_causenme"][::std::mem::size_of::<iodbtool_causenme>() - 40usize];
    ["Alignment of iodbtool_causenme"][::std::mem::align_of::<iodbtool_causenme>() - 1usize];
    ["Offset of field: iodbtool_causenme::cause1"]
        [::std::mem::offset_of!(iodbtool_causenme, cause1) - 0usize];
    ["Offset of field: iodbtool_causenme::cause2"]
        [::std::mem::offset_of!(iodbtool_causenme, cause2) - 8usize];
    ["Offset of field: iodbtool_causenme::cause3"]
        [::std::mem::offset_of!(iodbtool_causenme, cause3) - 16usize];
    ["Offset of field: iodbtool_causenme::cause4"]
        [::std::mem::offset_of!(iodbtool_causenme, cause4) - 24usize];
    ["Offset of field: iodbtool_causenme::cause5"]
        [::std::mem::offset_of!(iodbtool_causenme, cause5) - 32usize];
};
pub type IODBTOOL_CAUSENME = iodbtool_causenme;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlmng_sort {
    pub tl_num: ::std::os::raw::c_short,
    pub reserve: ::std::os::raw::c_short,
    pub data: IODBTLMNG_F2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlmng_sort"][::std::mem::size_of::<iodbtlmng_sort>() - 424usize];
    ["Alignment of iodbtlmng_sort"][::std::mem::align_of::<iodbtlmng_sort>() - 8usize];
    ["Offset of field: iodbtlmng_sort::tl_num"]
        [::std::mem::offset_of!(iodbtlmng_sort, tl_num) - 0usize];
    ["Offset of field: iodbtlmng_sort::reserve"]
        [::std::mem::offset_of!(iodbtlmng_sort, reserve) - 2usize];
    ["Offset of field: iodbtlmng_sort::data"]
        [::std::mem::offset_of!(iodbtlmng_sort, data) - 8usize];
};
pub type IODBTLMNG_SORT = iodbtlmng_sort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmagprty {
    pub mag: ::std::os::raw::c_short,
    pub reserve_s: ::std::os::raw::c_short,
    pub mag_info: ::std::os::raw::c_uchar,
    pub reserve: [::std::os::raw::c_char; 3usize],
    pub mt_line: ::std::os::raw::c_short,
    pub mt_row: ::std::os::raw::c_short,
    pub cstm: [::std::os::raw::c_long; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbmagprty"][::std::mem::size_of::<iodbmagprty>() - 48usize];
    ["Alignment of iodbmagprty"][::std::mem::align_of::<iodbmagprty>() - 8usize];
    ["Offset of field: iodbmagprty::mag"][::std::mem::offset_of!(iodbmagprty, mag) - 0usize];
    ["Offset of field: iodbmagprty::reserve_s"]
        [::std::mem::offset_of!(iodbmagprty, reserve_s) - 2usize];
    ["Offset of field: iodbmagprty::mag_info"]
        [::std::mem::offset_of!(iodbmagprty, mag_info) - 4usize];
    ["Offset of field: iodbmagprty::reserve"]
        [::std::mem::offset_of!(iodbmagprty, reserve) - 5usize];
    ["Offset of field: iodbmagprty::mt_line"]
        [::std::mem::offset_of!(iodbmagprty, mt_line) - 8usize];
    ["Offset of field: iodbmagprty::mt_row"][::std::mem::offset_of!(iodbmagprty, mt_row) - 10usize];
    ["Offset of field: iodbmagprty::cstm"][::std::mem::offset_of!(iodbmagprty, cstm) - 16usize];
};
pub type IODBMAGPRTY = iodbmagprty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbpotprty {
    pub tool_no: ::std::os::raw::c_short,
    pub pot_type: ::std::os::raw::c_short,
    pub pot_info1: ::std::os::raw::c_uchar,
    pub pot_info2: ::std::os::raw::c_uchar,
    pub reserve: [::std::os::raw::c_char; 2usize],
    pub cstm: [::std::os::raw::c_long; 10usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbpotprty"][::std::mem::size_of::<iodbpotprty>() - 88usize];
    ["Alignment of iodbpotprty"][::std::mem::align_of::<iodbpotprty>() - 8usize];
    ["Offset of field: iodbpotprty::tool_no"]
        [::std::mem::offset_of!(iodbpotprty, tool_no) - 0usize];
    ["Offset of field: iodbpotprty::pot_type"]
        [::std::mem::offset_of!(iodbpotprty, pot_type) - 2usize];
    ["Offset of field: iodbpotprty::pot_info1"]
        [::std::mem::offset_of!(iodbpotprty, pot_info1) - 4usize];
    ["Offset of field: iodbpotprty::pot_info2"]
        [::std::mem::offset_of!(iodbpotprty, pot_info2) - 5usize];
    ["Offset of field: iodbpotprty::reserve"]
        [::std::mem::offset_of!(iodbpotprty, reserve) - 6usize];
    ["Offset of field: iodbpotprty::cstm"][::std::mem::offset_of!(iodbpotprty, cstm) - 8usize];
};
pub type IODBPOTPRTY = iodbpotprty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmagprty2 {
    pub mag: ::std::os::raw::c_short,
    pub reserve: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbmagprty2"][::std::mem::size_of::<iodbmagprty2>() - 4usize];
    ["Alignment of iodbmagprty2"][::std::mem::align_of::<iodbmagprty2>() - 2usize];
    ["Offset of field: iodbmagprty2::mag"][::std::mem::offset_of!(iodbmagprty2, mag) - 0usize];
    ["Offset of field: iodbmagprty2::reserve"]
        [::std::mem::offset_of!(iodbmagprty2, reserve) - 2usize];
};
pub type IODBMAGPRTY2 = iodbmagprty2;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct idbtlm_srchdt {
    pub id_info: IDBTLM,
    pub srch_cond: ::std::os::raw::c_short,
    pub add_cond: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbtlm_srchdt"][::std::mem::size_of::<idbtlm_srchdt>() - 24usize];
    ["Alignment of idbtlm_srchdt"][::std::mem::align_of::<idbtlm_srchdt>() - 8usize];
    ["Offset of field: idbtlm_srchdt::id_info"]
        [::std::mem::offset_of!(idbtlm_srchdt, id_info) - 0usize];
    ["Offset of field: idbtlm_srchdt::srch_cond"]
        [::std::mem::offset_of!(idbtlm_srchdt, srch_cond) - 16usize];
    ["Offset of field: idbtlm_srchdt::add_cond"]
        [::std::mem::offset_of!(idbtlm_srchdt, add_cond) - 18usize];
};
pub type IDBTLM_SRCHDT = idbtlm_srchdt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlmag_srchinfo {
    pub startInfo: IODBTLMAG2,
    pub result: IODBTLMAG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlmag_srchinfo"][::std::mem::size_of::<iodbtlmag_srchinfo>() - 10usize];
    ["Alignment of iodbtlmag_srchinfo"][::std::mem::align_of::<iodbtlmag_srchinfo>() - 2usize];
    ["Offset of field: iodbtlmag_srchinfo::startInfo"]
        [::std::mem::offset_of!(iodbtlmag_srchinfo, startInfo) - 0usize];
    ["Offset of field: iodbtlmag_srchinfo::result"]
        [::std::mem::offset_of!(iodbtlmag_srchinfo, result) - 4usize];
};
pub type IODBTLMAG_SRCHINFO = iodbtlmag_srchinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtl_free_num {
    pub edge_gp: ::std::os::raw::c_short,
    pub ofs_h: ::std::os::raw::c_short,
    pub ofs_d: ::std::os::raw::c_short,
    pub ofs_g: ::std::os::raw::c_short,
    pub ofs_w: ::std::os::raw::c_short,
    pub reserve: [::std::os::raw::c_short; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtl_free_num"][::std::mem::size_of::<odbtl_free_num>() - 16usize];
    ["Alignment of odbtl_free_num"][::std::mem::align_of::<odbtl_free_num>() - 2usize];
    ["Offset of field: odbtl_free_num::edge_gp"]
        [::std::mem::offset_of!(odbtl_free_num, edge_gp) - 0usize];
    ["Offset of field: odbtl_free_num::ofs_h"]
        [::std::mem::offset_of!(odbtl_free_num, ofs_h) - 2usize];
    ["Offset of field: odbtl_free_num::ofs_d"]
        [::std::mem::offset_of!(odbtl_free_num, ofs_d) - 4usize];
    ["Offset of field: odbtl_free_num::ofs_g"]
        [::std::mem::offset_of!(odbtl_free_num, ofs_g) - 6usize];
    ["Offset of field: odbtl_free_num::ofs_w"]
        [::std::mem::offset_of!(odbtl_free_num, ofs_w) - 8usize];
    ["Offset of field: odbtl_free_num::reserve"]
        [::std::mem::offset_of!(odbtl_free_num, reserve) - 10usize];
};
pub type ODBTL_FREE_NUM = odbtl_free_num;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlmng_mu_edge_data {
    pub life_count: ::std::os::raw::c_long,
    pub max_life: ::std::os::raw::c_long,
    pub rest_life: ::std::os::raw::c_long,
    pub life_stat: ::std::os::raw::c_uchar,
    pub cust_bits: ::std::os::raw::c_uchar,
    pub reserve_s: ::std::os::raw::c_short,
    pub H_code: ::std::os::raw::c_short,
    pub D_code: ::std::os::raw::c_short,
    pub spindle_speed: ::std::os::raw::c_long,
    pub feedrate: ::std::os::raw::c_long,
    pub G_code: ::std::os::raw::c_short,
    pub W_code: ::std::os::raw::c_short,
    pub custom1: ::std::os::raw::c_long,
    pub custom2: ::std::os::raw::c_long,
    pub custom3: ::std::os::raw::c_long,
    pub custom4: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlmng_mu_edge_data"][::std::mem::size_of::<iodbtlmng_mu_edge_data>() - 88usize];
    ["Alignment of iodbtlmng_mu_edge_data"]
        [::std::mem::align_of::<iodbtlmng_mu_edge_data>() - 8usize];
    ["Offset of field: iodbtlmng_mu_edge_data::life_count"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, life_count) - 0usize];
    ["Offset of field: iodbtlmng_mu_edge_data::max_life"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, max_life) - 8usize];
    ["Offset of field: iodbtlmng_mu_edge_data::rest_life"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, rest_life) - 16usize];
    ["Offset of field: iodbtlmng_mu_edge_data::life_stat"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, life_stat) - 24usize];
    ["Offset of field: iodbtlmng_mu_edge_data::cust_bits"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, cust_bits) - 25usize];
    ["Offset of field: iodbtlmng_mu_edge_data::reserve_s"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, reserve_s) - 26usize];
    ["Offset of field: iodbtlmng_mu_edge_data::H_code"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, H_code) - 28usize];
    ["Offset of field: iodbtlmng_mu_edge_data::D_code"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, D_code) - 30usize];
    ["Offset of field: iodbtlmng_mu_edge_data::spindle_speed"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, spindle_speed) - 32usize];
    ["Offset of field: iodbtlmng_mu_edge_data::feedrate"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, feedrate) - 40usize];
    ["Offset of field: iodbtlmng_mu_edge_data::G_code"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, G_code) - 48usize];
    ["Offset of field: iodbtlmng_mu_edge_data::W_code"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, W_code) - 50usize];
    ["Offset of field: iodbtlmng_mu_edge_data::custom1"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, custom1) - 56usize];
    ["Offset of field: iodbtlmng_mu_edge_data::custom2"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, custom2) - 64usize];
    ["Offset of field: iodbtlmng_mu_edge_data::custom3"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, custom3) - 72usize];
    ["Offset of field: iodbtlmng_mu_edge_data::custom4"]
        [::std::mem::offset_of!(iodbtlmng_mu_edge_data, custom4) - 80usize];
};
pub type IODBTLMNG_MU_EDGE_DATA = iodbtlmng_mu_edge_data;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbtlmng_edge_data {
    pub u: odbtlmng_edge_data__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbtlmng_edge_data__bindgen_ty_1 {
    pub edge: IODBTLMNG_MU_EDGE_DATA,
    pub tllf: IODBTLLF,
    pub tllfd: IODBTLLFD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtlmng_edge_data__bindgen_ty_1"]
        [::std::mem::size_of::<odbtlmng_edge_data__bindgen_ty_1>() - 88usize];
    ["Alignment of odbtlmng_edge_data__bindgen_ty_1"]
        [::std::mem::align_of::<odbtlmng_edge_data__bindgen_ty_1>() - 8usize];
    ["Offset of field: odbtlmng_edge_data__bindgen_ty_1::edge"]
        [::std::mem::offset_of!(odbtlmng_edge_data__bindgen_ty_1, edge) - 0usize];
    ["Offset of field: odbtlmng_edge_data__bindgen_ty_1::tllf"]
        [::std::mem::offset_of!(odbtlmng_edge_data__bindgen_ty_1, tllf) - 0usize];
    ["Offset of field: odbtlmng_edge_data__bindgen_ty_1::tllfd"]
        [::std::mem::offset_of!(odbtlmng_edge_data__bindgen_ty_1, tllfd) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtlmng_edge_data"][::std::mem::size_of::<odbtlmng_edge_data>() - 88usize];
    ["Alignment of odbtlmng_edge_data"][::std::mem::align_of::<odbtlmng_edge_data>() - 8usize];
    ["Offset of field: odbtlmng_edge_data::u"]
        [::std::mem::offset_of!(odbtlmng_edge_data, u) - 0usize];
};
pub type ODBTLMNG_EDGE_DATA = odbtlmng_edge_data;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbtlmng_mu_edge {
    pub data_no: ::std::os::raw::c_short,
    pub edge_no: ::std::os::raw::c_short,
    pub edge_data: ODBTLMNG_EDGE_DATA,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbtlmng_mu_edge"][::std::mem::size_of::<odbtlmng_mu_edge>() - 96usize];
    ["Alignment of odbtlmng_mu_edge"][::std::mem::align_of::<odbtlmng_mu_edge>() - 8usize];
    ["Offset of field: odbtlmng_mu_edge::data_no"]
        [::std::mem::offset_of!(odbtlmng_mu_edge, data_no) - 0usize];
    ["Offset of field: odbtlmng_mu_edge::edge_no"]
        [::std::mem::offset_of!(odbtlmng_mu_edge, edge_no) - 2usize];
    ["Offset of field: odbtlmng_mu_edge::edge_data"]
        [::std::mem::offset_of!(odbtlmng_mu_edge, edge_data) - 8usize];
};
pub type ODBTLMNG_MU_EDGE = odbtlmng_mu_edge;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlmgr_edg {
    pub data_no: ::std::os::raw::c_short,
    pub edge_no: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlmgr_edg"][::std::mem::size_of::<iodbtlmgr_edg>() - 4usize];
    ["Alignment of iodbtlmgr_edg"][::std::mem::align_of::<iodbtlmgr_edg>() - 2usize];
    ["Offset of field: iodbtlmgr_edg::data_no"]
        [::std::mem::offset_of!(iodbtlmgr_edg, data_no) - 0usize];
    ["Offset of field: iodbtlmgr_edg::edge_no"]
        [::std::mem::offset_of!(iodbtlmgr_edg, edge_no) - 2usize];
};
pub type IODBTLMGR_EDG = iodbtlmgr_edg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbtlmgr_add_info {
    pub dsp_info: ::std::os::raw::c_long,
    pub data_kind: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idbtlmgr_add_info"][::std::mem::size_of::<idbtlmgr_add_info>() - 16usize];
    ["Alignment of idbtlmgr_add_info"][::std::mem::align_of::<idbtlmgr_add_info>() - 8usize];
    ["Offset of field: idbtlmgr_add_info::dsp_info"]
        [::std::mem::offset_of!(idbtlmgr_add_info, dsp_info) - 0usize];
    ["Offset of field: idbtlmgr_add_info::data_kind"]
        [::std::mem::offset_of!(idbtlmgr_add_info, data_kind) - 8usize];
};
pub type IDBTLMGR_ADD_INFO = idbtlmgr_add_info;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbtlmgr_page {
    pub info: iodbtlmgr_page__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbtlmgr_page__bindgen_ty_1 {
    pub edg: IODBTLMGR_EDG,
    pub page: iodbtlmgr_page__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlmgr_page__bindgen_ty_1__bindgen_ty_1 {
    pub s_edg: IODBTLMGR_EDG,
    pub e_edg: IODBTLMGR_EDG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlmgr_page__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<iodbtlmgr_page__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of iodbtlmgr_page__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<iodbtlmgr_page__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: iodbtlmgr_page__bindgen_ty_1__bindgen_ty_1::s_edg"]
        [::std::mem::offset_of!(iodbtlmgr_page__bindgen_ty_1__bindgen_ty_1, s_edg) - 0usize];
    ["Offset of field: iodbtlmgr_page__bindgen_ty_1__bindgen_ty_1::e_edg"]
        [::std::mem::offset_of!(iodbtlmgr_page__bindgen_ty_1__bindgen_ty_1, e_edg) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlmgr_page__bindgen_ty_1"]
        [::std::mem::size_of::<iodbtlmgr_page__bindgen_ty_1>() - 8usize];
    ["Alignment of iodbtlmgr_page__bindgen_ty_1"]
        [::std::mem::align_of::<iodbtlmgr_page__bindgen_ty_1>() - 2usize];
    ["Offset of field: iodbtlmgr_page__bindgen_ty_1::edg"]
        [::std::mem::offset_of!(iodbtlmgr_page__bindgen_ty_1, edg) - 0usize];
    ["Offset of field: iodbtlmgr_page__bindgen_ty_1::page"]
        [::std::mem::offset_of!(iodbtlmgr_page__bindgen_ty_1, page) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iodbtlmgr_page"][::std::mem::size_of::<iodbtlmgr_page>() - 8usize];
    ["Alignment of iodbtlmgr_page"][::std::mem::align_of::<iodbtlmgr_page>() - 2usize];
    ["Offset of field: iodbtlmgr_page::info"]
        [::std::mem::offset_of!(iodbtlmgr_page, info) - 0usize];
};
pub type IODBTLMGR_PAGE = iodbtlmgr_page;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbhis {
    pub s_no: ::std::os::raw::c_ushort,
    pub type_: ::std::os::raw::c_short,
    pub e_no: ::std::os::raw::c_ushort,
    pub data: [odbhis__bindgen_ty_1; 10usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbhis__bindgen_ty_1 {
    pub rec_alm: odbhis__bindgen_ty_1__bindgen_ty_1,
    pub rec_mdi: odbhis__bindgen_ty_1__bindgen_ty_2,
    pub rec_sgn: odbhis__bindgen_ty_1__bindgen_ty_3,
    pub rec_date: odbhis__bindgen_ty_1__bindgen_ty_4,
    pub rec_time: odbhis__bindgen_ty_1__bindgen_ty_5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbhis__bindgen_ty_1__bindgen_ty_1 {
    pub rec_type: ::std::os::raw::c_short,
    pub alm_grp: ::std::os::raw::c_short,
    pub alm_no: ::std::os::raw::c_short,
    pub axis_no: ::std::os::raw::c_char,
    pub dummy: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbhis__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<odbhis__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of odbhis__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<odbhis__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_1::rec_type"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_1, rec_type) - 0usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_1::alm_grp"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_1, alm_grp) - 2usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_1::alm_no"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_1, alm_no) - 4usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_1::axis_no"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_1, axis_no) - 6usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_1::dummy"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_1, dummy) - 7usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbhis__bindgen_ty_1__bindgen_ty_2 {
    pub rec_type: ::std::os::raw::c_short,
    pub key_code: ::std::os::raw::c_char,
    pub pw_flag: ::std::os::raw::c_char,
    pub dummy: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbhis__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<odbhis__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of odbhis__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<odbhis__bindgen_ty_1__bindgen_ty_2>() - 2usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_2::rec_type"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_2, rec_type) - 0usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_2::key_code"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_2, key_code) - 2usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_2::pw_flag"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_2, pw_flag) - 3usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_2::dummy"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_2, dummy) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbhis__bindgen_ty_1__bindgen_ty_3 {
    pub rec_type: ::std::os::raw::c_short,
    pub sig_name: ::std::os::raw::c_char,
    pub sig_old: ::std::os::raw::c_char,
    pub sig_new: ::std::os::raw::c_char,
    pub dummy: ::std::os::raw::c_char,
    pub sig_no: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbhis__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<odbhis__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Alignment of odbhis__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<odbhis__bindgen_ty_1__bindgen_ty_3>() - 2usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_3::rec_type"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_3, rec_type) - 0usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_3::sig_name"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_3, sig_name) - 2usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_3::sig_old"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_3, sig_old) - 3usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_3::sig_new"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_3, sig_new) - 4usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_3::dummy"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_3, dummy) - 5usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_3::sig_no"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_3, sig_no) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbhis__bindgen_ty_1__bindgen_ty_4 {
    pub rec_type: ::std::os::raw::c_short,
    pub year: ::std::os::raw::c_char,
    pub month: ::std::os::raw::c_char,
    pub day: ::std::os::raw::c_char,
    pub pw_flag: ::std::os::raw::c_char,
    pub dummy: [::std::os::raw::c_char; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbhis__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<odbhis__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Alignment of odbhis__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<odbhis__bindgen_ty_1__bindgen_ty_4>() - 2usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_4::rec_type"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_4, rec_type) - 0usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_4::year"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_4, year) - 2usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_4::month"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_4, month) - 3usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_4::day"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_4, day) - 4usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_4::pw_flag"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_4, pw_flag) - 5usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_4::dummy"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_4, dummy) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbhis__bindgen_ty_1__bindgen_ty_5 {
    pub rec_type: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_char,
    pub minute: ::std::os::raw::c_char,
    pub second: ::std::os::raw::c_char,
    pub pw_flag: ::std::os::raw::c_char,
    pub dummy: [::std::os::raw::c_char; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbhis__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<odbhis__bindgen_ty_1__bindgen_ty_5>() - 8usize];
    ["Alignment of odbhis__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<odbhis__bindgen_ty_1__bindgen_ty_5>() - 2usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_5::rec_type"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_5, rec_type) - 0usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_5::hour"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_5, hour) - 2usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_5::minute"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_5, minute) - 3usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_5::second"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_5, second) - 4usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_5::pw_flag"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_5, pw_flag) - 5usize];
    ["Offset of field: odbhis__bindgen_ty_1__bindgen_ty_5::dummy"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1__bindgen_ty_5, dummy) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbhis__bindgen_ty_1"][::std::mem::size_of::<odbhis__bindgen_ty_1>() - 8usize];
    ["Alignment of odbhis__bindgen_ty_1"][::std::mem::align_of::<odbhis__bindgen_ty_1>() - 2usize];
    ["Offset of field: odbhis__bindgen_ty_1::rec_alm"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1, rec_alm) - 0usize];
    ["Offset of field: odbhis__bindgen_ty_1::rec_mdi"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1, rec_mdi) - 0usize];
    ["Offset of field: odbhis__bindgen_ty_1::rec_sgn"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1, rec_sgn) - 0usize];
    ["Offset of field: odbhis__bindgen_ty_1::rec_date"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1, rec_date) - 0usize];
    ["Offset of field: odbhis__bindgen_ty_1::rec_time"]
        [::std::mem::offset_of!(odbhis__bindgen_ty_1, rec_time) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbhis"][::std::mem::size_of::<odbhis>() - 86usize];
    ["Alignment of odbhis"][::std::mem::align_of::<odbhis>() - 2usize];
    ["Offset of field: odbhis::s_no"][::std::mem::offset_of!(odbhis, s_no) - 0usize];
    ["Offset of field: odbhis::type_"][::std::mem::offset_of!(odbhis, type_) - 2usize];
    ["Offset of field: odbhis::e_no"][::std::mem::offset_of!(odbhis, e_no) - 4usize];
    ["Offset of field: odbhis::data"][::std::mem::offset_of!(odbhis, data) - 6usize];
};
pub type ODBHIS = odbhis;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbophis {
    pub rec_len: ::std::os::raw::c_short,
    pub rec_type: ::std::os::raw::c_short,
    pub u: odbophis__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbophis__bindgen_ty_1 {
    pub rec_mdi: odbophis__bindgen_ty_1__bindgen_ty_1,
    pub rec_sgn: odbophis__bindgen_ty_1__bindgen_ty_2,
    pub rec_alm: odbophis__bindgen_ty_1__bindgen_ty_3,
    pub rec_date: odbophis__bindgen_ty_1__bindgen_ty_4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis__bindgen_ty_1__bindgen_ty_1 {
    pub key_code: ::std::os::raw::c_char,
    pub pw_flag: ::std::os::raw::c_char,
    pub dummy: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<odbophis__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of odbophis__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<odbophis__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_1::key_code"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_1, key_code) - 0usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_1::pw_flag"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_1, pw_flag) - 1usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_1::dummy"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_1, dummy) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis__bindgen_ty_1__bindgen_ty_2 {
    pub sig_name: ::std::os::raw::c_short,
    pub sig_no: ::std::os::raw::c_short,
    pub sig_old: ::std::os::raw::c_char,
    pub sig_new: ::std::os::raw::c_char,
    pub dummy: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<odbophis__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of odbophis__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<odbophis__bindgen_ty_1__bindgen_ty_2>() - 2usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_2::sig_name"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_2, sig_name) - 0usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_2::sig_no"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_2, sig_no) - 2usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_2::sig_old"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_2, sig_old) - 4usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_2::sig_new"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_2, sig_new) - 5usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_2::dummy"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_2, dummy) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis__bindgen_ty_1__bindgen_ty_3 {
    pub alm_grp: ::std::os::raw::c_short,
    pub alm_no: ::std::os::raw::c_short,
    pub axis_no: ::std::os::raw::c_short,
    pub year: ::std::os::raw::c_short,
    pub month: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<odbophis__bindgen_ty_1__bindgen_ty_3>() - 20usize];
    ["Alignment of odbophis__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<odbophis__bindgen_ty_1__bindgen_ty_3>() - 2usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_3::alm_grp"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_3, alm_grp) - 0usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_3::alm_no"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_3, alm_no) - 2usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_3::axis_no"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_3, axis_no) - 4usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_3::year"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_3, year) - 6usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_3::month"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_3, month) - 8usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_3::day"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_3, day) - 10usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_3::hour"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_3, hour) - 12usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_3::minute"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_3, minute) - 14usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_3::second"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_3, second) - 16usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_3::dummy"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_3, dummy) - 18usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis__bindgen_ty_1__bindgen_ty_4 {
    pub evnt_type: ::std::os::raw::c_short,
    pub year: ::std::os::raw::c_short,
    pub month: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<odbophis__bindgen_ty_1__bindgen_ty_4>() - 16usize];
    ["Alignment of odbophis__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<odbophis__bindgen_ty_1__bindgen_ty_4>() - 2usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_4::evnt_type"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_4, evnt_type) - 0usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_4::year"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_4, year) - 2usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_4::month"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_4, month) - 4usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_4::day"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_4, day) - 6usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_4::hour"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_4, hour) - 8usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_4::minute"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_4, minute) - 10usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_4::second"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_4, second) - 12usize];
    ["Offset of field: odbophis__bindgen_ty_1__bindgen_ty_4::dummy"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1__bindgen_ty_4, dummy) - 14usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis__bindgen_ty_1"][::std::mem::size_of::<odbophis__bindgen_ty_1>() - 20usize];
    ["Alignment of odbophis__bindgen_ty_1"]
        [::std::mem::align_of::<odbophis__bindgen_ty_1>() - 2usize];
    ["Offset of field: odbophis__bindgen_ty_1::rec_mdi"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1, rec_mdi) - 0usize];
    ["Offset of field: odbophis__bindgen_ty_1::rec_sgn"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1, rec_sgn) - 0usize];
    ["Offset of field: odbophis__bindgen_ty_1::rec_alm"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1, rec_alm) - 0usize];
    ["Offset of field: odbophis__bindgen_ty_1::rec_date"]
        [::std::mem::offset_of!(odbophis__bindgen_ty_1, rec_date) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis"][::std::mem::size_of::<odbophis>() - 24usize];
    ["Alignment of odbophis"][::std::mem::align_of::<odbophis>() - 2usize];
    ["Offset of field: odbophis::rec_len"][::std::mem::offset_of!(odbophis, rec_len) - 0usize];
    ["Offset of field: odbophis::rec_type"][::std::mem::offset_of!(odbophis, rec_type) - 2usize];
    ["Offset of field: odbophis::u"][::std::mem::offset_of!(odbophis, u) - 4usize];
};
pub type ODBOPHIS = odbophis;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbophis3 {
    pub rec_len: ::std::os::raw::c_short,
    pub rec_type: ::std::os::raw::c_short,
    pub u: odbophis3__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbophis3__bindgen_ty_1 {
    pub rec_mdi: odbophis3__bindgen_ty_1__bindgen_ty_1,
    pub rec_sgn: odbophis3__bindgen_ty_1__bindgen_ty_2,
    pub rec_alm: odbophis3__bindgen_ty_1__bindgen_ty_3,
    pub rec_date: odbophis3__bindgen_ty_1__bindgen_ty_4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis3__bindgen_ty_1__bindgen_ty_1 {
    pub key_code: ::std::os::raw::c_char,
    pub pw_flag: ::std::os::raw::c_char,
    pub pth_no: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis3__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<odbophis3__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of odbophis3__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<odbophis3__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_1::key_code"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_1, key_code) - 0usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_1::pw_flag"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_1, pw_flag) - 1usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_1::pth_no"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_1, pth_no) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis3__bindgen_ty_1__bindgen_ty_2 {
    pub sig_name: ::std::os::raw::c_short,
    pub sig_no: ::std::os::raw::c_short,
    pub sig_old: ::std::os::raw::c_char,
    pub sig_new: ::std::os::raw::c_char,
    pub pmc_no: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis3__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<odbophis3__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of odbophis3__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<odbophis3__bindgen_ty_1__bindgen_ty_2>() - 2usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_2::sig_name"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_2, sig_name) - 0usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_2::sig_no"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_2, sig_no) - 2usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_2::sig_old"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_2, sig_old) - 4usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_2::sig_new"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_2, sig_new) - 5usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_2::pmc_no"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_2, pmc_no) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis3__bindgen_ty_1__bindgen_ty_3 {
    pub alm_grp: ::std::os::raw::c_short,
    pub alm_no: ::std::os::raw::c_short,
    pub axis_no: ::std::os::raw::c_short,
    pub year: ::std::os::raw::c_short,
    pub month: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub pth_no: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis3__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<odbophis3__bindgen_ty_1__bindgen_ty_3>() - 20usize];
    ["Alignment of odbophis3__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<odbophis3__bindgen_ty_1__bindgen_ty_3>() - 2usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_3::alm_grp"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_3, alm_grp) - 0usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_3::alm_no"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_3, alm_no) - 2usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_3::axis_no"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_3, axis_no) - 4usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_3::year"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_3, year) - 6usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_3::month"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_3, month) - 8usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_3::day"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_3, day) - 10usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_3::hour"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_3, hour) - 12usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_3::minute"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_3, minute) - 14usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_3::second"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_3, second) - 16usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_3::pth_no"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_3, pth_no) - 18usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis3__bindgen_ty_1__bindgen_ty_4 {
    pub evnt_type: ::std::os::raw::c_short,
    pub year: ::std::os::raw::c_short,
    pub month: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis3__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<odbophis3__bindgen_ty_1__bindgen_ty_4>() - 16usize];
    ["Alignment of odbophis3__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<odbophis3__bindgen_ty_1__bindgen_ty_4>() - 2usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_4::evnt_type"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_4, evnt_type) - 0usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_4::year"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_4, year) - 2usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_4::month"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_4, month) - 4usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_4::day"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_4, day) - 6usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_4::hour"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_4, hour) - 8usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_4::minute"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_4, minute) - 10usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_4::second"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_4, second) - 12usize];
    ["Offset of field: odbophis3__bindgen_ty_1__bindgen_ty_4::dummy"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1__bindgen_ty_4, dummy) - 14usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis3__bindgen_ty_1"][::std::mem::size_of::<odbophis3__bindgen_ty_1>() - 20usize];
    ["Alignment of odbophis3__bindgen_ty_1"]
        [::std::mem::align_of::<odbophis3__bindgen_ty_1>() - 2usize];
    ["Offset of field: odbophis3__bindgen_ty_1::rec_mdi"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1, rec_mdi) - 0usize];
    ["Offset of field: odbophis3__bindgen_ty_1::rec_sgn"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1, rec_sgn) - 0usize];
    ["Offset of field: odbophis3__bindgen_ty_1::rec_alm"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1, rec_alm) - 0usize];
    ["Offset of field: odbophis3__bindgen_ty_1::rec_date"]
        [::std::mem::offset_of!(odbophis3__bindgen_ty_1, rec_date) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis3"][::std::mem::size_of::<odbophis3>() - 24usize];
    ["Alignment of odbophis3"][::std::mem::align_of::<odbophis3>() - 2usize];
    ["Offset of field: odbophis3::rec_len"][::std::mem::offset_of!(odbophis3, rec_len) - 0usize];
    ["Offset of field: odbophis3::rec_type"][::std::mem::offset_of!(odbophis3, rec_type) - 2usize];
    ["Offset of field: odbophis3::u"][::std::mem::offset_of!(odbophis3, u) - 4usize];
};
pub type ODBOPHIS3 = odbophis3;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbophis4 {
    pub rec_len: ::std::os::raw::c_short,
    pub rec_type: ::std::os::raw::c_short,
    pub u: odbophis4__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbophis4__bindgen_ty_1 {
    pub rec_mdi: odbophis4__bindgen_ty_1__bindgen_ty_1,
    pub rec_sgn: odbophis4__bindgen_ty_1__bindgen_ty_2,
    pub rec_alm: odbophis4__bindgen_ty_1__bindgen_ty_3,
    pub rec_date: odbophis4__bindgen_ty_1__bindgen_ty_4,
    pub rec_ial: odbophis4__bindgen_ty_1__bindgen_ty_5,
    pub rec_mal: odbophis4__bindgen_ty_1__bindgen_ty_6,
    pub rec_opm: odbophis4__bindgen_ty_1__bindgen_ty_7,
    pub rec_ofs: odbophis4__bindgen_ty_1__bindgen_ty_8,
    pub rec_prm: odbophis4__bindgen_ty_1__bindgen_ty_9,
    pub rec_wof: odbophis4__bindgen_ty_1__bindgen_ty_10,
    pub rec_mac: odbophis4__bindgen_ty_1__bindgen_ty_11,
    pub rec_mac2: odbophis4__bindgen_ty_1__bindgen_ty_12,
    pub rec_scrn: odbophis4__bindgen_ty_1__bindgen_ty_13,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis4__bindgen_ty_1__bindgen_ty_1 {
    pub key_code: ::std::os::raw::c_char,
    pub pw_flag: ::std::os::raw::c_char,
    pub pth_no: ::std::os::raw::c_short,
    pub ex_flag: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis4__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<odbophis4__bindgen_ty_1__bindgen_ty_1>() - 12usize];
    ["Alignment of odbophis4__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<odbophis4__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_1::key_code"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_1, key_code) - 0usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_1::pw_flag"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_1, pw_flag) - 1usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_1::pth_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_1, pth_no) - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_1::ex_flag"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_1, ex_flag) - 4usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_1::hour"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_1, hour) - 6usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_1::minute"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_1, minute) - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_1::second"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_1, second) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis4__bindgen_ty_1__bindgen_ty_2 {
    pub sig_name: ::std::os::raw::c_short,
    pub sig_no: ::std::os::raw::c_short,
    pub sig_old: ::std::os::raw::c_char,
    pub sig_new: ::std::os::raw::c_char,
    pub pmc_no: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis4__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<odbophis4__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    ["Alignment of odbophis4__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<odbophis4__bindgen_ty_1__bindgen_ty_2>() - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_2::sig_name"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_2, sig_name) - 0usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_2::sig_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_2, sig_no) - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_2::sig_old"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_2, sig_old) - 4usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_2::sig_new"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_2, sig_new) - 5usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_2::pmc_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_2, pmc_no) - 6usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_2::hour"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_2, hour) - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_2::minute"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_2, minute) - 10usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_2::second"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_2, second) - 12usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_2::dummy"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_2, dummy) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis4__bindgen_ty_1__bindgen_ty_3 {
    pub alm_grp: ::std::os::raw::c_short,
    pub alm_no: ::std::os::raw::c_short,
    pub axis_no: ::std::os::raw::c_short,
    pub year: ::std::os::raw::c_short,
    pub month: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub pth_no: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis4__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<odbophis4__bindgen_ty_1__bindgen_ty_3>() - 20usize];
    ["Alignment of odbophis4__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<odbophis4__bindgen_ty_1__bindgen_ty_3>() - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_3::alm_grp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_3, alm_grp) - 0usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_3::alm_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_3, alm_no) - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_3::axis_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_3, axis_no) - 4usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_3::year"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_3, year) - 6usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_3::month"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_3, month) - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_3::day"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_3, day) - 10usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_3::hour"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_3, hour) - 12usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_3::minute"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_3, minute) - 14usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_3::second"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_3, second) - 16usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_3::pth_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_3, pth_no) - 18usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis4__bindgen_ty_1__bindgen_ty_4 {
    pub evnt_type: ::std::os::raw::c_short,
    pub year: ::std::os::raw::c_short,
    pub month: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis4__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<odbophis4__bindgen_ty_1__bindgen_ty_4>() - 16usize];
    ["Alignment of odbophis4__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<odbophis4__bindgen_ty_1__bindgen_ty_4>() - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_4::evnt_type"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_4, evnt_type) - 0usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_4::year"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_4, year) - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_4::month"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_4, month) - 4usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_4::day"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_4, day) - 6usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_4::hour"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_4, hour) - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_4::minute"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_4, minute) - 10usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_4::second"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_4, second) - 12usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_4::dummy"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_4, dummy) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis4__bindgen_ty_1__bindgen_ty_5 {
    pub alm_grp: ::std::os::raw::c_short,
    pub alm_no: ::std::os::raw::c_short,
    pub axis_no: ::std::os::raw::c_short,
    pub year: ::std::os::raw::c_short,
    pub month: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub pth_no: ::std::os::raw::c_short,
    pub sys_alm: ::std::os::raw::c_short,
    pub dsp_flg: ::std::os::raw::c_short,
    pub axis_num: ::std::os::raw::c_short,
    pub dummy1: ::std::os::raw::c_short,
    pub g_modal: [::std::os::raw::c_long; 10usize],
    pub g_dp: [::std::os::raw::c_char; 10usize],
    pub dummy2: ::std::os::raw::c_short,
    pub a_modal: [::std::os::raw::c_long; 10usize],
    pub a_dp: [::std::os::raw::c_char; 10usize],
    pub dummy3: ::std::os::raw::c_short,
    pub abs_pos: [::std::os::raw::c_long; 32usize],
    pub abs_dp: [::std::os::raw::c_char; 32usize],
    pub mcn_pos: [::std::os::raw::c_long; 32usize],
    pub mcn_dp: [::std::os::raw::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis4__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<odbophis4__bindgen_ty_1__bindgen_ty_5>() - 800usize];
    ["Alignment of odbophis4__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<odbophis4__bindgen_ty_1__bindgen_ty_5>() - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::alm_grp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, alm_grp) - 0usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::alm_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, alm_no) - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::axis_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, axis_no) - 4usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::year"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, year) - 6usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::month"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, month) - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::day"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, day) - 10usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::hour"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, hour) - 12usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::minute"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, minute) - 14usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::second"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, second) - 16usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::pth_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, pth_no) - 18usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::sys_alm"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, sys_alm) - 20usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::dsp_flg"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, dsp_flg) - 22usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::axis_num"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, axis_num) - 24usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::dummy1"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, dummy1) - 26usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::g_modal"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, g_modal) - 32usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::g_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, g_dp) - 112usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::dummy2"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, dummy2) - 122usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::a_modal"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, a_modal) - 128usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::a_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, a_dp) - 208usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::dummy3"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, dummy3) - 218usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::abs_pos"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, abs_pos) - 224usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::abs_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, abs_dp) - 480usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::mcn_pos"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, mcn_pos) - 512usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_5::mcn_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_5, mcn_dp) - 768usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis4__bindgen_ty_1__bindgen_ty_6 {
    pub alm_grp: ::std::os::raw::c_short,
    pub alm_no: ::std::os::raw::c_short,
    pub axis_no: ::std::os::raw::c_short,
    pub year: ::std::os::raw::c_short,
    pub month: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub pth_no: ::std::os::raw::c_short,
    pub sys_alm: ::std::os::raw::c_short,
    pub dsp_flg: ::std::os::raw::c_short,
    pub axis_num: ::std::os::raw::c_short,
    pub alm_msg: [::std::os::raw::c_char; 64usize],
    pub dummy1: ::std::os::raw::c_short,
    pub g_modal: [::std::os::raw::c_long; 10usize],
    pub g_dp: [::std::os::raw::c_char; 10usize],
    pub dummy2: ::std::os::raw::c_short,
    pub a_modal: [::std::os::raw::c_long; 10usize],
    pub a_dp: [::std::os::raw::c_char; 10usize],
    pub dummy3: ::std::os::raw::c_short,
    pub abs_pos: [::std::os::raw::c_long; 32usize],
    pub abs_dp: [::std::os::raw::c_char; 32usize],
    pub mcn_pos: [::std::os::raw::c_long; 32usize],
    pub mcn_dp: [::std::os::raw::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis4__bindgen_ty_1__bindgen_ty_6"]
        [::std::mem::size_of::<odbophis4__bindgen_ty_1__bindgen_ty_6>() - 864usize];
    ["Alignment of odbophis4__bindgen_ty_1__bindgen_ty_6"]
        [::std::mem::align_of::<odbophis4__bindgen_ty_1__bindgen_ty_6>() - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::alm_grp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, alm_grp) - 0usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::alm_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, alm_no) - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::axis_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, axis_no) - 4usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::year"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, year) - 6usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::month"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, month) - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::day"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, day) - 10usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::hour"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, hour) - 12usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::minute"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, minute) - 14usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::second"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, second) - 16usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::pth_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, pth_no) - 18usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::sys_alm"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, sys_alm) - 20usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::dsp_flg"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, dsp_flg) - 22usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::axis_num"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, axis_num) - 24usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::alm_msg"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, alm_msg) - 26usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::dummy1"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, dummy1) - 90usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::g_modal"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, g_modal) - 96usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::g_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, g_dp) - 176usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::dummy2"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, dummy2) - 186usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::a_modal"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, a_modal) - 192usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::a_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, a_dp) - 272usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::dummy3"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, dummy3) - 282usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::abs_pos"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, abs_pos) - 288usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::abs_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, abs_dp) - 544usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::mcn_pos"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, mcn_pos) - 576usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_6::mcn_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_6, mcn_dp) - 832usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis4__bindgen_ty_1__bindgen_ty_7 {
    pub dsp_flg: ::std::os::raw::c_short,
    pub om_no: ::std::os::raw::c_short,
    pub year: ::std::os::raw::c_short,
    pub month: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub ope_msg: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis4__bindgen_ty_1__bindgen_ty_7"]
        [::std::mem::size_of::<odbophis4__bindgen_ty_1__bindgen_ty_7>() - 272usize];
    ["Alignment of odbophis4__bindgen_ty_1__bindgen_ty_7"]
        [::std::mem::align_of::<odbophis4__bindgen_ty_1__bindgen_ty_7>() - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_7::dsp_flg"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_7, dsp_flg) - 0usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_7::om_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_7, om_no) - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_7::year"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_7, year) - 4usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_7::month"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_7, month) - 6usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_7::day"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_7, day) - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_7::hour"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_7, hour) - 10usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_7::minute"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_7, minute) - 12usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_7::second"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_7, second) - 14usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_7::ope_msg"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_7, ope_msg) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis4__bindgen_ty_1__bindgen_ty_8 {
    pub ofs_grp: ::std::os::raw::c_short,
    pub ofs_no: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub pth_no: ::std::os::raw::c_short,
    pub ofs_old: ::std::os::raw::c_long,
    pub ofs_new: ::std::os::raw::c_long,
    pub old_dp: ::std::os::raw::c_short,
    pub new_dp: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis4__bindgen_ty_1__bindgen_ty_8"]
        [::std::mem::size_of::<odbophis4__bindgen_ty_1__bindgen_ty_8>() - 40usize];
    ["Alignment of odbophis4__bindgen_ty_1__bindgen_ty_8"]
        [::std::mem::align_of::<odbophis4__bindgen_ty_1__bindgen_ty_8>() - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_8::ofs_grp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_8, ofs_grp) - 0usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_8::ofs_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_8, ofs_no) - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_8::hour"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_8, hour) - 4usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_8::minute"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_8, minute) - 6usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_8::second"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_8, second) - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_8::pth_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_8, pth_no) - 10usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_8::ofs_old"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_8, ofs_old) - 16usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_8::ofs_new"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_8, ofs_new) - 24usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_8::old_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_8, old_dp) - 32usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_8::new_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_8, new_dp) - 34usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis4__bindgen_ty_1__bindgen_ty_9 {
    pub prm_grp: ::std::os::raw::c_short,
    pub prm_num: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub prm_len: ::std::os::raw::c_short,
    pub prm_no: ::std::os::raw::c_long,
    pub prm_old: ::std::os::raw::c_long,
    pub prm_new: ::std::os::raw::c_long,
    pub old_dp: ::std::os::raw::c_short,
    pub new_dp: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis4__bindgen_ty_1__bindgen_ty_9"]
        [::std::mem::size_of::<odbophis4__bindgen_ty_1__bindgen_ty_9>() - 48usize];
    ["Alignment of odbophis4__bindgen_ty_1__bindgen_ty_9"]
        [::std::mem::align_of::<odbophis4__bindgen_ty_1__bindgen_ty_9>() - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_9::prm_grp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_9, prm_grp) - 0usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_9::prm_num"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_9, prm_num) - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_9::hour"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_9, hour) - 4usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_9::minute"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_9, minute) - 6usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_9::second"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_9, second) - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_9::prm_len"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_9, prm_len) - 10usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_9::prm_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_9, prm_no) - 16usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_9::prm_old"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_9, prm_old) - 24usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_9::prm_new"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_9, prm_new) - 32usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_9::old_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_9, old_dp) - 40usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_9::new_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_9, new_dp) - 42usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis4__bindgen_ty_1__bindgen_ty_10 {
    pub ofs_grp: ::std::os::raw::c_short,
    pub ofs_no: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub pth_no: ::std::os::raw::c_short,
    pub axis_no: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub ofs_old: ::std::os::raw::c_long,
    pub ofs_new: ::std::os::raw::c_long,
    pub old_dp: ::std::os::raw::c_short,
    pub new_dp: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis4__bindgen_ty_1__bindgen_ty_10"]
        [::std::mem::size_of::<odbophis4__bindgen_ty_1__bindgen_ty_10>() - 40usize];
    ["Alignment of odbophis4__bindgen_ty_1__bindgen_ty_10"]
        [::std::mem::align_of::<odbophis4__bindgen_ty_1__bindgen_ty_10>() - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_10::ofs_grp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_10, ofs_grp) - 0usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_10::ofs_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_10, ofs_no) - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_10::hour"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_10, hour) - 4usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_10::minute"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_10, minute) - 6usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_10::second"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_10, second) - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_10::pth_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_10, pth_no) - 10usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_10::axis_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_10, axis_no) - 12usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_10::dummy"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_10, dummy) - 14usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_10::ofs_old"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_10, ofs_old) - 16usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_10::ofs_new"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_10, ofs_new) - 24usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_10::old_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_10, old_dp) - 32usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_10::new_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_10, new_dp) - 34usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis4__bindgen_ty_1__bindgen_ty_11 {
    pub mac_no: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub pth_no: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub mac_old: ::std::os::raw::c_long,
    pub mac_new: ::std::os::raw::c_long,
    pub old_dp: ::std::os::raw::c_short,
    pub new_dp: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis4__bindgen_ty_1__bindgen_ty_11"]
        [::std::mem::size_of::<odbophis4__bindgen_ty_1__bindgen_ty_11>() - 40usize];
    ["Alignment of odbophis4__bindgen_ty_1__bindgen_ty_11"]
        [::std::mem::align_of::<odbophis4__bindgen_ty_1__bindgen_ty_11>() - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_11::mac_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_11, mac_no) - 0usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_11::hour"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_11, hour) - 2usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_11::minute"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_11, minute) - 4usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_11::second"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_11, second) - 6usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_11::pth_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_11, pth_no) - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_11::dummy"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_11, dummy) - 10usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_11::mac_old"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_11, mac_old) - 16usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_11::mac_new"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_11, mac_new) - 24usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_11::old_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_11, old_dp) - 32usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_11::new_dp"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_11, new_dp) - 34usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbophis4__bindgen_ty_1__bindgen_ty_12 {
    pub mac_no: ::std::os::raw::c_long,
    pub hour: ::std::os::raw::c_short,
    pub minute: ::std::os::raw::c_short,
    pub second: ::std::os::raw::c_short,
    pub pth_no: ::std::os::raw::c_short,
    pub mac_old: ::std::os::raw::c_long,
    pub mac_new: ::std::os::raw::c_long,
    pub old_dp: ::std::os::raw::c_short,
    pub new_dp: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of odbophis4__bindgen_ty_1__bindgen_ty_12"]
        [::std::mem::size_of::<odbophis4__bindgen_ty_1__bindgen_ty_12>() - 40usize];
    ["Alignment of odbophis4__bindgen_ty_1__bindgen_ty_12"]
        [::std::mem::align_of::<odbophis4__bindgen_ty_1__bindgen_ty_12>() - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_12::mac_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_12, mac_no) - 0usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_12::hour"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_12, hour) - 8usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_12::minute"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_12, minute) - 10usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_12::second"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_12, second) - 12usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_12::pth_no"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_12, pth_no) - 14usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_12::mac_old"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_12, mac_old) - 16usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_12::mac_new"]
        [::std::mem::offset_of!(odbophis4__bindgen_ty_1__bindgen_ty_12, mac_new) - 24usize];
    ["Offset of field: odbophis4__bindgen_ty_1__bindgen_ty_12::old_dp"]
